--nino：门派
--[[
1：星宿
2：丐帮
3：古墓
4：武当
5：少林
6：血刀
7：逍遥

8：白驼
9：唐门
]]

CC.MP = {
	{"星宿派", nil, 1, "毒鼎"},
	{"丐帮", nil, 1, "乞儿"},
	{"古墓派", nil, 1, "清心"},
	{"武当派", nil, 1, "侠义"},
	{"少林寺", nil, 1, "佛性"},
	{"密宗", nil, 1, "蛮夷"},	
	{"逍遥派", nil, 1, "自在"},	
	{"白驼山", nil, 1, "奇毒"}, --武骧金星：开放白驼山
	{"唐门", nil, 1, "诡道"}, --武骧金星：开放唐门
	{"桃花岛", nil, 1, "遁甲"}, --沼跃鱼：开放桃花岛
    {"一刀流", nil, 1, "破敌"}, --豸苗：开放一刀流	
	{"日月神教", nil, 1, "不败"}, --豸苗：开放日月神教
    {"明教", nil, 1, "焚影"}, --沼跃鱼：开放明教
	{"五岳剑派", nil, 1, "正气"},--沼跃鱼：开放五岳剑派
	{"大理", nil, 1, "皇龙"},--沼跃鱼：开放五岳剑派
	{"全真教", nil, 1, "长生"},--沼跃鱼：开放五岳剑派
	{"峨眉派", nil, 1, "太清"},--竹风雨滴：开放峨眉派
	{"崆峒派", nil, 1, "迥异"},--竹风雨滴：开放崆峒派
	{"昆仑派", nil, 1, "玉虚"},--竹风雨滴＆tony：开放昆仑派
}

CC.MPAttrib = { --1攻2防3轻，4医5毒6解7暗，8命9内，10 11 12 13四系
	[0] = {0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0},
	{0.95, 0.95, 1.1, 50, 50, 50, 50, 1, 0.9, 0, 0, 0, 0}, --星宿
	{1.1, 1, 0.95, 0, 0, 0, 0, 1.1, 0.9, 0, 0, 0, 0}, --丐帮
	{0.9, 0.9, 1.2, 0, 0, 0, 60, 1, 1, 0, 0, 0, 0}, --古墓
	{1.05, 1.05, 1.05, 0, 0, 0, 0, 1.1, 1, 0, 0, 0, 0}, --武当
	{1, 1.1, 0.9, 0, 0, 0, 0, 1, 1.05, 0, 0, 0, 0}, --少林
	{1.2, 0.9, 1, 0, 0, 0, 0, 0.95, 1.15, 0, 0, 0, 0}, --血刀
	{0.9, 1, 1.1, 50, 0, 0, 0, 0.9, 1.15, 0, 0, 0, 0}, --逍遥
	{1, 0.9, 1, 0, 100, 100, 0, 1.05, 1, 0, 0, 0, 0}, --白驼
	{1, 1, 1, 0, 100, 100, 100, 0.9, 1, 0, 0, 0, 0}, --唐门
	{0.9, 1, 1.3, 0, 0, 0, 0, 1, 1.1, 0, 0, 0, 0}, --桃花岛
	{1.2, 0.9, 1.1, 0, 0, 0, 0, 1.05, 1, 0, 0, 0, 0}, --一刀流
	{1.2, 0.9, 1.2, 0, 0, 0, 100, 1.05, 1, 0, 0, 0, 0}, --日月
	{0.95, 1.2, 1, 50, 0, 0, 0, 1.1, 1.2, 0, 0, 0, 0}, --明教
	{1.2, 0.9, 1.1, 0, 0, 0, 0, 1.05, 1.2, 0, 0, 0, 0}, --五岳剑派
	{1, 1.1, 1.0, 50, 0, 0, 0, 1, 1.2, 0, 0, 0, 0}, --大理
	{1.05, 1.05, 1.0, 50, 0, 0, 0, 1.1, 1.1, 0, 0, 0, 0}, --全真
	{1.15, 1.15, 1.15, 100, 100, 100, 0, 1, 1, 0, 0, 0, 0}, --峨眉
	{1.2, 0.9, 1.0, 0, 0, 0, 0, 1.2, 1, 0, 0, 0, 0}, --崆峒
	{0.9, 1.2, 1.1, 200, 0, 0, 0, 1, 1.1, 0, 1, 1, 0}, --昆仑
}

CC.MPAttrib_none = {0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0}

CC.MPINFO = {
	"星宿老仙丁春秋叛出逍遥派后所创。武学以毒为主，让人防不胜防。派中秘传化功大法，源自北冥神功，可化人内力于无形。门下弟子也许不算最强，但绝对最让人胆寒。", 
	"天下第一大帮，凡是叫花子皆属丐帮，除强济弱，重诺守信。嫡传武学打狗棒法千变万化，降龙十八掌刚猛无双。帮中弟子武功博杂不一，以肩负的布袋数量多寡定其辈分高低。",
	"奇女子林朝英与全真祖师王重阳穷尽一生纠缠始终有缘无份。在古墓郁郁而终，叹芳踪孤寂，红颜凋残。武学上剑走偏锋，以快打慢。讲究十二多，十二少，内家养生有术。",
	"一代奇人张三丰在武当山上开宗立派，讲究以静制动，以柔克刚，以短胜长，以慢击快、以意运气，以气运身。武当武学进展缓慢，属万日有成。重于防守，急功进躁乃大忌。",
	"俗话说天下武功出少林，百年基业并非浪得虚名。自达摩祖师以降，历代高僧频出，七十二项绝技名动江湖。武学上攻守兼备，有降龙伏虎之威。传闻寺内有隐藏的绝世高手。",
	"西域密宗，地处边疆，担任各国护国神教，因西域资源匮乏，故座下修炼多以恶劣环境自行磨砺，同时对中原门派敌视甚深，其中以大轮寺与金轮寺为代表，但也有血刀门之类的邪派。",
	"武林中鲜为人知的门派，门下弟子无不面目俊朗，资质聪慧。武学讲究轻灵飘逸、闲雅清隽，威力无穷，得一则能所向披靡。但其内功运行与常道相悖，练之需先散尽原来真气。",
	"五绝之一西毒欧阳锋所创立的门派，位于西域双旗镇北。门人擅长驯养毒蛇，能驱蛇为阵，武功阴险毒辣。独门绝学逆练神功能使经脉倒逆，怪招迭出，疯癫之余却令人心惊。",
	"不知道什么时候冒出来的新兴家族式经营门派，以暗器和毒药雄踞蜀中。唐门弟子行事诡秘，遇事不按常理出牌，但善于设计、发明和使用各种暗器与毒药，威力惊人。",
	"东海黄药师所创，黄药师精通天文地理，奇门遁甲，座下弟子皆天资不凡，可惜弟子稀少，自当年叛徒黑风双煞离开，已多年未曾再收入弟子。",
	"昔日吕纯阳大弟子谢云流遭人算计被迫叛出纯阳宫远赴东瀛，自创一刀流。",
	"雄踞黑木崖，当世二大神教之一，教内教徒来自五湖四海，历任教主皆有一统江湖之志，教内绝学葵花宝典威力无穷，吸星大法可称当时第一魔功。",
	"当世二大魔教之一，相传传自西域，光明顶为明教总坛，易守难攻，教内弟子皆舍身忘死，自前任教主阳顶天失踪后，明教内部争权夺利，多名骨干离开，实力大减，但也不容小视。",
	"以五岳为基础，以日月魔教为仇敌所建立的门派。派中多以练剑为主，但各自为政，被日月魔教压制。现嵩山派正努力整合各派，反攻黑木崖。",
	"自灭南诏国之后成立的白族地方政权，以段家为主要成员与骨干，其中不乏皈依佛门的皇室成员，以一阳指与六脉神剑闻名于中原。",
	"全真教为中原第一道教，前任掌门为五绝之首王重阳，现由全真七子共掌教派。全真绝学先天功，以气为主，世间唯一可气返先天的绝世内功，教内又以天罡北斗阵闻名于世。",
	"大侠郭靖二女儿所创门派，继承郭靖遗志，保家卫国为己任。",
	"高人木灵子创立门派，与少林、武当、峨眉、昆仑并称为武林五大派。",
	"号称道门祖庭，巍峨于西疆雄峰之上。此派源远流长，虽少于中原走动，但昆仑剑法、轻功依然声名赫赫，派中奇人昆仑三圣更曾独闯少林，打下赫赫名声。可惜现今掌门却是碌碌无为。",
	}

CC.MPINFO2 = {
	"攻击防御减5%，轻功加10％，医疗用毒解毒暗器能力加50，内力上限减10％",
	"攻击加10％，轻功减5%，生命上限加10％，内力上限减10％",
	"攻击防御减10％，轻功加20％，暗器能力加60",
	"攻击防御轻功加5%，生命上限加10％",
	"防御加10％，轻功减10％，内力上限加5%",
	"攻击加20％，防御减10％，生命上限减5％，内力上限加15％",	
	"攻击减10％，轻功加10％，医疗能力加50，生命上限减10％，内力上限加15％",	
	"防御减10％，用毒解毒能力加100,  生命上限加5%",
	"用毒解毒暗器能力加100,  生命上限减10％",
	"攻击减10％，轻功加30％，内力上限加10％",	
	"攻击加20％，防御减10％，轻功加10％，生命上限加5％",
	"攻击加20％，防御减10％，轻功加20％，暗器能力加100，生命上限加5％",
	"攻击减5%，防御加20％，医疗能力加50，生命上限加10％，内力上限加20％",
	"攻击加20％，防御减10％，轻功加10％，生命上限加5％，内力上限加20％",
	"防御加10％，医疗能力加50，内力上限加20％",
	"攻击加5％，防御加5％，生命上限加10％，内力上限加10％",
	"攻击、防御、轻功加15％，医疗用毒解毒能力加100",
	"攻击加20％，防御减10％，生命上限加20％",
	"防御加20％，轻功加10％，内力上限加10％，医疗能力增加200",
}

CC.MPDJ = {
	{"入门弟子", "高级弟子", "掌门"},--星宿
	{"五袋弟子", "八袋弟子", "长老", "前帮主"},--丐帮
	{"入门弟子", "高级弟子", "掌门"},--古墓
	{"入门弟子", "普通弟子", "高级弟子", "亲传弟子", "掌门"},--五当
	{"入门弟子", "普通弟子", "高级弟子", "掌院", "方丈"},--少林
	{"喇嘛", "僧正", "法王"},--密宗
	{"普通弟子", "掌门", "掌门", "掌门", "掌门"}, --逍遥--鱼兄掌门5是用来领悟的，这个留着
	{"弟子", "少主", "庄主"},--白驼
	{"入门弟子", "内门弟子", "长老", "堡主"},--唐门
    {"记名弟子", "入室弟子", "岛主"},--桃花岛
	{"初级弟子", "中级弟子", "高级弟子", "宗主"},--一刀流
	{"教众", "长老", "护法", "副教主", "教主"},--日月
	{"普通弟子", "核心弟子", "四大法王", "光明使者", "教主"},--明教
	{"普通弟子", "亲传弟子", "长老", "掌门", "盟主"},--五岳剑派
	{"侍卫", "皇族", "大师", "高僧"},--大理
	{"四代弟子", "三代弟子", "二代弟子", "太上长老", "掌教"}, --全真
	{"弟子", "掌门", "使者", "祖师"}, --峨眉
	{"入门弟子", "内门弟子", "堂主", "长老", "掌派"}, --崆峒
	{"普通弟子", "峰主", "掌门", "前代掌门", "太上长老"}, --昆仑
}

CC.PSKILL = {
	{"以身饲毒", "毒心血脉", "淬毒"},
	{"妙手", "污衣", "打狗棍阵"},
	{"玉蜂针", "寒玉", "素心"},
	{"乾坤", "八卦", "无极"},
	{"金钟罩", "铁布衫", "袈裟伏魔"},
	{"铁臂", "钢躯", "神威"},	
	{"北冥", "无相", "白虹"},
	{"玄蛇", "玉蟾", "逆运"},
	{"器绝十方", "纸上谈兵", "灵犀七打", "千魂弄巧"}, --武骧金星：取消暗器回收
	{"落英", "通晓", "怒涛"},
	{"致命", "切返", "居合"}, --武骧金星：暂定
	{"雄锋", "霸道", "魔威"}, --武骧金星：暂定
	{"焚躯", "天佑", "同袍"},--武骧金星：暂定
    {"剑宗", "浩然", "剑意"},--武骧金星：暂定
    {"阳炎", "铁指寸劲", "气疗"},--武骧金星：暂定
	{"七星", "金雁", "长生"},
	{"动静", "太虚", "普度"}
	--{"上清", "合离", "颠倒"}
}

CC.ASKILL = {
	{"口蜜腹剑", "三笑逍遥散"},
	{"锁喉擒拿手", "莲花落", "醉八仙"},
	{"道玄通曲", "巧笑倩兮"},
	{"以柔克刚", "以静制动"},
	{"点化", "金刚不坏体", "佛门狮子吼"},
	{"金刚乘", "无想转生"},	
	{"无争", "凌波"},	
	{"集毒", "蟾息"},	
	{"满天花雨", "千机"},	
	{"九花玉露", "碧海幻境"},
    {"秘剑·切返", "斩流·切返"},	
	{"三尸脑神丹", "逆杀"}, --武骧金星：暂定
	{"以身殉教", "光明裁决"},--武骧金星：暂定
    {"连环三仙剑", "冰封天地"},--武骧金星：暂定
    {"秘孔战术", "转龙呼吸"},--武骧金星：暂定
	{"重阳遗剑", "气返先天"},
	{"南明离火", "三阳归一"},
    {"分光两仪", "九天都录"},
	{"微尘阵", "大静神"},
}

CC.SKILLNAME = {
	{"以身饲毒", "毒心血脉", "淬毒", "口蜜腹剑", "三笑逍遥散"},
	{"妙手", "污衣", "打狗棍阵", "锁喉擒拿手", "莲花落", "醉八仙"},
	{"玉蜂针", "寒玉", "素心", "道玄通曲", "巧笑倩兮"},
	{"乾坤", "八卦", "无极", "以柔克刚", "以静制动"},
	{"金钟罩", "铁布衫", "袈裟伏魔", "点化", "金刚不坏体", "佛门狮子吼"},
	{"铁臂", "钢躯", "神威", "金刚乘", "无想转生"},
	{"北冥", "无相", "白虹", "无争", "凌波"},
	{"玄蛇", "玉蟾", "逆运", "集毒", "蟾息"},
	{"器绝十方", "纸上谈兵", "灵犀七打", "千魂弄巧", "满天花雨", "千机"}, --武骧金星：取消暗器回收
	{"落英", "通晓", "怒涛", "九花玉露", "碧海幻境"},
    {"致命", "切返", "居合", "秘剑·切返", "斩流·切返"},	
	{"雄锋", "霸道", "魔威", "三尸脑神丹", "逆杀"},
    {"焚躯", "天佑", "同袍", "以身殉教", "光明裁决"},
	{"剑宗", "浩然", "剑意", "连环三仙剑", "冰封天地"},	
	{"阳炎", "铁指寸劲", "气疗", "秘孔战术", "转龙呼吸"},	
	{"七星", "金雁", "长生", "重阳遗剑", "气返先天"},
	{"动静", "太虚", "普度", "南明离火", "三阳归一"},
	{"上清", "合离", "颠倒", "分光两仪", "九天都录"},
	{"法自然", "龙脉剑", "雄峰刀", "微尘阵", "大静神"},

}

CC.MPMENU = {"门派介绍", "传授技能", "叛教脱离"}

CC.MPSUBMENU = {

}

CC.SKILLINFO = {
	{
	"效果：被攻击时自身中毒程度增加，*      中毒越深集气速度越快*条件：被动技能",
	"效果：攻击时自身中毒加基础伤害*      被攻击时自身中毒减基础伤害*条件：被动技能",
	"效果：攻击时几率追加伤害，伤害值与*      自身和目标的中毒程度有关*条件：被动技能",
	"效果：一定几率周围四格敌人怒气值清零*      且中毒程度增加*消耗：体力20点",
	"效果：一定几率周围三格内普通小兵三次*      行动后即死*消耗：体力20点内力200点"
	},
	{
	"效果：攻击时高几率窃取敌人物品一件*条件：被动技能",
	"效果：装备防具效果双倍*条件：被动技能",
	"效果：场上每多一位会丐帮技能的己方*      人物集气速度+2%，上限10%*条件：被动技能",
	"效果：自身和周围一格内敌人停止集气*      五十时序，免疫杀气*消耗：体力15点",
	"效果：自身和周围一格内己方内伤清零*消耗：体力30点",
	"效果：自身八次行动内攻击和防御加倍，*      免疫杀气，内力消耗加倍*条件：包里有酒*消耗：体力15点",
	},
	{
	"效果：被攻击后几率反击伤害50点生命*条件：被动技能",
	"效果：内力消耗减20%*条件：被动技能",
	"效果：连击率增加10点*条件：被动技能",
	"效果：场上所有人物怒气减半*消耗：体力20点",
	"效果：几率使任意目标敌人叛变一定时序*消耗：体力25点",
	},	
	{
	"效果：攻击时伤害减低10%，被攻击*      时伤害减低15%*条件：被动技能",
	"效果：被攻击时存储伤害值，下次*      攻击时追加伤害，上限与门*      派等级有关*条件：被动技能",
	"效果：被攻击时如果被杀气则下次攻*      击附带等同的杀气值*条件：被动技能，门派等级2以上",
	"效果：自身怒气清零，目标敌人怒气*      减半且一定时序内集气速减半*消耗：体力25点",
	"效果：立刻进入防御状态无法行动，*      免疫杀气，一定时序后集气全*      满，攻击时把自身的异常状态*      加诸于敌人身上，自身状态全*      清，攻击效果双倍*消耗：体力20点内力500点",
	},		
	{
	"效果：被攻击时几率进入防御状态*条件：被动技能",
	"效果：防御状态下气防值增加*条件：被动技能",
	"效果：品德越高攻击效果越高*条件：被动技能",
	"效果：低几率使任意目标敌人退出战*      场，几率与自身品德有关*条件：品德50以上*消耗：体力25点",
	"效果：一定时序内以内力代替伤害，*      停止集气*条件：保持内力1000点以上*消耗：体力20点内力200点",
	"效果：全体敌人如果内力小于自身则集气*      槽后退，效果与现有内力成正比*条件：体力3000点以上*消耗：体力30点与现有内力值的一半",
	},			
	{
	"效果：攻击额外增加伤害*暴击、蓄力攻击伤害增加*效果随等级提高增加*条件：被动技能",
	"效果：减少受到的伤害*被攻击减少内伤*效果随等级提高增加*条件：被动技能",
	"效果：蓄力必成功*暴击后大幅杀集气*效果与内力值与武功消耗有关*条件：被动技能，僧正以上发动效果",
	"效果：怒气持续爆发*条件：保持生命为生命最大值的一半以上*消耗：体力15点，每时序减5点血*备注：爆发状态中回血武功失效",
	"效果：按现有生命与最大生命值的百分*      比值与任意敌人交换血量；一场*      战斗限一次*条件：生命超过生命最大值的一半*消耗：体力25点",
	},			
	{
	"效果：被攻击时几率发动北冥真气*      吸取敌方内力*条件：被动技能",
	"效果：攻击时无视敌我兵器值系数*      差伤害增加；被攻击时无视*      敌我兵器值系数差伤害减少*条件：被动技能",
	"效果：选择攻击目标时无视地形限制*条件：被动技能",
	"效果：场上所有人物下次行动无法*      进行攻击*消耗：体力15点内力300点",
	"效果：接下来受到的三次攻击中可*      以预先进行移动避开*消耗：体力20点",
	},	
	{
	"效果：攻击时几率无视毒抗上毒*条件：被动技能",
	"效果：蛤蟆功储气防御效果提升*条件：被动技能",
	"效果：受到攻击时几率不被封穴*条件：被动技能",
	"效果：使用后己方全体中毒清零，*      下次攻击额外增加伤害*消耗：体力30点内力300点",
	"效果：使用后进行蓄力和防御，*      效果上升*消耗：体力20点",
	},		
	{
	--"效果：战场上几率得到随机暗器*条件：被动技能", 武骧金星：取消暗器回收
	"效果：被攻击时以暗器反击*条件：被动技能", --，消耗暗器一个
	"效果：每用暗器杀一人实战额外提升五点*条件：被动技能", --暗器能力提升三点*      
	"效果：使用暗器攻击时几率封穴及流血*      实战越高几率越高*条件：被动技能",
	"效果：使用暗器致死时可控制敌方*      一定时序后敌方自动死亡，*      实战越高控制时序越长*条件：被动技能，体力50以上*      每控制一人体力减5",
	"效果：对自身十格内敌人随机使用暗器*      攻击十次*条件：体力50以上内力5000以上*消耗：体力25点内力1000点", --*      暗器十个
	"效果：切换攻击方式", --*      暗器十个
	},		
	{
	"效果：发动桃花绝技效果可同时触发，不需学全*增加集气速度*效果随等级提高与碧海潮声曲增加*条件：被动技能",
	"效果：修炼武功效果增加*效果随等级提高增加*条件：被动技能",
	"效果：第一击可发动真传·碧海怒涛*效果随等级提高与碧海潮生曲增加*条件：被动技能",
	"效果：使用后己方全体内伤清零*      下次被攻击额外减少伤害*消耗：体力30点内力300点",
	"效果：接下来受到的三次攻击中可*      完全闪避*消耗：体力20点",
	},
	    {
	--"效果：暂定"
	"效果：攻击伤害必定增加50%，几率增加100%*      几率随门派等级提升*条件：被动技能", 
	"效果：被攻击几率打断目标攻击，且自身下回合连击次数增加一次，最多增加三次*      几率随门派等级提升*条件：被动技能",     
	"效果：攻击时无视目标一部分防御效果*      每级无视6%的所有防御效果*条件：被动技能",
	"效果：四个回合内必定发动秘剑·切返*消耗：体力15点",
	"效果：四个回合内必定至少三连击且几率增加连击次数，最高连击次数六次*消耗：体力20点",
	},	
	    {
	--"效果：暂定"
	"效果：提高攻防轻对自身的加成*      随门派等级提升而提升*条件：被动技能", 
	"效果：提高暴击率，连击率，连击伤害*      随门派等级提升而提升*条件：被动技能",     
	"效果：提高吸星大法效果；修炼葵花无集气惩罚*      *条件：被动技能，护法等级以上生效",
	"效果：每场战斗限用一次，目标100时序后发狂敌我不分，500时序时将自动死亡*消耗：体力25点",
	"效果：自身4格范围敌方100时序内持续掉血，掉血量增加且无法恢复*      无法造成杀气*消耗：体力25点",
	},
		    {
	--"效果：暂定", 武骧金星：取消暗器回收
	"效果：被攻击时机率使敌人减少生命*并造成灼烧和内伤*效果随等级提高与光明裁决而增加*条件：被动技能",
	"效果：攻击效果随四系系数增加而提高*防御效果随现有内力变化而变化*两名以上明教弟子可组成圣火阵*条件：被动技能",
	"效果：己方有人退场则恢复内力与生命*自身退场对敌人造成不良状态*条件：被动技能，弟子以上发动效果",
	"效果：暴怒时以全身内力攻击敌人*使用后自身奄奄一息 *消耗：体力50点",
	"效果：标定一个敌人为异教徒*己方攻击时有伤害加成与生命收益*全局可标定三次*消耗：体力25点内力500点",
	},
    {
	"效果：使用剑法伤害增加*攻击后恢复集气*效果随等级提高增加*条件：被动技能",
	"效果：被连击时连击伤害降低*效果随等级提高增加*条件：被动技能",
	"效果：不需学满也能使用五岳剑法*可以同时触发*条件：被动技能，核心弟子以上发动效果",
	"效果：本次攻击必然三连击*      *消耗：体力30点内力1000点",
	"效果：本次攻击必然全屏攻击* 并且造成所有敌方寒冰*消耗：体力25点内力1500点",
	},
	{
	"效果：攻击时根据内力强上灼烧*条件：被动技能",
	"效果：攻击气攻效果随拳系指数升高*效果随等级提高增加*条件：被动技能",
	"效果：攻击己方转为治疗*效果随医疗指数与原伤害有关*条件：被动技能",
	"效果：本次攻击附加特殊点穴效果*低几率致死攻击*消耗：体力30点内力1000点",
	"效果：使用后100时序内被攻击转为治疗效果* 一灯有隐藏特效*消耗：体力25点内力1500点",
	},
	{
	"效果：多于一名人组成天罡北斗阵*气攻气防与闪避几率上升*效果随等级提高增加*条件：被动技能",
	"效果：内力提高集气速度*轻功提高移动距离*效果随等级提高增加*条件：被动技能",
	"效果：时序恢复生命并清除内伤*被攻击后恢复生命*条件：被动技能",
	"效果：将内力灌注于伤害与气攻中发出强烈一击* 攻击者防御力与气防消失*消耗：体力30点内力1000点",
	"效果：通过内力转换将自己的生命恢复到最大值* 清除所有队友的内伤*消耗：体力25点",
	},
	{
	"效果：攻击伤害增加*条件：被动技能",
	"效果：攻击次数增加*条件：被动技能",
	"效果：被攻击几率闪避*条件：被动技能",
	"效果：当前1/2内力值让全体敌人集气后退：体力20点",
	"效果：我方队友内伤清零*消耗：体力20点",
	},
	{
	"效果：攻击伤害随系数增加*条件：被动技能",
	"效果：系数增高，自身受到伤害降低*条件：被动技能",
	"效果：攻击值几率追加伤害*条件：被动技能",
	"效果：将自身拳系、内力加成伤害攻击敌人*消耗：体力20点内力2000点",
	"效果：消耗自身内力、体力抵挡伤害*消耗：体力20点内力2000点",
	},
	{
	"效果：根据使用不同的刀剑组合，改变场地属性",
	"效果：使用剑法攻击可埋下气劲，使敌人自伤",
	"效果：使用刀法攻击以自身防御力加成伤害",
	"效果：直接展开「两仪微尘阵」一定时序*消耗：体力20点内力2500点",
	"效果：一定时序享受「随遇而安」印信效果*消耗：内力1000点战意10点",
	},
}

CC.NLJS = {}
CC.NLJS2 = {}
local xxxx = "详详细细详详细细详详细细详详细细详详细细详详细细详详细细详详详"
CC.NLJS["零二七"] = {
"称号：苍半无双",
"升级时能力成长基数提升",
"无视资质限制内力上限一万点",
"初始自带北冥神功及其领悟",
"北冥真气护体时免疫封穴灼烧冰封迟缓和流血",
"掌握吸功精髓，被攻击吸取生命内力与体力",
"并附加中毒与内伤，效果随天书增强",
"时序吸收自身10格范围内敌人内力与气防",
"无需修炼先天功与神照功即可掌握炼虚化神",
"集气速度随生命下降而提升",
"修练自宫类武学不会受到初始集气值下降影响",
"四本书觉醒：连击率和暴击率上升，初始战意上升",
"            掌握逍遥心法，每次攻击有几率回复生命和内力",
"七本书觉醒：必发动北冥真气护体",
"            掌握逍遥鹏飞诀，每次攻击必然回复生命和内力",
"            被攻击时，几率发动对招，使攻击无效化并吸收内力",
"            被攻击时，以内力替代部分伤害",
"十本书觉醒：武学常识提升至一百点",
"            掌握逍遥雁行诀，时序几率立即行动",
"—— 完 ——",
}

CC.NLJS["水镜先生"] = {
"称号：浑天水镜",
"无视任何限制条件装备任意兵器",
"装备提升能力值翻倍",
"初始自带左右互搏",
"修练自宫类武学不会受到初始集气值下降影响",
"四本书觉醒：领悟火凤燎原，攻击范围大幅提升",
"七本书觉醒：左右互搏几率上升",
"十本书觉醒：领悟云体风身，发动后如受到攻击则以对方之武功反",
"            击全体敌人，自身习得该武功，经一定时序可再发动",
"            根据云体发动次数，缩短冷却时间，并加强火凤燎原",
"            气攻",
"战意技增强：战意超过120后，云体风身冷却效果达到最大",
"—— 完 ——",
}

CC.NLJS["萧雨客"] = {
"称号：血翼军神",
"初始自带左右互搏",
"修练自宫类武学不会受到初始集气值下降影响",
"实战每增加15点 四系兵器值增加1点 最高上限30点",
"每获得一本天书武常上升10点 最高100",
--"受到攻击时产生蓄力 达到一定程度后可发动万里龙城大量增加气攻值",
"自带指令＜军神＞",
"初始指令＜血翼＞ 发动后此回合攻击必暴击 杀死敌人实战经验加倍",
"四本书觉醒：领悟＜影杀＞　放出一个分身协助战斗 每场战斗限一次",
"七本书觉醒：领悟＜指挥＞　令一个队友集气值提升至1000",
"十本书觉醒：领悟＜再临＞　复活被击退队友一员 每场战斗限一次",
"            ＜影杀＞的消耗减少",
"—— 完 ——",
}

CC.NLJS["王小石"] = {
"称号：相思销魂",
"无法出刀剑归真",
"初始自带左右互搏",
"根据耍刀技巧增加暴击率，根据御剑能力增加连击率",
"根据刀系系数增加气攻，根据剑系系数增加集气速度",
"用剑系武功几率使出凌空销魂剑，附加内伤/迟缓/封穴/流血效果",
"用刀系武功几率使出隔空相思刀，全体杀气300，杀生命100",
"四本书觉醒：领悟刀剑极意，出左右互搏的前提下，分别使用出刀",
"            和剑系武功可以使出三种极意：",
"            相思销魂·爱恨交缠：生命值越低伤害越高",
"            天地逆转·乾坤震爆：必破防且追加杀气",
"            明分暗合·缘灭缘生：大范围三连击",
"七本书觉醒：左右互搏几率上升",
"十本书觉醒：领悟后天大乘诀，被攻击时几率出现随机三种效果：",
"            情意绵绵：伤害杀气减半，并使攻击者虚弱",
"            爱恨交织：伤害反弹，与战意有关，至少一半",
"            愁肠百转：免疫额外杀气，同时杀气变集气",
"            领悟刀剑逆杀，触发后天大乘诀时几率以第一格武功反击",
"—— 完 ——",
}

CC.NLJS["萧秋水"] = {
"称号：太上忘情",
"剑系能力双倍成长",
"御剑每增加40点增加5%集气速度和增加5%攻击伤害",
"四本书觉醒：领悟忘情天书第一层：时序回内伤/毒/迟缓/流血",
"七本书觉醒：领悟忘情天书第二层",
"            内功加力随机出现三种特效：",
"            水逝：杀怒气",
"            火延：大幅度加杀气",
"            金断：伤害加30%",
"            内功护体随机出现两种特效：",
"            木顽：以内力顶替伤害50%",
"            土掩：伤害-30%",
"十本书觉醒：领悟惊天一剑，使用任何剑法必连击，几率连续攻",
"            击3-5次",
"—— 完 ——",
}

CC.NLJS["东方未明"] = {
"称号：万般皆通",
"五系双倍成长",
"每练一拳到极+5%攻",
"每练一剑到极+5%速",
"每练一刀到极+5%防",
"每练一特到极怒气上升速度+5%",
"每练一暗到极+50初始集气",
"每练一内功+250内力上限",
"四本书觉醒：可以领悟特技表里的特技",
"特技表：",
"攻击力550以上领悟会心一击：生命值低于1/2时，35%几率攻击加倍",
"防御力550以上领悟铜身铁臂：30%几率战斗中所受到的伤害值减少1/3",
"轻功550以上领悟逍遥游步：25%几率避过敌人的攻击",
"内力上限6500以上领悟卸劲护元：25%几率遭受攻击时扣除内力值代",
"替伤害，伤害最高为10点",
"拳系130以上领悟凌空点穴：拳系攻击几率触发，使被攻击者必封穴",
"25时序",
"剑系130以上领悟卧龙傲天：剑系攻击几率触发，行动后恢复250集气",
"刀系130以上领悟吞天噬日：刀系攻击几率触发，吸血攻击",
"特系130以上领悟醉里挑灯：特系攻击几率触发，必追加杀气200点",
"暗系130以上领悟寸芒破罡：暗系攻击几率触发, 附加不良状态",
"并根据被攻击者内力消耗附加伤害",
"五系之和大于400领悟满天流星：任何攻击60%几率触发, 全体敌人",
"杀生命80，无法致死",
"七本书觉醒：领悟乾坤挪移，修炼乾坤大挪移和斗转星移后，触发乾",
"            坤必出斗转，触发斗转必带乾坤",
"            斗转时根据对手武功引出反击真髓特效",
"真拳.荡江湖：拳系反击必三连,伤害递增",
"傲剑.镇山河：剑系全屏反击,附加气攻与剑系系数相关",
"狂刀.破苍穹：刀系反击必破防，附加气攻",
"天机.动乾坤：特系反击必使敌人流血封穴",
"千手.变星辰：暗系反击上毒并附加伤害，上毒值与暗系系数相关",
"             ，附加伤害与反击前敌人中毒情况及暗系系数相关",
"罡气.乱天下：内功反击必暴击,附加气攻与最大内力值挂钩",
"十本书觉醒：领悟左右开弓，左右互搏几率50%",
"—— 完 ——",
}

CC.NLJS["白愁飞"] = {
"称号：白首鸿鹄",
"攻击几率三连击，生命越低几率越高",
"侠客行邪线结束时第二格洗太玄神功",
"无法使用神照功和薛慕华的复活效果",
"无需组合条件自带返璞归真特效，被攻击时降低伤害并回复内力",
"自带四种二十四节气指，初始为1个，数量随觉醒情况增加",
"四本书觉醒：每场战斗必定有两次复活机会，第一次满状态，第二",
"            次半状态，自带太玄领悟效果",
"七本书觉醒：战斗中任何人行动后低几率出现，自身与目前集气值",
"            最高的敌人交换集气位置",
"十本书觉醒：领悟指令三指弹天指令，有三种招式：",
"            破煞：攻击必破防，杀气两倍",
"            惊梦：追加全体杀集气和生命",
"            天敌：三连击大范围攻击",
"            以上效果随拳掌能力增强而提高",
"—— 完 ——",
}

CC.NLJS["李逍遥"] = {
"称号：仗剑逍遥",
"攻击时几率出现御剑术，无视距离最大伤害，附加气攻",
"伤害追加与所学剑法数量和御剑系数相关，每学一个剑法几率上升5%",
"被攻击时几率出现真元护体，该次攻击免疫封穴和内伤，每学一个",
"内功几率上升5%；敌人暴怒攻击时必出，与元灵归心术不同时出现",
"初始低几率仙风云体术闪避攻击",
"可以练辟邪，不用自宫；无法练葵花，无法自宫",
"自带指令＜奇术＞",
"四本书觉醒：御剑术变为万剑诀，追加群体杀气100点，",
"            领悟元灵归心术，战意120后受伤后10时序疗伤效果",
"七本书觉醒：万剑诀变为天剑，追加群体内伤1-10点",
"十本书觉醒：领悟战意技.剑神御风，全体攻击，追加内力伤害，",
"            学满10个武功后可以领悟酒神指令",
"奇术指令：",
"妙手：出生自带，可以偷到敌方物品，数量随机，无消耗",
"冰心：2本书自动领悟，降低敌人怒气与战意20点",
"      消耗自身怒气10点",
"醉仙：4本书自动领悟，接下来三次攻击内必连击，消耗体力20点",
"云体：7本书自动领悟，在30时序内大幅度提高仙风云体术的几率，",
"      消耗体力15点",
"酒神：攻击无视防御及特效以自身最大内力一定比例伤害敌人",
"—— 完 ——",
}

CC.NLJS["赵云"] = {
"称号：义贯金石", --武骧金星：四叶版人物只有一个称号
--"自带指令＜白马＞ 战斗中使用可以乘骑变身加强所有能力",
--"四本书觉醒：领悟白马义从精要，每场战斗可以变身3次",
"自带擒龙功及其领悟效果",
"敌我数量差距越大攻防效果越好",
"当对手与自己会相同武功时攻防效果大幅度提升",
"四本书觉醒：战意的加成效果加倍，集气大幅提高",
"七本书觉醒：领悟七探蛇盘枪，攻击几率追加3次攻击，必流",
"            血，怒气越高几率越大",
"            可以去河洛客栈小二处买专属武器龙胆亮银枪；装备",
"            后攻击时必附加气攻值且暴击率上升",
"            掌握了蛇盘防御和七探攻击的枪法奥义",
"十本书觉醒：领悟神威如龙，生命值一半以下进入无双状",
"            态，内伤中毒全清，免封穴流血迟缓，",
"            必连必暴，怒气不减",
"—— 完 ——",
}

CC.NLJS["萧笑竹"] = { --武骧金星：增加萧笑竹
"称号：万象森罗", 
"我方人物可以进行更大规模的合击",
"可以将自身对武功的领悟心得传授给经历足够挑战的队友",
"自带指令＜森罗＞，有三种变化：",
"星辰：可根据自身属性选择一种称号",
"虚空：可重新选择天赋武功",
"轮回：可模仿队友的天赋能力",
"四本书觉醒：领悟森罗万象的精微变化",
"七本书觉醒：领悟风林火山功，挑战张三丰后领悟六如苍龙决",
"十本书觉醒：领悟神并天地，所有武功杀伤范围均大幅度增加且无误伤",
"—— 完 ——",
}

CC.NLJS["藏镜人"] = { --武骧金星：增加藏镜人
"称号：战神", 
"实战突破上限",
"生命/内力/体力越低，击退敌人获得实战越多",
"怒气提升速度加倍",
"内伤不会降低集气速度",
"四本书觉醒：领悟飞瀑怒潮，击退敌人造成全体敌方与实战相关的杀气",
"            若为阴内，可洗第二格为逆运筋脉，主运后有部分领悟效果",
"七本书觉醒：领悟怒潮袭天，增加与实战相关的气攻",
"            主运逆运筋脉则可拥有全部领悟效果"	,
"十本书觉醒：领悟袭地贯天，暴击时伤害倍率大幅度增加",
"            领悟天地不容战法，依实战大幅增加攻防",
"—— 完 ——",
}


CC.NLJS["杨妙真"] = { --武骧金星：增加杨妙真
"称号：神枪", 
"免疫会心之一击",
"连击数随实战额外提升",
"几率回避致命伤害，效果随实战提升",
"攻击时几率造成致命伤害，对手怒气越高效果越大",
"四本书觉醒：无视距离造成最大伤害",
"七本书觉醒：第一格武功洗成梨花枪，以之攻击时有多种效果",
"十本书觉醒：遗忘除梨花枪外的其他武功，外功领悟变为梨花枪，拥有原外功领悟的效果",
"—— 完 ——",
}

CC.NLJS["滕青山"] ={
"称号：蛮荒兽王",
"掌握兽神诀，加伤和减伤效果随回合数上升而增加",
"习得拟兽式，攻击随机附带特效",
"生命值越低伤害越高",
"气防与刀拳二系系数相关",
"自带指令<兽王>",
"可用的指令数和效果随实战提高而增加",
"四本书觉醒：领悟神兽斗气，被攻击时附加特效",
"七本书觉醒：领悟血狼之心，被暴击时立即回复生命",
"            被连击时则降低伤害，触发血狼之心则增加防御次数",
"            领悟凶兽斗气，攻击时给对方附加不良特效",
"十本书觉醒：领悟天狐步，被攻击五次则可开启",
"            每次行动后可两次预先躲避攻击",
"            领悟战意技兽血沸腾，战意爆发后持续怒气",
"            且集气速度根据攻防次数递增",
"—— 完 ——",
}

CC.NLJS["谢云流"] = {
"称号：东瀛剑魔",
"初始能力大幅提高",
"四本书觉醒：领悟封步剑，打断连击，敌方初始集气-２００",
"            可使用一刀流招式",
"七本书觉醒：领悟错步剑，走位闪避后反击敌方目标",
"            主功体太虚剑意可使用太虚剑招式",             
"            太虚剑状态可使用指令太虚",
"十本书觉醒：领悟斩流剑·天道剑封破————",
"            攻击几率附加穿透伤害１００，无法免疫",
"            领悟剑气无形，自身８格范围内敌方时序掉血８点",
"            目标生命越低，造成的伤害越高",
"—— 完 ——",
}

CC.NLJS["聂风"] = {
"称号：风中之神",
"初始自带捕风捉影、步风足影、冰心诀、风神怒、创刀、魔刀指令",
"四本书觉醒：领悟傲寒六诀，风神怒精髓",
"七本书觉醒：领悟十方无敌，十方皆杀",
"十本书觉醒：领悟魔心渡",
"—— 完 ——",
}

CC.NLJS["步惊云"] = {
"称号：不哭死神",
"初始自带排云掌前十一式，霍家剑气，云踪魅影",
"四本书觉醒：领悟排云掌第十二式，剑二十二，七气归一，龙元火",
"            劲",
"七本书觉醒：领悟三霸掌，三霸剑，无极霸剑，莫名悲痛，天道无",
"            极",
"十本书觉醒：领悟无求易诀",
"—— 完 ——",
}

CC.NLJS["赵灵儿"] = {
"称号：仙岛青莲",
"内力硬上限+3000点",
"攻击时几率附带特效回魂仙梦：敌方50时序内集气缓慢且絮乱",
"退场时己方全体恢复生命500",
"和李逍遥情侣加成防御50点",
"指令：＜梦蛇＞",
"除自己外己方全体怒气为100且集气+200",
"每场战斗限两次；消耗内力700怒气值100",
}

CC.NLJS["林月如"] = {
"称号：泪叹红颜",
"怒气值上升速度+50%",
"怒气100时攻击伤害1.5倍",
"退场时敌方全体损失生命300内伤+10",
"和李逍遥情侣加成攻击50点",
"指令：＜七诀＞",
"此次攻击变为全屏攻击，每场战斗限三次；消耗体力10内力500",
}


CC.NLJS["阿奴"] = {
"称号：幽谷空笛",
"医疗和用毒上限为400",
"免疫暴击的额外伤害",
"退场时敌全体中毒+50",
"和李逍遥情侣加成轻功50点",
"指令：＜夺魂＞",
"中术者50时序内持续减血，自身50时序内持续加血，消耗体力15点",
}

CC.NLJS["92"] = {
"称号：悠悠我心",
"修炼武功无视资质和阴阳",
"与主角同时出场增加彼此集气速度和伤害",
"可用指令＜宿缘＞",
}

CC.NLJS["陆无双"] = {
"称号：冷月星弧",
"修炼武功无视资质和阴阳",
"与主角同时出场增加彼此集气速度和伤害",
"可用指令＜宿缘＞",
}

CC.NLJS["森九岚"] = {
"称号：星空月海",
}

CC.NLJS["郭襄"] = {
"称号：烛影浮灯",
"修炼武功无视资质和阴阳",
"与主角同时出场增加彼此集气速度和伤害",
"可用指令＜宿缘＞",
}

CC.NLJS["苗若兰"] = {
"称号：兰心蕙质",
"修炼武功无视资质和阴阳",
"与主角同时出场增加彼此集气速度和伤害",
"可用指令＜宿缘＞",
}

--[[
CC.NLJS["唐萌浅"] = {
"称号：泼墨留白",
"修炼武功无视资质和阴阳",
"与主角同时出场增加彼此集气速度和伤害",
"可用指令＜宿缘＞",
}
]]

CC.NLJS["唐萌浅"] = {
"称号：泼墨留白",
"可用任何武功带出唐门门派特效",
}

CC.NLJS["1"] = {
"称号：灵犀真拳",
"无视内力阴阳属性修练降龙十八掌和黯然销魂掌",
"使用降龙十八掌４０％几率发动降龙极意，大范围，高杀气",
"使用黯然销魂掌几率三连击，内伤越高或生命越少，几率越大",
"使用玄冥+火焰刀组合时，高几率用玄冥带出特效",
"使用须弥山掌+伏魔杖组合时，高几率用须弥山掌带出特效",
"每修习一种拳法并练至【极】攻击最终伤害提升５％",
"每修习一种拳法并练至【极】降低被破防后被杀集气值的５％",
"每１０点拳掌系数减少１％拳法内力消耗，最多减少５０％",
"每修习一种拳法并练至【极】攻击时如果出现封穴则封穴值追加一",
"点，提高封穴值上限",
"绝技：天道惊雷憾，使用拳法攻击时几率发动，最终攻击效果提升",
"      ３０％，封穴成功几率提升",
"初始自带绝影闪",
"一/三/五/六书时分别取得风林火山四种特效",
"二/四分别获得临兵冲与虚空藏",
"七本书觉醒：领悟六如整体，挑战三丰后获得隼旋击",
"—— 完 ——",
}

CC.NLJS["2"] = {
"称号：剑神一笑",
"可无视资质习得独孤九剑",
"可无视自宫需求修炼辟邪剑法",
"如同时习得独孤九剑和玄铁剑法且御剑大于１２０，则被攻击时有",
"５０％几率出破ｘ式减低伤",
"如先学辟邪剑法然后学葵花则不用自宫，不自宫的状态下刺目出现",
"几率为３０％",
"使用胡刀+苗剑的组合时，高几率用苗剑带出特效",
"每修习一种剑法并练至【极】自身集气速度提升５％",
"每修习一种剑法并练至【极】剑法类攻击追加１０点固定伤害 ",
"每修习一种剑法并练至【极】攻击时造成的流血值和灼烧值追加２点，",
"绝技：一剑镇神洲，使用剑法攻击时几率发动，全屏攻击",
"初始自带绝影闪",
"一/三/五/六书时分别取得风林火山四种特效",
"二/四分别获得临兵冲与虚空藏",
"七本书觉醒：领悟六如整体，挑战三丰后获得隼旋击",
"—— 完 ——",
}

CC.NLJS["3"] = {
"称号：傲世狂刀",
"无名刀法练到极而且耍刀达到１２０后，任意刀法攻击几率触发狂刀",
"诀，提升伤害和杀气值；",
"耍刀能力越高，可触发狂刀诀段位越高",
"使用胡刀+苗剑的组合时，高几率用胡刀带出特效",
"使用玄冥+火焰刀组合时，高几率用火焰刀带出特效",
"每修习一种刀法并练至【极】 被攻击时所受伤害减少５％",
"每修习一种刀法并练至【极】 被攻击时受到的内伤程度减３％",
"每修习一种刀法并练至【极】行动结束后恢复集气１０",
"绝技：羽葬煌炎斩，使用刀法攻击几率发动，必定破防，被攻击者怒气",
"      值减半",
"初始自带绝影闪",
"一/三/五/六书时分别取得风林火山四种特效",
"二/四分别获得临兵冲与虚空藏",
"七本书觉醒：领悟六如整体，挑战三丰后获得隼旋击",
"—— 完 ——",
}

CC.NLJS["4"] = {
"称号：棍藏天机",
"初始自带【天机身法】被攻击时几率发动 回避攻击",
"打狗棒法高几率发动【天下无狗】式",
"无视内力阴阳属性修炼伏魔杖法",
"使用须弥山掌+伏魔杖组合时，高几率用伏魔杖带出特效",
"每修习一种特系武功并练至【极】天机身法发动几率提升５％",
"每修习一种特系武功并练至【极】自身怒气值增长值提升５％ ",
"每修习一种特系武功并练至【极】攻击时如果破气防则杀集气加５％",
"绝技：千机龙绝闪，使用特系攻击时几率发动，必定造成封穴及流血",
"初始自带绝影闪",
"一/三/五/六书时分别取得风林火山四种特效",
"二/四分别获得临兵冲与虚空藏",
"七本书觉醒：领悟六如整体，挑战三丰后获得隼旋击",
"—— 完 ——",
}

CC.NLJS["13"] = {
"称号：千魂弄巧",
"可无视自宫需求修炼葵花神针",
"使用暗系武功攻击不会造成误伤",
"每修习一种暗系武功并练至【极】攻击时气攻值加１００点",
"每修习一种暗系武功并练至【极】初始集气加１００点",
"每修习一种暗系武功并练至【极】攻击时造成的迟缓值追加２点",
"提高迟缓值上限",
"绝技：暗无天日·器绝十方，使用暗系攻击时几率发动，敌人随机",
"      获得一项异常状态",
"初始自带绝影闪",
"一/三/五/六书时分别取得风林火山四种特效",
"二/四分别获得临兵冲与虚空藏",
"七本书觉醒：领悟六如整体，挑战三丰后获得隼旋击",
"—— 完 ——",
}

CC.NLJS["5"] = {
"称号：绝世天罡",
"修炼武功和装备功体时无视内力阴阳属性需求",
"华山觉醒后可以装备主副两个功体",
"可使用全部内功进行攻击，时序增加内力并清除内伤",
"内功攻击时有几率触发天罡真气加力，提升气攻值",
"每修练一种内功至【极】 天罡真气触发几率提升３％",
"每修练一种内功至【极】 内功加力和护体二次独立判定几率提升１％",
"内力值大于3000则几率发动天罡斗气，根据战意和内力加强伤害和气攻值",
"觉醒后内力值大于5000则几率发动护体真罡，根据战意和内力减少伤害和气攻值",
"护体或加力积累阴阳汇聚速度是其他标准主角的两倍",
"绝技：斗焰刚霸体，使用内功攻击时几率发动，被攻击者气防大幅降低",
"      必然发动最高层天罡斗气",
"      产生一个防御气罩，下次受到攻击时可抵销伤害１５０点",
"初始自带绝影闪",
"一/三/五/六书时分别取得风林火山四种特效",
"二/四分别获得临兵冲与虚空藏",
"七本书觉醒：领悟六如整体，挑战三丰后获得隼旋击",
"—— 完 ——",
}

CC.NLJS["6"] = {
"称号：仁者无敌",
"初始道德值１００点",
"特效几率大幅度上升",
"某支线后如果在场上则所有队友特效几率上升１０点",
"初始自带绝影闪",
"一/三/五/六书时分别取得风林火山四种特效",
"二/四分别获得临兵冲与虚空藏",
"七本书觉醒：领悟六如整体，挑战三丰后获得隼旋击",
"—— 完 ——",
}

CC.NLJS["7"] = {
"称号：回天圣手",
"医疗和解毒上限值为５００点",
"战斗中医疗时范围为５＊５的方阵",
"自身每2时序恢复１点内伤及１点中毒",
"自身每1时序恢复１点生命及５点内力 ",
"某支线后医疗的时候如果方阵范围内有敌人则敌人反中毒",
"绝技：八门聚万象，行动后几率发动，集气值恢复为１０００",
"初始自带绝影闪",
"一/三/五/六书时分别取得风林火山四种特效",
"二/四分别获得临兵冲与虚空藏",
"七本书觉醒：领悟六如整体，挑战三丰后获得隼旋击",
"—— 完 ——",
}

CC.NLJS["8"] = {
"称号：欲天摩罗",
"用毒和解毒上限值为５００点",
"自身中毒越深能力越强",
"自身按时序增加中毒值且无法被解毒",
"行动后按照自身中毒值恢复生命内力和集气",
"攻击时按照实战值追加毒性",
"被攻击时消耗自身中毒值减少被杀气值；",
"自带指令＜五毒＞可用的指令数和效果随实战提高而增加",
"＜乾天＞目标周边三格敌人进入毒击状态",
"＜离火＞目标敌人灼烧且进入混乱状态",
"＜坎水＞目标敌人冰封且进入冰心状态",
"＜巽风＞目标周边五格所有人进入破兵和碎甲状态",
"＜坤地＞目标敌人中毒１００且一定时序内无法解毒",
"绝技：五毒秘箓·法用万物，被攻击时几率消耗中毒值使集气条前进",
"初始自带绝影闪",
"一/三/五/六书时分别取得风林火山四种特效",
"二/四分别获得临兵冲与虚空藏",
"七本书觉醒：进入战场时自身中毒值为１００点；行动后的恢复值加倍",
"            行动后自身五格内的敌人内力减５００点",
"            领悟六如整体，挑战三丰后获得隼旋击", --武骧金星：补全觉醒说明
"—— 完 ——",
}

CC.NLJS["10"] = {
"称号：凌空摘星",
"出场时按照实战增加初始集气位置",
"行动后几率增加下回合的集气速度",
"可无视任何限制修炼多个轻功", 
"移动时无视敌人包围；移动力加三格", 
"自带指令＜空空＞可用的指令数和效果随实战提高而增加",
"＜探囊＞获取目标敌人的随机物品",
"＜偷心＞使目标敌人进入魅惑状态，仅对小兵有效",
"＜窃艺＞习得目标敌人随机一项武功",
"绝技：天地随我心，攻击时几率盗取周围人物的攻击力增加伤害",
"      万物如我意，被攻击时几率盗取周围人物的防御力减少伤害",
"初始自带绝影闪",
"一/三/五/六书时分别取得风林火山四种特效",
"二/四分别获得临兵冲与虚空藏",
"七本书觉醒：领悟＜猎命＞ 盗取目标的一项天赋：",
"            自身获得该天赋且目标失去该天赋一定时序；",
"            使用任意指令有几率使目标封穴",
"            领悟六如整体，挑战三丰后获得隼旋击",
"—— 完 ——",
}

CC.NLJS["11"] = {
"称号：盘龙九注",
"大地图上奇遇等级和数量上升",
"基础特效发动率增加１０点",
"进入战场时可随机选择三项数值自身得到随机效果直到战斗结束",
"自带指令＜豪掷＞使用随机出现以下效果：",
"＜玉麒麟＞我方全体或敌方全体进入鼓舞状态",
"＜金孔雀＞我方全体或敌方全体进入神行状态",
"＜半齾钱＞我方全体或敌方全体进入钢体状态",
"＜空汤瓶＞无任何效果",
"出现敌方受益的几率为三分之一",
"绝技：一掷生死，当我方有人退场时可以掷骰子，奇数则满血复活，",
"      偶数则自身生命内力体力降至最低",
"初始自带绝影闪",
"一/三/五/六书时分别取得风林火山四种特效",
"二/四分别获得临兵冲与虚空藏",
"七本书觉醒：进入战场后的随机数值增加为五项",
"            使用指令时可以有第二次机会重新掷过",
"            使用指令出现额外特效：",
"            ＜天地人＞随机一名人物的生命内力降至最低",
"            ＜福禄寿＞随机一名人物的生命内力全满",
"            ＜龙凤白＞我方全体或敌方全体集气全满",
"            ＜至尊宝＞我方全体或敌方全体下次攻击可攻击全场",
"            领悟六如整体，挑战三丰后获得隼旋击",
"—— 完 ——",
}

--武骧金星：补全“琴”和“阵”的说明
CC.NLJS["12"] = {
"称号：指掌乾坤", --乾坤皆阵
"生命值低于300后受到攻击时自动展开防御状态",
"进入战斗可布置我方阵型，每个队友可在八格范围内移动一次", --，且本次移动无视ZOC",
"八部斗策：",
"＜天王＞召唤一名斗神助战（不能与本体同时在场）（七本天书后领悟）", --满状态复活任意一名败退队友（每场战斗限一次）
"＜龙王＞提升全体队友战意值十点（六本天书后领悟）", --指定
"＜夜叉＞提升指定队友怒气值60点及恢复体力15点（三本天书后领悟）",
"＜乾达婆＞恢复指定队友生命350 内伤35",
"＜阿修罗＞指定队友下次攻击增加一次连击且必暴击（一本天书后领悟）", --首击
"＜迦楼罗＞提升指定队友当前集气值750点（五本天书后领悟）",
"＜紧那罗＞降低指定敌方人物的怒气值60点（四本天书后领悟）",
"＜摩呼罗迦＞敌全体集气下降200点 封穴4至6时序（二本天书后领悟）",
"施展任意一种斗策消耗体力8点，自身集气速度提升2点，战意提升2点",
"集气速度提升上限为16点",
"初始自带绝影闪",
"一/三/五/六书时分别取得风林火山四种特效",
"二/四分别获得临兵冲与虚空藏",
"七本书觉醒：领悟六如整体，挑战三丰后获得隼旋击",
"—— 完 ——",
}

CC.NLJS["9"] = {
"称号：血海飘零",
"自身流血值越高则伤害越高，被攻击时几率以自身流血值抵消一半伤害",
"被封穴/迟缓时改为增加流血值",
"攻击时吸取生命值并高几率造成流血，自身流血值越高吸取越多",
"流血值越高则集气速度越快，流血减少生命值较少",
"绝技：血洗天河，攻击后几率回复与流血值相关的集气",
"初始自带绝影闪",
"一/三/五/六书时分别取得风林火山四种特效",
"二/四分别获得临兵冲与虚空藏",
"七本书觉醒：领悟六如整体，挑战三丰后获得隼旋击",
"—— 完 ——",
}

CC.NLJS2["郭襄"] = {"攻击时附加一定气攻值；内力硬上限上升一千点"}
CC.NLJS2["唐萌浅"] = {"强化天罗诡道和惊羽诀"}
CC.NLJS2["游坦之"] = {"攻击时冰封效果上升；功体加力时附加的气攻值提升"}
CC.NLJS2["耶律齐"] = {"无视资质限制习得左右互搏；领悟杀意波动"}
CC.NLJS2["温青青"] = {"无法破防时几率使出金蛇锥造成必定破防"}
CC.NLJS2["夏青青"] = {"无法破防时几率使出金蛇锥造成必定破防"}
CC.NLJS2["林平之"] = {"连击几率大幅度上升"}
CC.NLJS2["令狐冲"] = {"连击几率大幅度上升；使用独孤九剑无误伤；被攻击时几率出破Ｘ式减少伤害"}
CC.NLJS2["狄云"] = {"时序回复内伤和清毒"}
CC.NLJS2["虚竹"] = {"使用生死符一定几率在敌人身上种下生死符", "可用指令＜催符＞"}
CC.NLJS2["韦小宝"] = {"对女人很有一套"}

CC.NLJS["胡斐"] = {
"称号：雪山飞狐", 
"胡家刀招式发动率大幅提升，增加胡刀秘传技", 
"可用指令＜飞狐＞",
"胡家刀法到极，达到250刀系数觉醒战意系统【一刀】",
}
CC.NLJS["程灵素"] = {
"称号：灵枢素问", 
"攻击时敌全体中毒二十点", 
"可用指令＜引毒＞",
"洗化功剧情后觉醒战意系统【七星神木】"}
CC.NLJS["苗人凤"] = {
"称号：金面佛", 
"行动后恢复体力与生命",
"刀剑争霸剧情入队后觉醒战意系统【苗家天剑】"}
CC.NLJS["阎基"] = {"称号：宝树阎罗", "在战场上时所有己方攻击追加中毒一到五点"}
CC.NLJS["张三丰"] = {
"称号：太极宗师", 
"太极奥义几率上升；攻击后几率恢复集气；攻击时几率增加伤害",
"可以太极之形逆转对手攻势，掌握纯阳领悟",
}
CC.NLJS["灭绝"] = {"称号：天青孤月", "己方在场人数越少攻击效果越高"}
CC.NLJS["何太冲"] = {"称号：铁琴先生", "攻击时对敌人增长怒气减半", "班淑娴在场时伤害效果增加５０％", "班淑娴不在场时对女性敌人攻击效果降低５０％"}
CC.NLJS["唐文亮"] = {"称号：崆峒五老", "进入战场自带内伤２０点，开场１００时序内必定暴击"}
CC.NLJS["张无忌"] = {"称号：九阳明尊", "发动乾坤大挪移时反弹伤害百分之五十且几率反弹敌方两人；几率发动九阳反震伤害百分之二十；九阳神功必加力", "可用指令＜挪移＞"}
CC.NLJS["范遥"] = {"称号：光明右使", "修炼武功的兵器值需求降低２０点，不可与同类效果叠加"}
CC.NLJS["杨逍"] = {"称号：光明左使", "乾坤大挪移发动几率上升", "可用指令＜乾坤＞"}
CC.NLJS["殷天正"] = {"称号：白眉鹰王", "攻击必暴击，体力消耗加3点"}
CC.NLJS["谢逊"] = {
"称号：金毛狮王", 
"狮吼功特效几率１００％；盲目状态下可以造成伤害",
"自带狮王吼"}
CC.NLJS["韦一笑"] = {"称号：青翼蝠王", "每修炼一拳法到极集气速度加２点"}
CC.NLJS["金花婆婆"] = {"称号：紫衫龙王", "进入战场时我方初始战意加１０点"}
CC.NLJS["胡青牛"] = {"称号：医仙", "药品效果上升；可向队友用药", "可用指令＜群疗＞"}
CC.NLJS["王难姑"] = {"称号：毒仙", "用毒时降低对方集气", "可用指令＜施毒＞"}
CC.NLJS["成昆"] = {"称号：混元霹雳手", "攻击破防后造成的杀集气效果加５０％"}
CC.NLJS["岳不群"] = {"称号：君子剑", "修炼葵花神功无集气惩罚；习得五岳剑法后用太岳三青峰必出特效"}
CC.NLJS["莫大"] = {"称号：潇湘夜雨", "用剑系武功攻击时追加特系兵器值５０％的伤害；习得五岳剑法后用云雾十三式必出特效"}
CC.NLJS["定闲"] = {"称号：恒山掌门", "习得五岳剑法后用万花剑法必出特效"}
CC.NLJS["左冷禅"] = {"称号：嵩山掌门", "习得五岳剑法后用万岳朝宗必出特效；攻击造成双倍冰封值"}
CC.NLJS["天门"] = {"称号：泰山掌门", "习得五岳剑法后用泰山十八盘必出特效"}
CC.NLJS["余沧海"] = {"称号：青城掌门", "攻击时追加内伤值１０点"}
CC.NLJS["蓝凤凰"] = {"称号：凤凰于飞", "几率免杀集气，内伤越高几率越大", "可用指令＜金蟾＞"}
CC.NLJS["任我行"] = {"称号：骁肆纵横", "攻击时必触发吸星大法；怒气越高气攻值越大"}
CC.NLJS["东方不败"] = {"称号：唯我不败", "几率三连击；葵花移行几率上升；攻击无误伤"}
CC.NLJS["平一指"] = {"称号：杀人名医", "战斗中集气速度和医疗效果随杀敌数上升", "可用指令＜疗伤＞"}
CC.NLJS["田伯光"] = {"称号：万里独行", "战场上已方人员越少集气速度越高"}
CC.NLJS["丹青生"] = {"称号：江南四友", "琴棋书画几率上升；出琴棋书画时江山如画的效果提升"}
CC.NLJS["秃笔翁"] = {"称号：江南四友", "琴棋书画几率上升；出琴棋书画时秉笔直书的效果提升"}
CC.NLJS["黑白子"] = {"称号：江南四友", "琴棋书画几率上升；出琴棋书画时星罗棋布的效果提升"}
CC.NLJS["黄钟公"] = {"称号：江南四友", "琴棋书画几率上升；出琴棋书画时菩提清心的效果提升；使用持瑶琴必出笑傲江湖"}
CC.NLJS["令狐冲"] = {"称号：九剑传人", "使用独孤九剑攻击无误伤"}
CC.NLJS["林平之"] = {"称号：辟邪剑客", "不受自宫的惩罚影响；葵花移行几率上升", "葵花神功可攻击"}
CC.NLJS["狄云"] = {"称号：赤心连城", "攻击效果受主角品德影响，越高加成越多", "可用指令＜神照＞"}
CC.NLJS["石破天"] = {"称号：浑沦太玄", "行动后战意增加两点，太玄必出特效", "可用指令＜飒行＞"}
CC.NLJS["龙岛主"] = {"称号：侠客岛主", "蓄力状态下攻击大幅度提升"}
CC.NLJS["木岛主"] = {"称号：侠客岛主", "防御状态下防御大幅度提升"}
CC.NLJS["张三"] = {"称号：赏善使者", "自身免疫灼烧效果"}
CC.NLJS["李四"] = {"称号：罚恶使者", "自身免疫冰封效果"}
CC.NLJS["白万剑"] = {"称号：气寒西北", "攻击时造成的迟缓值加５０％"}
CC.NLJS["岳老三"] = {"称号：凶神恶煞", "主角品德越低防御加成越高", "可用指令＜鼍龙＞"}
CC.NLJS["薛慕华"] = {"称号：阎王敌", "战场上可复活同伴一次"}
CC.NLJS["丁春秋"] = {"称号：星宿老仙", "攻击必触发化功大法"}
CC.NLJS["阿紫"] = {
"称号：绛紫为邪", 
"高几率触发化功大法；杀死敌人时使全体敌人中毒且集气减少；与游坦之同在战场时，游坦之攻击必暴击", 
"可用指令＜引毒＞",
"初始即觉醒为【紧那罗】"}
CC.NLJS["游坦之"] = {
"称号：冰毒怪客",
 "所有攻击带毒兩百四十点；内功加力和护体几率上升",
 "冰蚕剧情后觉醒为【摩呼洛迦】"}
CC.NLJS["虚竹"] = {"称号：慧者如痴", "攻击后百分之四十几率回复集气三百点","觉醒为【夜叉】"}
CC.NLJS["乔峰"] = {"称号：盖世神勇", "降龙几率三连击且必极意；怒气持续爆发；帝释天威与天将底力；觉醒为【帝释天】"}
CC.NLJS["萧峰"] = {"称号：盖世神勇", "降龙几率三连击且必极意；怒气持续爆发；帝释天威与天将底力；觉醒为【帝释天】"}
CC.NLJS["慕容复"] = {"称号：皇图梦复", "斗转星移耗内力值减少；觉醒为【阿修罗】", "可用指令＜幻梦＞"}
CC.NLJS["花铁干"] = {"称号：中平神枪", "中平枪法攻击额外追加杀集气能力"}
CC.NLJS["段誉"] = {
"称号：磊落仁心", 
"六脉神剑大招发动率百分之六十；几率闪避攻击", 
"可用指令＜凌波＞",
"可觉醒为【龙王】"}
CC.NLJS["袁承志"] = {"称号：志垂日月", "行动后自动清除内伤", "可用指令＜虎乱＞"}
CC.NLJS["郭靖"] = {
"称号：北侠", 
"降龙十八掌极意发动率百分之四十；场上己方退场数越多集气速度越快", 
"可用指令＜灵雕＞",
"乌衣派，觉醒后主运九阴使用降龙可出现【侠气真罡】"}
CC.NLJS["黄蓉"] = {
"称号：女诸葛", 
"净衣派，战前可进行布阵；敌方在场人数越多集气速度越慢", 
"可用指令＜奇阵＞",
}
CC.NLJS["黄药师"] = {
"称号：东邪", 
"攻击后可再移动；对手移动力降低三格",
"碧海潮生领悟，且可以发动【碧海狂潮】"}
CC.NLJS["杨过"] = {
"称号：西狂", 
"攻击时敌全员集气减一百；生命越低暴击率和暴击伤害越高",
"净衣派，玄铁九剑先后到极可觉醒战意技【玄铁九剑奥义】",
 "可用指令＜机变＞"}
CC.NLJS["小龙女"] = {"称号：冷剑冰霜", "以玉女剑法攻击必定连击", "可用指令＜御蜂＞"}
CC.NLJS["欧阳克"] = {"称号：白凤灵蛇", "攻击时高几率封穴；蛤蟆功蓄力效果提升", "可用指令＜蛇笛＞"}
CC.NLJS["金轮法王"] = {
"称号：元蒙帝师", 
"可用龙象般若功攻击；攻击时额外增加大量杀气",
"掌握龙象领悟"}
CC.NLJS["程英"] = {"称号：青箫落瑛", "生命越低攻击效果越高", "可用指令＜青箫＞"}
CC.NLJS["周伯通"] = {
"称号：老顽童", 
"左右互搏必发动，可以三次互博",
"掌握空明武道的奥义"}
CC.NLJS["一灯"] = {
"称号：南僧", 
"退场后必复活一次",
 "重生后发动六脉转龙绝招"}
CC.NLJS["小昭"] = {"称号：日月昭昭", "敌全体初始战意减五点，己方全体初始战意加五点；敌全体移动减五格"}
CC.NLJS["裘千仞"] = {"称号：铁掌水上飘", "生命值越低行动后恢复的集气越多"}
CC.NLJS["丘处机"] = {"称号：全真七子", "连击暴击加力护体的几率增加７％"}
CC.NLJS["洪七公"] = {
"称号：北丐", 
"降龙十八掌和打狗棒法极意发动率上升",
"掌握擒龙功领悟，统领丐帮乌衣派和净衣派"}
CC.NLJS["玄慈"] = {"称号：伏虎罗汉", "自身怒气不增长，攻击时不造成敌方怒气增长；攻击时敌人战意减少，自身战意增加；战意上限１７０点"}
CC.NLJS["田归农"] = {
"称号：风流蕴藉", 
"攻击时对手怒气值上升减半", 
"可用指令＜谗言＞",
"杀死苗人凤后掌握战意技【刀剑十杀】"}
CC.NLJS["任盈盈"] = {"称号：琴铮盈盈", "攻击时几率杀敌全体生命一百点；高几率触发吸星大法；行动后自身周围三格内己方人员体力恢复３点", "装备焦尾琴后可用指令＜幽韵＞"}
CC.NLJS["霍青桐"] = {"称号：翠羽黄衫", "使用三分剑术攻击杀敌体力十五点", "可用指令＜统率＞"}
CC.NLJS["陈家洛"] = {"称号：天池红花", "升级时四系兵器值高成长"}
CC.NLJS["王语嫣"] = {"称号：琅嬛仙子", "提升队伍特效发动几率；初始集气随修炼武功数量提升", "可用指令＜点破＞"}
CC.NLJS["萧中慧"] = {"称号：慧心鸳鸾", "袁冠南在场时必暴击", "可用指令＜慧心＞"}
CC.NLJS["萧中慧1"] = {"称号：慧心鸳鸾", "主角在场时必连击必暴击", "可用指令＜慧心＞"}
CC.NLJS["梅超风"] = {"称号：流萤若华", "修炼九阴真经后集气速度加五；九阴白骨爪伤害加倍；盲目状态下可以造成伤害"}
CC.NLJS["岳灵珊"] = {"称号：慧中灵剑", "每修习一种剑法到极后：攻击效果提升百分之五，初始集气增加且行动后恢复集气值"}
CC.NLJS["张召重"] = {"称号：火手判官", "攻击时使对手受伤程度翻倍", "可用指令＜激励＞"}
CC.NLJS["朱九真"] = {"称号：灵獒毒娇", "被攻击时几率魅惑普通小兵一百时序；使用一阳指高几率封穴"}
CC.NLJS["宋青书"] = {"称号：玉面孟尝", "修炼太极拳和太极剑的需求减半；攻击效果和集气速度随战场上己方女性角色数量增加而提高"}
CC.NLJS["何铁手"] = {"称号：铁袖拂风", "攻击时几率把伤害转化为生命", "可用指令＜龙眠＞"}
CC.NLJS["霍都"] = {"称号：吾乃蛮夷", "攻击时几率附加扇中钉增加伤害和中毒值"}
CC.NLJS["贝海石"] = {"称号：着手回春", "每次受到攻击自动回血五十点"}
CC.NLJS["阿珂"] = {"称号：鸣珂锵玉", "所有敌方男性初始集气降低２００"}
CC.NLJS["苏荃"] = {"称号：倾国妖娆", "触发连击时必定三连"}
CC.NLJS["祖千秋"] = {"称号：酒神", "被攻击时几率发动酒神秘踪步闪躲攻击", "可用指令＜传功＞"}
CC.NLJS["人厨子"] = {"称号：食神", "攻击不减体力；在场时以体力分担队友伤害", "可用指令＜气补＞"}
CC.NLJS["钟灵"] = {"称号：毓秀灵姝", "初始集气增加百分之五十", "可用指令＜灵貂＞"}
CC.NLJS["温青青"] = {"称号：青青子衿", "使用雷震剑法攻击随机一至三倍伤害", "可用指令＜大暴＞"}
CC.NLJS["夏青青"] = {"称号：青青子衿", "使用雷震剑法攻击随机一至三倍伤害", "可用指令＜大暴＞"}
CC.NLJS["陆天枢"] = {"称号：仁义陆大刀"}
CC.NLJS["刘乘风"] = {"称号：柔云剑"}
CC.NLJS["水岱"] = {"称号：水月剑"}
CC.NLJS["血刀老祖"] = {"称号：茹毛饮血", "初始集气９００；使用血刀大法吸取造成伤害值的１０％"}
CC.NLJS["段延庆"] = {"称号：恶贯满盈", "主角品德越低封穴几率越高"}
CC.NLJS["叶二娘"] = {"称号：无恶不做", "主角品德越低攻击加成越高"}
CC.NLJS["云中鹤"] = {"称号：穷凶极恶", "主角品德越低集气速度越高"}
--CC.NLJS["朱丹臣"] = {"称号："}
CC.NLJS["枯荣"] = {"称号：双树枯荣", "几率以双倍内力代替伤害"}
CC.NLJS["鸠摩智"] = {
"称号：大轮明王",
"使用火焰刀攻击时几率使全体敌人附加受伤二十点",
"初始觉醒为【迦楼罗】",
}
CC.NLJS["阿朱"] = {
"称号：朱颜不辞", 
"出场时进入隐蔽状态50时序",
"初始觉醒为【乾达婆】",
}
CC.NLJS["阿碧"] = {"称号：碧水青梅"}
CC.NLJS["王元霸"] = {"称号：金刀无敌"}
CC.NLJS["矮老者"] = {"称号：华山二老"}
CC.NLJS["高老者"] = {"称号：华山二老"}
CC.NLJS["鲜于通"] = {"称号：神机子"}
CC.NLJS["游骥"] = {"称号：游氏双雄"}
CC.NLJS["游驹"] = {"称号：游氏双雄"}
CC.NLJS["萧远山"] = {"称号：孤狼啸月", "初始战意１２０点，战意上限１７０点；怒气爆发时免疫杀气"}
CC.NLJS["慕容博"] = {"称号：离合无常", "斗转反击不消耗体力；反击时可以连击且增加杀气值；几率全屏反击"}
CC.NLJS["扫地老僧"] = {"称号：达摩再世", "可用易筋经攻击；被攻击时不会被破气防",
"被攻击触发无形气墙减伤，减伤效果随被攻击次数减弱，下次行动时减伤效果恢复至初始效果",
"攻击时几率破气防，减低目标怒气和战意",
}
CC.NLJS["苏星河"] = {"称号：聪辩先生"}
CC.NLJS["无崖子"] = {"称号：包罗万象", "任意攻击必发动生死符增加气攻值和北冥特效"}
CC.NLJS["天山童姥"] = {"称号：不老长春", "任意攻击必发动生死符增加气攻值；被攻击时生命加５０点",
"时序１００触发返老还童，攻防效果降低５０％，时序恢复至９０时序时完全恢复且攻防效果增加３０％",
}
CC.NLJS["李秋水"] = {"称号：秋水无尘", "北冥神功特效必发动；以小无相功攻击时威力增加",
"攻击几率触发传音搜魂，时序集气紊乱并增加内伤，内力越高集气紊乱幅度越大，内力越高时序内伤越小",
"目标处于传音搜魂状态攻击时几率触发头晕目眩，攻击无效",
"被攻击几率触发凌波微步闪避",
}
CC.NLJS["渔"] = {"称号：渔樵耕读"}
CC.NLJS["樵"] = {"称号：渔樵耕读"}
CC.NLJS["耕"] = {"称号：渔樵耕读"}
CC.NLJS["读"] = {"称号：渔樵耕读"}
CC.NLJS["马钰"] = {"称号：全真七子", "连击暴击加力护体的几率增加７％"}
CC.NLJS["谭处端"] = {"称号：全真七子", "连击暴击加力护体的几率增加７％"}
CC.NLJS["刘处玄"] = {"称号：全真七子", "连击暴击加力护体的几率增加７％"}
CC.NLJS["王处一"] = {"称号：全真七子", "连击暴击加力护体的几率增加７％"}
CC.NLJS["郝大通"] = {"称号：全真七子", "连击暴击加力护体的几率增加７％"}
CC.NLJS["孙不二"] = {"称号：全真七子", "连击暴击加力护体的几率增加７％"}
CC.NLJS["王重阳"] = {"称号：中神通", "行动后调息；退场后必复活一次", "重生后发动重阳真打绝招"}
CC.NLJS["柯镇恶"] = {"称号：飞天蝙蝠", "盲目状态下可以造成伤害"}
CC.NLJS["朱聪"] = {"称号：妙手书生", "攻击时敌人不增加怒气"}
CC.NLJS["韩宝驹"] = {"称号：马王神", "装备白马移动加五点"}
CC.NLJS["南希仁"] = {"称号：南山樵子"}
CC.NLJS["张阿生"] = {"称号：笑弥陀"}
CC.NLJS["全金发"] = {"称号：闹市侠隐", "场上人数越多自身集气速度越快"}
CC.NLJS["韩小莹"] = {"称号：越女剑"}
CC.NLJS["陈达海"] = {"称号：青蟒剑"}
CC.NLJS["瓦耳拉齐"] = {"称号：一指震江南"}
CC.NLJS["郑克爽"] = {"称号：延平世子"}
CC.NLJS["风清扬"] = {"称号：剑魔再临",  "受攻击时必发动九剑秘传减伤害；攻击时敌人四系值越高则伤害越高"}
CC.NLJS["成不忧"] = {"称号：华山剑宗"}
CC.NLJS["封不平"] = {"称号：华山剑宗"}
CC.NLJS["桃根仙"] = {"称号：桃谷六仙"}
CC.NLJS["桃干仙"] = {"称号：桃谷六仙"}
CC.NLJS["桃枝仙"] = {"称号：桃谷六仙"}
CC.NLJS["桃叶仙"] = {"称号：桃谷六仙"}
CC.NLJS["桃花仙"] = {"称号：桃谷六仙"}
CC.NLJS["桃实仙"] = {"称号：桃谷六仙"}
--CC.NLJS["方证"] = {"称号："}
CC.NLJS["冯锡范"] = {"称号：一剑无血"}
CC.NLJS["文泰来"] = {"称号：奔雷手"}
CC.NLJS["无尘"] = {"称号：追魂夺命剑",  "无视闪避必然命中；自带鬼影迷踪腿可根据轻功差闪避攻击"}
CC.NLJS["赵半山"] = {"称号：千臂如来",  "连击次数额外提升；自带太极奥义；队友获得低几率的太极奥义效果；暗器攻击必然闪避"}
CC.NLJS["骆冰"] = {"称号：鸳鸯刀"}
CC.NLJS["常赫志"] = {"称号：黑无常"}
CC.NLJS["常伯志"] = {"称号：白无常"}
CC.NLJS["潇湘子"] = {"称号："}
CC.NLJS["尹克西"] = {"称号："}
CC.NLJS["尼摩星"] = {"称号："}
CC.NLJS["达尔巴"] = {"称号："}
CC.NLJS["李莫愁"] = {"称号：赤炼仙子", "攻击时几率发动暗器追加５０点伤害；生命值越低怒气积累速度越快"}
CC.NLJS["丁不三"] = {"称号：一日不过三"}
CC.NLJS["丁不四"] = {"称号：一日不过四"}
CC.NLJS["谢烟客"] = {"称号：摩天居士", "攻击与被攻击几率使目标集气速度降低一半持续５０时序，无法连续触发",
"攻击时几率触发真气护体减伤，当前内力越高减伤越多，护体真气被破前无法继续触发",
"觉醒可使用战意技【碧针清掌】",}
CC.NLJS["朱长龄"] = {"称号："}
CC.NLJS["班淑娴"] = {"称号："}
CC.NLJS["宗维侠"] = {"称号：崆峒五老", "进入战场自带内伤２０点，开场１００时序内必定暴击"}
CC.NLJS["常敬之"] = {"称号：崆峒五老", "进入战场自带内伤２０点，开场１００时序内必定暴击"}
CC.NLJS["空闻"] = {"称号："}
CC.NLJS["空性"] = {"称号："}
CC.NLJS["宋远桥"] = {"称号：武当七侠", "太极奥义触发几率上升"}
CC.NLJS["莫声谷"] = {"称号：武当七侠", "太极奥义触发几率上升"}
CC.NLJS["妙风使"] = {"称号：波斯三使"}
CC.NLJS["流云使"] = {"称号：波斯三使"}
CC.NLJS["辉月使"] = {"称号：波斯三使"}
CC.NLJS["何红药"] = {"称号：红药谁知", "攻击时造成等同自身内伤值的中毒值"}
CC.NLJS["史秉光"] = {"称号：太白三英"}
CC.NLJS["史秉文"] = {"称号：太白三英"}
CC.NLJS["黎刚"] = {"称号：太白三英"}
CC.NLJS["洞玄"] = {"称号：仙都双剑"}
CC.NLJS["闵子华"] = {"称号：仙都双剑"}
CC.NLJS["刘培生"] = {"称号：五丁手"}
CC.NLJS["梅剑和"] = {"称号：没影子"}
CC.NLJS["玉真子"] = {"称号："}
CC.NLJS["穆人清"] = {"称号：神剑仙猿"}
CC.NLJS["归心树"] = {"称号：神拳无敌"}
CC.NLJS["冯难敌"] = {"称号：八面威风"}
CC.NLJS["黄真"] = {"称号：铜笔铁算盘"}
CC.NLJS["萧半和"] = {"称号：晋阳大侠"}
CC.NLJS["莽牯朱蛤"] = {"称号："}
CC.NLJS["解风"] = {"称号："}
CC.NLJS["史火龙"] = {"称号："}
CC.NLJS["曲非烟"] = {"称号：似水如烟", "修炼玉箫剑法和持瑶琴后攻击时出现笑傲江湖的几率提高", "装备焦尾琴后可用指令＜清弦＞"}
CC.NLJS["水笙"] = {"称号：冰山侠女", "在场时敌人集气速度减三点；攻击时高几率造成冰封"}
CC.NLJS["李文秀"] = {"称号：心秀天铃", "特系两倍成长；使用特系攻击时几率增加额外杀气值；装备白马时集气速度额外增加五点", "可用指令＜天铃＞"}
CC.NLJS["石中玉"] = {"称号：连心双子", "与石破天相互攻击不会误伤，受伤时共同分担伤害"}
CC.NLJS["独孤求败"] = {"称号：剑魔", "攻击时随着攻击次数而变换招式；受攻击时如果用同样武功则无法破防"}
CC.NLJS["不戒和尚"] = {"称号："}
CC.NLJS["洪安通"] = {"称号：神龙教主", "己方在场人数越多集气速度越快"}
CC.NLJS["神雕"] = {"称号："}
CC.NLJS["大雕"] = {"称号："}
CC.NLJS["火蟾"] = {"称号："}
CC.NLJS["玄蟒"] = {"称号："}
CC.NLJS["古鳄"] = {"称号："}
CC.NLJS["彩蛛"] = {"称号："}
CC.NLJS["白猿"] = {"称号："}
CC.NLJS["阿青"] = {"称号：剑心通明", "全剑法拥有领悟效果",  "可用指令＜心猿＞"}
CC.NLJS["达摩祖师"] = {
"称号：少林祖师", 
"被暴击时所受伤害为一点；生命越低所受的伤害越低",
"完全掌握少林寺所有绝学，领悟与主运"}
CC.NLJS["完颜康"] = {"称号：锦衣贵胄", "使用物品效果双倍"}
CC.NLJS["杨康"] = {"称号：锦衣贵胄", "使用物品效果双倍"}
CC.NLJS["春风醉"] = {"称号：怡红公子", "集气速度最大化"}
CC.NLJS["逍遥子"] = {"称号：鲲鹏千古", "所有内功均有主功体效果"}
CC.NLJS["耶律齐"] = {"称号：强毅厚重", "被攻击时伤害越大则自身气防值越高"}
CC.NLJS["欧阳锋"] = {
"称号：西毒", 
"攻击时无视对方抗毒能力追加三十点中毒；被攻击必定进入走火入魔状态",
"自带蛤蟆与逆运领悟效果"}
CC.NLJS["胡一刀"] = {
"称号：刀意纵横", 
"行动过后恢复等同于刀法系数值的集气；使用胡家刀法增加胡刀秘传技",
"刀剑争霸剧情后觉醒战意系统【胡家绝刀】"}
CC.NLJS["慕容景岳"] = {"称号："}
CC.NLJS["薛鹊"] = {"称号："}
CC.NLJS["石万嗔"] = {"称号：毒手神枭"}
CC.NLJS["袁冠南"] = {"称号：鸳俦凤侣", "萧中慧在场时必连击"}
CC.NLJS["何足道"] = {"称号：昆仑三圣", "发动连击时几率追加一次随机已学武功的攻击；攻击时连锁增加"}
CC.NLJS["公孙绿萼"] = {"称号：空谷幽香", "攻击时几率附加枣核钉增加伤害值；被攻击造成封穴时减少生命值免疫封穴"}
CC.NLJS["喀丝丽"] = {"称号：香魂浩渺", "在战场时己方全体男性队友攻击效果加百分之十；女性队友防御效果加百分之十"}
CC.NLJS["阿九"] = {"称号：瑶琨碧玉", "怒气值越高集气速度越快"}
CC.NLJS["夏雪宜"] = {"称号：金蛇郎君", "无法破防时几率使出金蛇锥造成必定破防；生命值越低攻击时的气攻值越高"}
CC.NLJS["殷离"] = {"称号：离人不归", "每杀死一只蜘蛛后：攻击时伤害增加５点，必上毒增加３点，内力硬上限增加50点", "可用指令＜千蛛＞"}
CC.NLJS["丁典"] = {"称号：神照无影", "攻击时几率附加伤害，敌人生命越高附加伤害越大；主角道德值大于50时道德越高初始战意越高"}
CC.NLJS["凌霜华"] = {"称号：淡菊傲霜", "集气值低于负２００则减２００点血使自身集气全满；退场时丁典怒气战意集气全满"}
CC.NLJS["凌退思"] = {"称号："}
CC.NLJS["穆念慈"] = {"称号：霞采流虹", "自身内伤越高造成的伤害越高；与杨康同出场时分担他的伤害"}
CC.NLJS["袁紫衣"] = {"称号：紫衫仙罗", "每修炼一个外功到极被攻击时气攻值增加１５０点；每修炼一个内功被攻击时气防值增加１５０点；可无视需求修习８级以下的武功"}
CC.NLJS["风天南"] = {"称号："}
CC.NLJS["周芷若"] = {"称号：神凝若芷", "被连击时的后续攻击中免疫杀集气"}
CC.NLJS["赵敏"] = {"称号：香衣夜影", "生命值越低攻击效果越高"}
CC.NLJS["阿三"] = {"称号：金刚门人", "被攻击时怒气值上升速度加５０％"}
CC.NLJS["阿二"] = {"称号：金刚门人", "被攻击时怒气值上升速度加５０％"}
CC.NLJS["阿大"] = {"称号：八臂神剑", "使用剑法必连击"}
CC.NLJS["鹿杖客"] = {"称号：玄冥二老", "攻击时必定造成高冰封状态"}
CC.NLJS["鹤笔翁"] = {"称号：玄冥二老", "攻击时必定造成高冰封状态"}
CC.NLJS["温方达"] = {"称号：温氏五老"}
CC.NLJS["温方义"] = {"称号：温氏五老"}
CC.NLJS["温方山"] = {"称号：温氏五老"}
CC.NLJS["温方施"] = {"称号：温氏五老"}
CC.NLJS["温方悟"] = {"称号：温氏五老"}
CC.NLJS["木婉清"] = {"称号：香药叉", "美酒一杯花影腻，人闲倚遍阑干曲。婉约娉婷工语笑，清颍尊前酒满衣"}
CC.NLJS["神秘小二"] = {"称号：慵懒无双", "被攻击后立即行动"}
CC.NLJS["白绣"] = {"称号：含霜履雪", "免疫并反弹冰封状态"}
CC.NLJS["水镜四奇"] = {"称号：凤凌长空", "友方攻击时必发动招式；可用指令＜灵罡＞"}
CC.NLJS["双儿"] = {"称号：福慧双修", "友方休息时自动防御；全队战后完全回复"}
CC.NLJS["韦小宝"] = {"称号：天魁地宝", "被攻击时２０％几率闪避攻击，攻击时２０％几率被闪避攻击；攻防效果与声望有关；可用指令＜石灰＞"}
CC.NLJS["无酒不欢"] = {"称号：返璞归真", "拥有全部印信技能"}
CC.NLJS["谢无悠"] = {"称号：九天一流", "攻击随机出九天一流招式"}
CC.NLJS["宫本武藏"] = {"称号：扶桑剑圣", "攻击几率出二天一流招式，秒杀敌人"}
CC.NLJS["霍山"] = {"称号：山中老人", "被攻击几率反弹所有敌人，休息进入隐蔽状态；阴风刀攻击额外附加伤害"}
CC.NLJS["滕文婷"] = {"称号：兽王郡主", "继承蛮荒兽王的衣钵"}
CC.NLJS["黄裳"] = {"称号：万寿道尊", "九阴作者，可以破坏敌人隐蔽状态"}
CC.NLJS["武无敌"] = {"称号：十强武者", "自创十强武道及玄武真功"}
CC.NLJS["佐佐木严流"] = {"称号：物干焯", "攻击几率出严流奥义，被攻击几率出燕返反击"}
CC.NLJS["林朝英"] = {"称号：古墓玉女", "自带玉女心经领悟与门派主运，玉女剑法连击必出双剑合璧效果，银索金铃攻击必封穴并出现音律攻击"}
CC.NLJS["段思平"] = {"称号：大理先祖", "六脉神剑、一阳指、天南易阳诀创始人"}
CC.NLJS["安七"] = {"称号：第七幸运", "我的幸运来源于此，敢不敢拿你最好的武器和我赌一把"}
CC.NLJS["紫落梵"] = {"称号：凡尘狂澜", "迷之搞事者，棍术宗师，猜猜我是谁"}
CC.NLJS["木灵子"] = {"称号：崆峒奇人", "拳术造诣极高，武林人物无不钦佩"}
CC.NLJS["黄衫女"] = {
"称号：古墓嫡传", 
"使用九阴爪攻击时，可触发神爪无双效果",
"七书觉醒后，自带九阴白骨爪、玉女心经、天罗地网轻功三项武功领悟"}
CC.NLJS["公孙止"] = {
"称号：绝情谷主", 
"使用阴阳倒乱刃必定三连",
"七书觉醒后，自带阴阳倒乱刃领悟"}
CC.NLJS["老贾"] = {"称号：西域刀客", "残月飘摇，江水滔滔，武林横扫，西域狂刀"}
CC.NLJS["海底捞月"] = {"称号：逮虾户", "我有车一斤，横跨百岳"}
CC.NLJS["商御隐"] = {"称号：夜雨寄北", "何当共剪西窗烛，却话巴山夜雨时"}
CC.NLJS[""] = {
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"",
"—— 完 ——",
}

--brolycjw 对话内容
CC.BTalk201 = "那两人武功很高，恐怕我目前打不过。"
CC.BTalk202 = "你这胆小鬼！"
CC.BTalk203 = "既然石帮主已接下赏善罚恶令，到时请不要负约。"
CC.BTalk204 = "＜这侠客岛如此神秘,莫非和天书有关？？我得想想办法弄个来。＞"
CC.BTalk205 = "等等，可否把这冒牌的石破天交给我？"
CC.BTalk206 = "不行，我谢烟客居然答应了要求，一定要做到。"
CC.BTalk207 = "那只好得罪了。"
CC.BTalk208 = "不要打架了，这位大哥是个好人，他治好了我的病。老伯伯，我改了我的要求，让这个人跟这位大哥走吧。"
CC.BTalk209 = "我谢烟客已经答应的要求怎么能随意改变?"
CC.BTalk210 = "你本来要杀了这个人，他叫你不杀，你不就已经实现他的要求了吗？"
CC.BTalk211 = "小兄弟这话有道理，看来这里没我的事了。"
CC.BTalk212 = "把石中玉留下来！他把我们雪山派弄得一片混乱!!"
CC.BTalk213 = "你就是石中玉？算了，我们还是赶快离开这里。"
CC.BTalk214 = "多谢少侠救命之恩，不。。你到底有什么企图？"
CC.BTalk215 = "聪明，你的那赏善罚恶令可以给我吗？"
CC.BTalk216 = "＜侠客岛人人要闪都来不及，这个人却要去，难到侠客岛上有宝藏？＞可以，但我也有个条件，让我跟着你。"
CC.BTalk217 = "好吧。＜让你跟着也好过让你到处为非作歹。＞"
CC.BTalk218 = "这本书给你也不是不可能..."
CC.BTalk219 = "你要是能打赢我们三人，这本书就给你。"
CC.BTalk220 = "为了天书，拼了命也得试试。"
CC.BTalk221 = "连侠客岛上的武功都不是少侠的对手，看来这本书应该由少侠来保管。"
CC.BTalk222 = "废话少说，快把书拿来。"
CC.BTalk223 = "。。。"
CC.BTalk224 = "不要用这种眼光看这我，我跟你可不熟！"
CC.BTalk225 = "石兄弟，你武功那么高强，如果能得到你的帮助，相信要取得天书一定容易许多。不如你加入我吧？"
CC.BTalk226 = "好啊，阿绣不知道去哪了，反正我也没地方去，就跟大哥你。"
CC.BTalk227 = "＜喂。。你真想让这白痴跟着我们？＞"
CC.BTalk228 = "＜你想想，他武功高强，而且又跟你长得完全一模一样的人，你的仇家如果追上，你可以利用他当挡箭牌。＞"
CC.BTalk229 = "＜你这话有点道理。。＞"
CC.BTalk230 = "你要带我去送死吗？"
CC.BTalk231 = "小子，把天书交出来，否则你性命难保。"
CC.BTalk232 = "想要天书就来抢吧！"
CC.BTalk233 = "臭小子，你真有种。看招！"
CC.BTalk234 = "就知道拿到天书不可能那么容易，还好我有心里准备。"
CC.BTalk235 = "这本书对我们已经没有用了，就给你吧！"
CC.BTalk236 = "你们岛上的神功，可否借给我一看？"
CC.BTalk237 = "神功在手，天下无敌！"
CC.BTalk238 = "哦，那当我没说过。。"
CC.BTalk301 = "居然给一灯他们跑了。。"
CC.BTalk302 = "不用追了，以一灯那老和尚的内伤，恐怕也挨不了多久"
CC.BTalk303 = "原来大家都集合在这里，连你们这些号称为四绝的都要联手来对付我这个无名小卒，我还真感到荣幸。"



CC.BTalk1 = "＜杨过和小龙女的武功实在高强，看来这天书只好另想办法。＞在下武功不如杨大侠，这天书还是你比较适合占有。"
CC.BTalk2 = "小兄弟你还是放弃这本天书吧，我不把天书交给你是因为你无法应对它带来的灾难。"
CC.BTalk3 = "＜本想让他们互相残杀，然后夺取他们身上的天书。以目前的局势，要是让他们联手可不好对付，只好趁现在。。＞"
CC.BTalk4 = "糟了，兄弟，小心！"
CC.BTalk5 = "过儿！！"
CC.BTalk6 = "情况不妙，龙姑娘，你先带杨兄逃离此地，由我来对付金轮这帮人。"
CC.BTalk7 = "＜这下惨了，和杨龙夫妇他们战斗消耗的内力不少，再加上刚才对付那些臭道士，别说拖时间，就算想逃都逃不了。。＞"
CC.BTalk8 = "先干掉这小子再追小龙女。上吧！"
CC.BTalk9 = "＜神啊救救我吧。＞"
CC.BTalk10 = "你准备好了吗？"
CC.BTalk18 = "还是快点去看看杨过的伤势如何。他们应该到了附近的古墓吧。"
CC.BTalk19 = "要打架怎么没叫我。"
CC.BTalk20 = "这老顽童不好对付，走！"
CC.BTalk21 = "多谢老顽童出手相救！"
CC.BTalk22 = "他们都跑了，我们玩玩吧。"
CC.BTalk23 = "抱歉，我现在没空和你玩，改天有空再到百花谷陪你玩。"
CC.BTalk24 = "既然大家都不陪我玩，我自己玩！"
CC.BTalk25 = "这老顽童。。还是快点去看看杨过的伤势如何。他们应该到了附近的古墓吧。"
CC.BTalk26 = "龙姑娘，你怎么哭成这样，杨兄的伤。。。"
CC.BTalk27 = "龙儿，你别哭。。咳。。"
CC.BTalk28 = "这伤由我来看看。"
CC.BTalk29 = "五脏六腑已经被击毁，居然还能靠深厚的内力顶到现在，可是。。"
CC.BTalk30 = "那过儿还有救吗？快想办法救他!"
CC.BTalk31 = "方法是有，只不过。。。"
CC.BTalk32 = "是什么？我什么都愿意尝试！"
CC.BTalk33 = "是一条人命。必须把一个活人的五脏六腑移植到杨过身上，之后那活人立刻死亡。而杨过也不一定能生存。时间不多了，必须立刻动手。"
CC.BTalk34 = "这里都是死人，怎么找一个活人啊？除非我们当中其中一人。。"
CC.BTalk35 = "不行！！我绝不允许你们任何一人为我牺牲。"
CC.BTalk36 = "过儿，要是你死了，我也没有任何生存的意义了。既然都得死，我更希望你能活着。"
CC.BTalk37 = "龙儿，不要啊！兄弟，快阻止她！"
CC.BTalk38 = "不要阻止我，天书在我这，要是你不让我救过儿我就把它给毁了。"
CC.BTalk39 = "这。。杨兄。。对不起。。医生，你动手吧。"
CC.BTalk40 = "龙儿！！"
CC.BTalk41 = "杨兄，你醒了？"
CC.BTalk42 = "龙儿，龙儿呢？"
CC.BTalk43 = "这。。龙姑娘她。。"
CC.BTalk44 = "啊！！！！龙儿！！龙儿！！"
CC.BTalk45 = "＜这嗓子实在惊人，要不是我用内功顶着，早就被震昏了。＞杨兄，节衷顺变吧。。"
CC.BTalk46 = "兄弟，我舍命救你，你却为了天书不肯阻止龙儿。。你。。"
CC.BTalk47 = "对不起，请让我解释。。"
CC.BTalk48 = "算了，不用解释了，既然天书你已经有了，你走吧。我这一辈子不想在见到你。"
CC.BTalk48a = "我这一辈子不想在见到你。"
CC.BTalk49 = "杨过，想要活着的话就把那本书交出来！"
CC.BTalk50 = "我不是已经说过了，那本书已经被人拿走了，不在我这。"
CC.BTalk51 = "既然你硬不肯把它交出来，只好把你杀了再搜你的尸。"
CC.BTalk52 = "住手！你们要的东西在我这！要抢就来吧！"
CC.BTalk53 = "杨兄，你没事吧？"
CC.BTalk54 = "你还来这里做什么？我不是说过不想再见到你了吗？"
CC.BTalk55 = "你救了我一命，见到你有难，便有责任救你。我虽然不是什么英雄好汉，但还是讲义气的。"
CC.BTalk56 = "龙姑娘的死也是我的错，这里是九阴真经里的疗伤法，只要你练了很快就能复原。虽然知道无法弥补，不过我能做的就只有这些。"
CC.BTalk57 = "哼!龙儿都保护不了，有了武功又有什么用呢？"
CC.BTalk58 = "杨兄如果要继续堕落下去，相信龙姑娘在天之灵也会替你难过的。"
CC.BTalk59 = "。。我知道了。这九阴真经我练了便是。"
CC.BTalk60 = "虽然金轮被我打跑了，但过不不久又会回来，你的伤还没完全恢复，还是先跟我回小村吧。"
CC.BTalk61 = "好，我就暂时去小村避一避。"
CC.BTalk62 = "为什么要替我牺牲？"
CC.BTalk63 = "别把我看得那么伟大，杨某一向来最讨厌欠人，当日你救了我，让我能再看到龙儿，我这命也是欠你的。咳。。今日总算还给你了。"
CC.BTalk64 = "虽然如此，看到龙儿如此难过，而我死后又只剩下她一人。。希望你答应我一件事。"
CC.BTalk65 = "什么事，只要在我能力范围，我一定办到。"
CC.BTalk66 = "龙儿以后就拜托你了照顾了。"
CC.BTalk67 = "我就算放弃天书也不会让龙姑娘有什么三长两短，你放心吧。"
CC.BTalk68 = "不要，过儿，要是你死了我也不想活了。"
CC.BTalk69 = "龙儿，你也要答应我一件事。一定要好好的活下去。。我爱你。。"
CC.BTalk70 = "过儿！过儿！呜。。呜。。"
CC.BTalk71 = "龙姑娘，这古墓实在不适合居住，你还是和我回小村吧。"
CC.BTalk72 = "过儿，对不起，我无法遵循你临死前的吩咐，我们来世再见吧。"
CC.BTalk73 = "＜不好，这种时候还是要用激将法。＞龙姑娘，你要死挺简单，但你死了谁为杨大哥报仇？你可别指望我，一来我武功低微，二来我也不欠杨兄什么，没必要非得替他报仇。你要死就死，只是可怜了杨大哥被暗算，却连为其出头的人都没有！"
CC.BTalk74 = "你……这……！"
CC.BTalk75 = "龙姑娘，你要死，我绝不劝你，但我觉得你死前最应该做的是为杨兄报仇，也对得起杨兄生前对你的一往情深！"
CC.BTalk76 = "好，我就听你一言。"
CC.BTalk77 = "放心，我会帮你的。虽然我武功低微，但总能起到一些作用。"
CC.BTalk78 = "好。咱们走吧。"
CC.BTalk79 = "＜幸亏我劝服她了，要是他们俩都死了，我上哪找天书？＞"
CC.BTalk80 = "当日那小子，还有小龙女？我不是说了吗？天书在杨过手里。"
CC.BTalk81 = "今日来不是为了天书，是为了取你的狗命！！"
CC.BTalk82 = "龙姑娘，我们终于为杨兄报仇了！＜糟了，大仇已报，小龙女该不会又想自杀吧？！＞"
CC.BTalk83 = "过儿……！"
CC.BTalk84 = "龙姑娘，又想起杨大哥了？人死不能复生，我劝你还是节衷顺变吧。你如果真的那么爱杨兄的话，就应该听他的话好好活下去，杨兄的在天之灵才会欣慰！"
CC.BTalk85 = "其实，你不用劝我，这段时间我想了很久。。。现在大仇已报，心情也平静下来。过儿即然要我好好活下去，我就会好好的活下去的。"
CC.BTalk86 = "这就对了，杨兄对我恩重如山，我已经把他当成我的拜把兄弟，你就叫我大哥好了。龙姑娘日后有何打算，如有什么需要可尽管开口。"
CC.BTalk87 = "多亏今日有大哥在，我才能替过儿报仇。神雕侠侣这本书就赠给少侠吧。至于以后嘛，龙儿愿跟随大哥寻一起找天书。"
CC.BTalk88 = "放心吧，我既然答应了杨兄，就算牺牲自己的性命，也不会让你受到任何损伤。＜唉。。带着一个寡妇我也别指望想泡到妞了。。＞"
CC.BTalk89 = "又是你？今天老子不想杀人。快滚！"
CC.BTalk90 = "还有，这是过儿生前自创的掌法，大哥你的武学知识不浅，希望将来能把这掌法发扬光大。"
CC.BTalk91 = "这掌法以不于招数变化取胜，反而故意与武学道理相反，出手与寻常武功大异，厉害之处，全在内力。果然巧妙。"
CC.BTalk92 = "我对掌法的了解还不够，不过我那些江湖朋友可能在这方面比较突出。"
CC.BTalk93 = "这冰床冷冷冰冰的，能睡吗？"
CC.BTalk94 = "这是冰床，是练功用的。"
CC.BTalk95 = "练功都那么多花招，难怪你们的武功这么高强。"
CC.BTalk96 = "要是过儿还在，以我们俩的玉女素心剑绝对可以打败金轮法王。。可是。。呜。。"
CC.BTalk97 = "龙姑娘，你又哭了。我们现在要一报仇为目标，其他的事先不要去想。这玉女心经必须双人使用才能发挥，不如我也把它练成，然后我们俩联手把金轮那狗贼打败。"
CC.BTalk98 = "也只好这样了。我会尽量在最短时间传授你这套剑法。"
CC.BTalk99 = "没想到龙姑娘那么辛苦教我，我却还无法完全掌握这剑法。。"


CC.LTalk1 = "妈巴羔子的，这破地方，甚么都没有，饿死老子了。"
CC.LTalk2 = "你是谁？妈巴羔子的，贼王八蛋！"
CC.LTalk3 = "〈这人虽作和尚打扮，但却污言秽语，多半是个凶悍之徒。〉"
CC.LTalk4 = "在下只是途经此地，并无恶意。"
CC.LTalk5 = "癞痢头阿三，你去给我找些吃的东西来，大师父重重有赏，有没有肥猪？"
CC.LTalk6 = "这破庙荒山野岭没肥猪……〈这和尚，居然还杀生吃肉，定为恶人无疑〉"
CC.LTalk7 = "喂，叫你去找些吃的东西来，嘀咕嘀咕想干甚么。你不听话，瞧佛爷不要了你的狗命？"
CC.LTalk8 = "〈欺人太甚，是否要教训一下他？〉"
CC.LTalk9 = "你这和尚真是毫不讲理。"
CC.LTalk10 = "哈哈，好极，好极！老子不仅喜欢不讲理，还喜欢吃人肉。你这肌肉，吃起来一定很美味。"
CC.LTalk11 = "恶和尚，受死！"
CC.LTalk12 = "这恶僧果然有些门道，难怪敢如此嚣张。但是今日幸遇上我，也算是替天行道。"
CC.LTalk13 = "这边似乎还留有一些东西"
CC.LTalk14 = "这衣服怪丢了可惜，比我这身好，还是留给我吧。"
CC.LTalk15 = "的确比你这光着身子的好"
CC.LTalk16 = "呵呵。多谢丁大哥。不，不是丁大哥。"
CC.LTalk17 = "他……他是西藏青教的……的……血刀恶僧。"
CC.LTalk18 = "不错，血刀淫僧。"
CC.LTalk19 = "恶人，哼，滚你的罢！"
CC.LTalk20 = "姑娘你说甚么？"
CC.LTalk21 = "你……你……你别走近我，滚开。"
CC.LTalk22 = "你……你干么打我？"
CC.LTalk23 = "滚开啊"
CC.LTalk24 = "姑娘这其中是不是有什么误会。"
CC.LTalk25 = "哼，和血刀恶僧在一起的也不是什么好人，师兄我们走！"
CC.LTalk26 = "好生奇怪的姑娘"
CC.LTalk27 = "我跟他二人无冤无仇，没半点地方得罪了他们，正说得好好地，干么忽然对我如此凶恶？"
CC.LTalk28 = "狄兄弟算了吧，或许是这姑娘一时的急性子。"
CC.LTalk29 = "〈我就是这么蠢，倘若丁大哥在世，就算不能助我，也必能给我解说这中间的道理。〉"
CC.LTalk30 = "采花淫贼，赶快出来受死"
CC.LTalk31 = "狄兄弟，那姑娘又回来了，不知道想做什么。我们出去看看吧"
CC.LTalk32 = "嗯，若不说个清楚，忌不冤枉？"
CC.LTalk33 = "可算出来了，有人指认你奸杀官家小姐，早知道刚才就应该杀了你。原来你……你竟这么坏。"
CC.LTalk34 = "我不是采花贼"
CC.LTalk35 = "淫僧，你在两湖做下了这许多案子，还想活命不成！"
CC.LTalk36 = "师兄，杀了这淫贼！"
CC.LTalk37 = "我不是。〈我命中注定要给人冤枉，那也无法可想。〉"
CC.LTalk38 = "手下留人，休得伤他性命。"
CC.LTalk39 = "徒儿退下，让老祖我来会会他。"
CC.LTalk40 = "〈这老僧好生厉害〉"
CC.LTalk41 = "表妹，快走！"
CC.LTalk42 = "想走？"
CC.LTalk43 = "好美的姑娘，哈哈！很标致，了不起！老和尚艳福不浅。"
CC.LTalk44 = "表妹，表妹！啊！！"
CC.LTalk45 = "〈糟糕，狄兄弟也被掳走了。似乎往雪山方向走了〉"
CC.LTalk46 = "这地方好冷，还是出去吧。"
CC.LTalk47 = "快把我女儿放了，否则今日我们兄弟定让你生不如死！"
CC.LTalk48 = "〈怎么办，狄兄弟还在血刀老祖手里。真的要和~~落花流水~~为敌么〉"
CC.LTalk49 = "徒儿，你居然对我暗下毒手，我绝不饶你，受死吧"
CC.LTalk50 = "你伤我大哥，我跟你拼了！！！"
CC.LTalk51 = "拼搏中狄云神照功意外大成.........."
CC.LTalk52 = "啊~~~"
CC.LTalk53 = "呼呼~~~"
CC.LTalk54 = "狄兄弟，你没事吧？"
CC.LTalk55 = "没事，刚才在命悬一刻的时候，突然感觉精神力勃然而兴，才得以踹死这老恶僧。丁大哥说得没错，这神照功果然是武功第一奇功。"
CC.LTalk56 = "狄云攻防轻各能力提升三十点"
CC.LTalk57 = "狄云四系兵器值各提升十点"
CC.LTalk58 = "狄兄弟，我们走吧。"
CC.LTalk59 = "我也想跟着狄大哥。"
CC.LTalk60 = "您现在的队伍已经满人了。"
CC.LTalk61 = "咦，有字显示出来了"
CC.LTalk62 = "似乎只有狄兄弟才能理解这其中的意思"
CC.LTalk63 = "连城诀……天宁寺大佛后……"
CC.LTalk64 = "终于有天书的下落了，我们赶紧过去看看吧"
CC.LTalk65 = "似乎还有一个类似剑谱的东西"
CC.LTalk66 = "静夜思"
CC.LTalk67 = "床前明月光，疑是地上霜"
CC.LTalk68 = "举头望明月，低头思故乡"
CC.LTalk69 = "是连城剑诀，没想到竟然在这唐诗之中"
CC.LTalk70 = "不枉我装死，隐姓埋名这么辛苦。连城诀最终还是我的，哈哈哈哈~~~"
CC.LTalk71 = "师父，原来你没有死！"
CC.LTalk72 = "云儿，是你。赶紧把连城诀交出来，饶你们不死。"
CC.LTalk73 = "师父，你怎么"
CC.LTalk74 = "这连城诀已经有主人了"
CC.LTalk75 = "找死！"
CC.LTalk76 = "不！！！*连城诀是我的，是我的！！*啊~~~~"
CC.LTalk77 = "师父......."
CC.LTalk78 = "狄兄弟，算了，你师父已经不是以前的师父"
CC.LTalk79 = "人赶紧给放了。"
CC.LTalk80 = "小子，你脾气挺合老子胃口，加入血刀门吧。"
CC.LTalk81 = "血刀门是什么东西，我倒是觉得你身上这把刀不错。怎么样，也一起送给我吧。"
CC.LTalk82 = "嘿嘿，小子，好眼力。这把血刀是老祖我的贴身武器，有本事你就过来拿吧。"
CC.LTalk83 = "小子，够狠！这把血刀就给你了。"
CC.LTalk84 = "天下宝物，能者居之。"
CC.LTalk85 = "好一个“能者居之”，小子，你真有种。"
CC.LTalk86 = "血刀老祖突然偷袭......"
CC.LTalk87 = "大哥，小心！"
CC.LTalk88 = "神照经当真奇妙，四肢百骸感觉劲力充盈。丁大哥，我一定不会让你失望的~~~"
CC.LTalk89 = "狄云领悟神照经的真髓，轻功加二十"
CC.LTalk90 = "对不起，你的队伍已经满了，我无法加入";
CC.LTalk91 = "好久没有去祭拜丁大哥了，我想去药王庙看一看。";
CC.LTalk92 = "丁典之墓";
CC.LTalk93 = "唉，如此的英雄竟被埋没于此";
CC.LTalk94 = "丁大哥~~我真的好没用！没用。老天爷啊，如果你让能丁大哥再活转来，我宁可再回到牢狱之中，永远不再出来。宁可不去报仇，宁可一生一世受万门弟子的欺侮折辱。宁可失去自己的性命，只要丁大哥能活过来。老天爷~~"
CC.LTalk95 = "狄兄弟，人死不能复生，请节哀顺变吧。旁边有个庙宇，我们进去歇息一会。"
CC.LTalk96 = "武学之道在于变而不在于招*剑学之道不在于剑而在于心*有心万物皆为剑"
CC.LTalk97 = "生平求一敌手而不可得，诚寂寥难堪也"
CC.LTalk98 = "久仰独孤前辈大名，在下今日特来向前辈请教"
CC.LTalk99 = "哈哈~~果然是后生可畏~~请~~"
CC.LTalk100 = "好，痛快！吾此生无憾已！遇到江湖大战，可别忘了告知我一番，哈哈哈哈"
CC.LTalk101 = "武学造诣很好，只可惜太过冒进。先去江湖历练一番吧。"

--田伯光外传对话内容
CC.LTalk102 = "哎，贤弟，你看那边，那小妮子长得好生俊俏呀。虽是个小尼姑，但也别有一番风味哦。"
CC.LTalk103 = "哦，是吗？咦，她长得倒真是挺俊美呀，可她是个小尼姑哦！田兄，莫非连这类型的也感兴趣？"
CC.LTalk104 = "哎呀，贤弟，我管她小尼姑还是小蘑菇，只要是年轻俊美的女人，我“采花大盗“田大侠就绝不会放过，哈哈哈，要不贤弟，你我一起去风流风流？哈哈….."
CC.LTalk105 = "……"
CC.LTalk106 = "哈哈，小美人，你这小脸蛋长得可真好看呀，看的我田大爷是心花怒放啊，真是越看越喜欢呀。来，陪我田大爷玩玩吧。就你这花容月貌的姿色，做小尼姑，实在太可惜啦。"
CC.LTalk107 = "啊，你这色胆包天的淫贼，光天化日之下竟敢这样轻薄于人？"
CC.LTalk108 = "哈哈，这天下之大，到处都是我田某的家。估计你一直都还没被滋润过吧？今日就让我田大爷来给你滋润滋润吧，这也是你的福气哦，来吧！小美人…"
CC.LTalk109 = "啊，救命呀。。。。"
CC.LTalk110 = "好大胆的淫贼"
CC.LTalk111 = "姑娘，此淫贼刀法快如疾风，你我不可力敌，我们快跑。。。"
CC.LTalk112 = "跑得真快！妈拉个吧子，这么好的好事都被人给搅了，真是气死老子了，这次算他们走运，下次如果再让我遇到这小子，我定要饶不了这小子，还有那小尼姑！哼！！！"
CC.LTalk113 = "哈哈哈，这可真是冤家路窄呀。当日你坏我好事，今日你我居然又在此相见。上次，你我对战尚未分胜负，来吧，这次，你我大战三百回合，一决雌雄"
CC.LTalk114 = "你这淫贼，看今日我来替天行道。看招"
CC.LTalk115 = "哈哈，可爱的小美人，上次你我一别，那我对你可是日思夜想呀，就连在梦中都会思念你那俊俏的小脸蛋，今日田爷我再也耐不住对你那滔滔不绝的思念，特意来恒山找你哦，可真是想死我了呀。"
CC.LTalk116 = "天啊，你这淫贼，竟找到这里来了，救命啊。。。师傅，师傅"
CC.LTalk117 = "哈哈，别叫了，小美人，虽然你这么喜欢挣扎，又爱冲动，但我田大爷就是喜欢。快来吧，小宝贝，快放弃你这无谓的抵抗，快从了我田大爷吧，哈哈。。。今日我田爷，就让你明白明白，什么叫做鱼水之欢。哈哈哈。。。"
CC.LTalk118 = "大胆淫贼，竟来到我恒山派做如此龌龊不堪之事，你这不知天高地厚的淫贼，还有没有王法？来人啊，速将此淫贼给我拿下…"
CC.LTalk119 = "哈哈，你们恒山派也不过如此嘛。这江湖上都是成者为王败者为寇，定仪师太，我田某敬你是江湖前辈，你若交出我心爱的仪琳小师妹，我就此作罢，若不然，今日我就要踏平你们恒山派，然后将你们这些尼姑通通卖到我最爱的丽春院去，哈哈哈哈…."
CC.LTalk120 = "你，你，你这个狂徒…."
CC.LTalk121 = "哈哈哈…哼，给我快交出仪琳！"
CC.LTalk122 = "大胆淫贼，竟敢欺我女儿！"
CC.LTalk123 = "田兄，依我看今日之事，未免闹得有些大了，以田兄的武功与风流，这漂亮女人并不是难事，更何况人家现在又以死相搏，如若我们还要强取，这今后在江湖上，你我都不好立足啊。希望田兄看在我的薄面上，先放过仪琳，况且日后，这年轻貌美的女子还有的是呢！何必为了一个小尼姑而闹得血流成河呢？今日就请田兄先暂且罢手把。好吗？"
CC.LTalk124 = "这…，哎，成吧，那今日就看在贤弟你面子上，放过他们。"
CC.LTalk125 = "那在下在此就先谢过田兄了，田兄，我们走吧…."
CC.LTalk126 = "哈哈，淫贼，今日你尝到了我不戒和尚的厉害了吧，居然还想欺霸我女儿，真是赖蛤蟆想吃天鹅肉，今日我就让你以后都再也不到吃天鹅肉。我让你做一辈子的癞蛤蟆。哈哈哈。。。"
CC.LTalk127 = "啊。。。。你这个万恶狠毒的秃驴。"
CC.LTalk128 = "＜这令狐冲剑法竟如此进步神速。今日时运不佳，赶紧溜＞不打了，田大爷我今日累了，不想跟你计较。"


CC.LWARS1 = "真拳气功护体";
CC.LWARS2 = "呼呼~~终于闯过去了~~~少林十八铜人阵果然名不虚传~~";
CC.LWARS3 = "呼呼~~好可惜，差一点就成功了。少林十八铜人阵果然名不虚传";


--brolycjw修改冰糖恋 对话内容
CC.TTalk1 = "<咦？前面发生什么事了？>";
CC.TTalk2 = "你觉得你还能逃出去么？识相的话就快将高昌迷宫的地图交出来。";
CC.TTalk3 = "你们这群杀我爹娘的恶人，我死也不会交给你们的。";
CC.TTalk4 = "<地图？难道和天书有关>";
CC.TTalk5 = "住手！";
CC.TTalk6 = "你们一大堆男人欺负一个小姑娘，不觉得羞愧吗？";
CC.TTalk7 = "哪里蹦出来的野猴子，连我青蟒剑的事也敢插手，活的不耐烦了是不？";
CC.TTalk8 = "有种再说一遍！！";
CC.TTalk9 = "我说哪里蹦出来的野猴子，连我青蟒剑的事也敢插手...";
CC.TTalk10 = "再！说！一！遍！";
CC.TTalk11 = "你耳朵有问题是不？我说哪里来的野猴子..";
CC.TTalk12 = "你！可以去死了！";
CC.TTalk13 = "大侠饶命啊，小人有眼不识高人..";
CC.TTalk14 = "辱我者，死！";
CC.TTalk15 = "啊........";
CC.TTalk16 = "小女子谢过大侠救命之恩";
CC.TTalk17 = "姑娘不必多礼，敢问姑娘如何称呼";
CC.TTalk18 = "小女子李文秀，恳请少侠救救我师父，他中了毒针";
CC.TTalk19 = "恩公莫要见怪，我师父脾气有些古怪。敢问恩公如何称呼？";
CC.TTalk20 = "在下%s。";
CC.TTalk21 = "见过%s少侠。";
CC.TTalk22 = "莫要多礼，李姑娘，你今后有何打算？";
CC.TTalk23 = "也好，顺便找寻高昌迷宫的下落，这条手绢和这匹白马是爹娘仅留的两个物事，或许就藏在这里面了。";
CC.TTalk24 = "以后有美女相伴了。但是，这个手绢到底有什么奥秘呢？还是回家问问贤叔和丑叔吧。";
CC.TTalk25 = "<还是再观望一下，说不定能得到迷宫的下落>";
CC.TTalk26 = "兄弟们，大家一起上！";
CC.TTalk27 = "你这臭婊子竟然放毒针！我杀了你！";
CC.TTalk28 = "李文秀手一滑，将随身手绢掉了出来，上面已沾满了血渍，隐约可见是一幅山川图";
CC.TTalk29 = "这是..这是高昌迷宫的地图，终于让我找到了！哈哈哈....";
CC.TTalk30 = "师父，趁现在，我们快走！";
CC.TTalk31 = "螳螂捕蝉，黄雀在后。快将地图交过来吧。";
CC.TTalk32 = "哪来的野猴子，敢抢老子的东西。";
CC.TTalk33 = "不知死活！";
CC.TTalk34 = "大侠，小的有眼不识泰山，冒犯了大侠，该死。";
CC.TTalk35 = "你倒挺识相的，以后就跟着我混了。";
CC.TTalk36 = "谢谢大侠。";
CC.TTalk37 = "这白马不错，归我了。";
CC.TTalk38 = "天机不可泄漏，佛曰：不可说。";
CC.TTalk39 = "... ...<我什么都还没说呢>";
CC.TTalk40 = "我知道你想问什么，但你是否真的确定要寻找？";
CC.TTalk41 = "？？？？？？？？";
CC.TTalk42 = "罢了，这一关你迟早都要过的...手绢给我吧。";
CC.TTalk43 = "去吧，孩子！";
CC.TTalk44 = "丑叔，你知道高昌迷宫吗？";
CC.TTalk45 = "高昌迷宫？好像有点印象..哎，人老了，记忆力也衰退了，要是能喝点香醇的五宝花蜜酒该多好。";
CC.TTalk46 = "就你这孩子最懂我的心，好吧，手绢拿来。";
CC.TTalk47 = "谢谢丑叔，下次我再带几瓶更香更醇的酒来看您。";
CC.TTalk48 = "好孩子。";
CC.TTalk49 = "<五宝花蜜酒>";
CC.TTalk50 = "年轻人不厚道啊，忽悠我这个老头子。";
CC.TTalk51 = "师父，我是阿秀啊。";
CC.TTalk52 = "阿秀？真的是阿秀，快过来，师父找到宝藏了。";
CC.TTalk53 = "阿秀，小心！";
CC.TTalk54 = "啊！";
CC.TTalk55 = "你这丧心病狂的混蛋，为了宝藏竟然连徒弟也害,看招！";
CC.TTalk56 = "这种混蛋，放过你只会害死更多的人，去死！";
CC.TTalk57 = "阿秀，你没事吧？<好险毒针未侵入心脉，待我用内功将其毒逼出来。>";
CC.TTalk58 = "<师父，或许这对你来说也是一种很好的归宿吧...>少侠，我没事了，我们继续往里面看看吧。";
CC.TTalk59 = "作为这个游戏中仅有的两个智慧物事之一，首先恭喜你平安地来到这里，我可以很负责任地告诉你，里面有你想要的天书。但是，想要过我这道门，就必须过我三关！准备好了就来对话我吧。";
CC.TTalk60 = "恭喜你回答正确！";
CC.TTalk61 = "不好意思，你答错了。";
CC.TTalk62 = "第二关：勇心。迎接你的战斗吧！";
CC.TTalk63 = "恭喜你成功闯过第二关！";
CC.TTalk64 = "这是最后一关了，为了不让自己后悔，请慎重！";
CC.TTalk65 = "想要闯这一关，请将你最心爱的女人带过来。";
CC.TTalk66 = "<我怎么可以让阿秀去牺牲呢>我来做这个血祭！";
CC.TTalk67 = "少侠不可！";
CC.TTalk68 = "李姑娘..不，阿秀，我走以后，好好照顾自己，江南的杨柳，已抽出嫩芽了，江南的儿郎，也应该..";
CC.TTalk69 = "少侠，那都是很好很好的，可是我偏不喜欢。";
CC.TTalk70 = "<对了，我记得少侠包袱里面有救命的药>少侠快快服下。";
CC.TTalk71 = "你是谁？我在哪里？";
CC.TTalk72 = "我便是你，你便是我。这里，就是梦里。想回去么？那么就得击败我，或者说，击败你自己。";
CC.TTalk73 = "世间本无我，一切皆虚幻，破！";
CC.TTalk74 = "没有了命根子，那我还要女人干吗？但为君故，虽死无憾！";
CC.TTalk75 = "啊！！！！！！！！";
CC.TTalk76 = "大丈夫当有所担当，我来！";
CC.TTalk77 = "少侠，我知道你担负着重要的使命。我的命是你救回来的，阿秀正当替少侠分忧。反正师父和计爷爷都走了，苏普也有他的阿曼，阿秀了无心愿了。只是希望少侠能采一支江南的柳条放在阿秀的坟前。";
CC.TTalk78 = "阿秀，不可！";
CC.TTalk79 = "少侠，阿秀去了。<如果有来世，我真的希望自己不是被真主惩罚的汉人，再见了，天铃鸟，再见了，少侠，再见了，苏普...>";
CC.TTalk80 = "<怎么办？怎么办？对了！我包袱里有天王保命丹！>阿秀，挺住！";
CC.TTalk81 = "太好了，终于醒过来了。";
CC.TTalk82 = "少侠，我...";
CC.TTalk83 = "阿秀，不用说了，我带你回江南，那里有春燕，有柳荫，还有...还有我。";
CC.TTalk84 = "<少侠>";
CC.TTalk85 = "恭喜闯过第三关！";
CC.TTalk86 = "阿秀，我们走吧。";
CC.TTalk87 = "<阿秀走了...>";
CC.TTalk88 = "<原来人最大的敌人就是自己>";
CC.TTalk89 = "少侠，你终于醒了，吓死我了。";
CC.TTalk90 = "我没事了，阿秀。";
CC.TTalk91 = "少侠，你若走了，我便...";
CC.TTalk92 = "阿秀，不可以乱说话。";
CC.TTalk93 = "少侠，我想...陪你一起去江南看看柳条，看一辈子。";
CC.TTalk94 = "阿秀...<陪你一辈子...>";
CC.TTalk95 = "第一关：仁德。让我看看...";
CC.TTalk96 = "好了，请进行第二关。";
CC.TTalk97 = "%s走火入魔，挑战心魔。";
CC.TTalk98 = "恭喜少侠挺过20时序，成功过关。";
CC.TTalk99 = "我即是魔，魔即是我。我终于懂了！";
CC.TTalk100 = "";
CC.TTalk101 = "因为被打的就是你！";
CC.TTalk102 = "一个女人都保护不了的话，那我做男人就没有意义了！对不起了，祖宗们！";
CC.TTalk103 = "不要啊，大哥！"
CC.TTalk104 = "大哥。。你。。"
CC.TTalk105 = "不。。 现在的我不是大哥，也不是大姐。。"
CC.TTalk106 = "。。。" 

CC.NTalk1 = "叛徒别走！"
CC.NTalk2 = "站住！把大师兄的位置交出来！"
CC.NTalk3 = "动无常则，若危若安"
CC.NTalk4 = "进止难期，若往若还"

--擂台战

CC.battlee = {
	{1, 1, 72, "江湖传闻胡一刀的死与天龙门田归农有关，希望胡斐能查明真相。"},
	{2, 3, 621, "江湖传闻胡一刀觉得和某大侠没打够，苗大侠也是这么想的。"},
	{3, 621, 3, "江湖传闻苗人凤觉得和某大侠没打够，胡大侠也是这么想的。"},
	{4, 72, 1, "江湖传闻胡家后人胡斐正在筹划为父报仇，希望田归农能早做准备。"},
	{5, 2, 624, "江湖传闻毒手药王师弟石万嗔又在江湖为非作歹，希望程灵素能为武林清理门户。"},
	{6, 37, 97, "江湖传闻血刀老祖重出江湖正在到处奸淫烧杀，希望狄云能挺身而出。"},
	{7, 589, 97, "江湖传闻血刀老祖重出江湖正在到处奸淫烧杀，希望水笙姑娘可以全身而退。"},
	{8, 52, 97, "江湖传闻血刀老祖重出江湖，希望江南大侠花铁干可以挺身而出。"},
	{9, 632, 659, "江湖传闻戚长发又在打连城诀宝藏的主意，希望菊花剑客丁典可以阻止他。"},
	{10, 595, 51, "江湖传闻慕容博当年故意传人武功害人走火入魔，希望鸠摩智能找到他的后代复仇。"},
	{11, 49, 46, "江湖传闻逍遥派叛徒丁春秋正在星宿海肆虐，希望逍遥派传人虚竹可以挺身而出。"},
	{12, 53, 51, "江湖传闻江南慕容复伙同四大恶人上大理寻仇，希望大理传人段誉可以抵挡得住。"},
	{13, 44, 99, "江湖传闻叶二娘对自己一直排名四大恶人老二很有信心，不过那个岳老三就不这么想了。"},
	{14, 51, 53, "江湖传闻大理世子段誉对琅嬛仙子造成骚扰，希望慕容复不会戴绿帽子才好。"},
	{15, 48, 50, "江湖传闻阿紫姑娘被她姐夫欺负了？希望游坦之能查明事实真相。"},
	{16, 47, 46, "江湖传闻星宿老仙正在大肆搜索某个逆徒，希望阿紫能跑掉的好。"},
	{17, 90, 48, "江湖传闻游坦之要挖掉某人的眼睛讨好阿紫姑娘，希望钟灵姑娘能给他一个教训。"},
	{18, 55, 60, "江湖传闻西毒欧阳锋重出江湖来中原挑衅，希望郭靖能够挺身而出。"},
	{19, 56, 62, "江湖传闻蒙古金轮法王来丐帮挑衅，希望黄蓉黄帮主能够出面交涉。"},
	{20, 78, 61, "西域传人欧阳克奉命抢夺九阴真经，希望梅超风能够抵挡得住。"},
	{21, 61, 78, "江湖传闻铁尸梅超风叛出桃花岛前窃取了九阴真经，希望神功真能落到欧阳克手上。"},
	{22, 620, 69, "江湖传闻北丐洪七公在华山烤鸡翅膀，希望西毒欧阳锋能跟他好好打一场。"},
	{23, 590, 138, "江湖传闻瓦尔拉齐要报复所有哈萨克人，希望李文秀可以化解这场仇恨。"},
	{24, 664, 150, "江湖传闻冯锡范害死了天地会总舵主陈近南，希望韦爵爷可以为师傅报仇。"},
	{25, 86, 150, "江湖传闻冯锡范又想干一些伤天害理的事情，希望阿珂姑娘可以阻止他。"},
	{26, 87, 71, "江湖传闻洪安通要找某人的麻烦，希望苏荃姑娘可以打发走他。"},
}

CC.battle = {
	{1, 35, 26, "江湖传闻任我行准备侵犯五岳剑派，希望五岳传人令狐冲可以抵挡得住。"},
	{2, 36, 35, "江湖传闻华山叛徒令狐冲偷了辟邪剑谱，希望林平之可以查证。"},
	{3, 73, 27, "江湖传闻东方不败篡位日月神教，希望神教传人任盈盈可以东山再起。"},
	{4, 29, 35, "江湖传闻华山令狐冲正在寻找某个采花大盗，希望田伯光能够早做准备。"},
	{5, 75, 80, "江湖传闻朝廷鹰犬张召重正在搜索红花会群雄。希望陈家洛可以阻止他。"},
	{6, 80, 75, "江湖传闻红花会余党陈家洛在附近出没，希望张召重可以捉拿之。"},
	{7, 594, 58, "江湖传闻西狂杨过当年用玄铁剑伤了某个国师，希望金轮法王可以顺利复仇。"},
	{8, 58, 64, "江湖传闻老顽童最近在百花谷无所事事，希望杨过能陪他切磋。"},
	{9, 59, 62, "江湖传闻蒙古金轮法王趁七子闭关时入侵全真教，希望好邻居小龙女可以帮忙抵挡一下。"},
	{10, 63, 161, "江湖传闻赤炼仙子李莫愁又开始胡作非为了，希望程英能够阻止她。"},
	{11, 161, 56, "江湖传闻桃花岛仗势欺人以多击寡，希望李莫愁这一次能一雪前耻。"},
	{12, 84, 56, "江湖传闻丐帮打狗棒法天下无双，希望小王爷霍都能抵挡的住。"},
	{13, 38, 39, "江湖传闻侠客岛龙岛主在寻找会太玄神功的有缘人切磋武功，希望他可以找到石破天。"},
	{14, 591, 43, "江湖传闻雪山派白万剑要重罚某个弟子，希望石中玉可以躲过此劫。"},
	{15, 85, 38, "江湖传闻新长乐帮帮主石破天练功练的走火入魔，希望贝海石可以救救他。"},
	{16, 81, 122, "江湖传闻判官笔朱子柳对自己的后代很不满，希望朱九真能勤练家传武功。"},
	{17, 9, 18, "江湖传闻霹雳手成昆就是当年害狮王全家的人，希望张无忌可以顺利复仇。"},
	{18, 82, 5, "江湖传闻武当张真人正在寻找某个逆徒，希望宋青书可以早做准备。"},
	{19, 11, 18, "江湖传闻霹雳手成昆秘密计划颠覆明教，希望杨逍可以挺身而出。"},
	{20, 54, 184, "江湖传闻铁剑门叛徒玉真子正在华山挑衅，希望袁承志能够挺身而出。"},
	{21, 630, 83, "江湖传闻五仙教教主何铁手正在用人试毒，希望金蛇郎君夏雪宜可以闯教解救他们。"},
	{22, 91, 184, "江湖传闻铁剑门叛徒玉真子大言不惭侮辱金蛇郎君，希望温青青可以给他一个教训。"},
	{23, 54, 184, "江湖传闻铁剑门叛徒玉真子要清扫五仙教，希望五仙教教主何铁手能够保护教众"},
	{24, 77, 650, "江湖传闻卓天雄将上门讨要鸳鸯刀，希望萧中慧可以保护好鸳鸯宝刀。"},
	{25, 625, 650, "江湖传闻卓天雄将上门讨要鸳鸯刀，希望袁冠男可以保护好鸳鸯宝刀。"},
	{26, 629, 184, "江湖传闻玉真子又来铁剑门惹事，希望铁剑门弟子阿九可以替自己师傅出口气。"},
}

CC.HZ = {
	{1, "乘云令", "乘云游雾", "集气速度+5"}, --成昆战胜
	{2, "御风令", "扶摇九天", "初始集气+300"}, --成昆战胜
	{3, "阎王令", "十殿阎罗", "几率秒杀，对头目无效"},
	{4, "幽冥符", "散魂灭魄", "退场时攻击自己的敌人也一同退场，对头目无效"}, --曲非烟/任盈盈+焦尾琴在破庙墓拿到
	{5, "修罗令", "赤炼修罗", "每杀死一人回血100点"}, --过任我行
	{6, "武圣令", "超凡入圣", "攻防轻+10%"}, --郭襄vs法王支线
	{7, "多情符", "怜香惜玉", "对异性伤害-10%，被异性伤害-20%"}, --欧阳克自带
	{8, "无情符", "辣手摧花", "对异性伤害+20%，被异性伤害+10%"}, --石中玉自带
	{9, "长生符", "长生不灭", "几率吸收伤害转化为生命"}, --金轮加入战胜
	{10, "归元符", "五气归元", "被攻击时生命加80点"},
	{11, "涅磐符", "诸法寂灭", "内伤越高暴击连击率越高，伤害越高"}, --倚天正挑赢狮王
	{12, "狂龙令", "狂龙天翔", "连击暴击率增加"}, --天龙邪单挑乔峰
	{13, "无相印", "无如是相", "修炼秘籍四系需求-5"},
	{14, "玲珑印", "玲珑璇玑", "修炼秘籍兵器值增长追加1点"}, --穆念慈支线
	{15, "中庸印", "执两用中", "修炼秘籍无视资质需求，主角限定"}, --30-70主角觉醒
	{16, "雄才令", "雄才大略", "升级时点数额外增加1点"}, --何足道下棋
	{17, "暗金符", "含沙射影", "攻击时几率杀敌全员生命50点"}, --何铁手自带，何红药支线
	{18, "药王符", "悬壶济世", "医疗+100点"}, --程灵素活
	{19, "巫蛊令", "万蛊噬天", "用毒+100点"}, --何红药支线
	{20, "止水印", "明镜止水", "免疫内伤"},
	{21, "逍遥印", "浮生逍遥", "奇遇等级上升，主角限定"}, --名声50+
	{22, "连环印", "妙手连环", "连击伤害不减少"},
	{23, "金刚印", "金刚不坏", "免疫暴击的额外伤害"},
	{24, "太虚印", "神游太虚", "被多次连击时免疫连击的最后一击"},
	{25, "遁甲符", "奇门遁甲", "场上所有敌人集气速度-10%"},
	{26, "达摩印", "天地独尊", "几率免疫杀气"}, --倚天邪灭少林
	{27, "葵花印", "唯我不败", "必定二连击"},
	{28, "太极令", "万法自然", "几率攻击后集气从50%开始"}, --觉醒前拿武当三宝赢
	{29, "豪侠令", "奋英雄怒", "暴怒时几率发动三连击"}, --天龙邪单挑乔峰/天龙正结束
	{30, "仙音符", "箫韶九成", "攻击时几率杀敌全员内力500点"},
	{31, "先天印", "先天一阳", "500血復活一次"}, 
	{32, "神通印", "醉武成痴", "每行动一次攻击效果提升5%"}, --百花谷单人上场赢老顽童
	{33, "叫化令", "丐世神罡", "降龙和打狗大招几率上升"}, --过洪7
	{34, "西域令", "倒行逆施", "攻击时无视对方抗毒能力追加25点中毒"}, --牛家村单挑西毒胜

}




CC.SK  = {
	--{"蛇行狸翻", "无视建筑障碍移动", "耗费８００点"},
	--{"以进为退", "移动后可以再次移动", 600},
			--{"后发先至", "被攻击时，几率抢先攻击", 800},
	--{"万法自然", ""},
		--{"清风拂山岗", "被攻击时２０％几率敌方同时减少所受杀气值的集气", 800},	
			--{"爱武成痴", "战斗时每回合伤害+2%", 500},
	--{"七星聚会", "攻击伤害随此次打中的敌人数量而增加", 600},	
		--{"国士无双", "随生命降低攻击伤害增加", 600},
	--{"天命加身", "可以触发特殊武功极意", 600},
	--{"神医妙手", "医疗范围为方阵", 800},
	--{"毒煞千阵", "用毒范围为方阵", 800},
	--{"战神附体", "暴击时触发，攻击额外增加100", 800},	
	--{"漫天花雨", "使用暗器范围为敌人全体，伤害翻倍", 800},
		--{"他强任他强", "被攻击时２０％几率伤害减半不受内伤", 800},
	--[[{"钢拳1", ""},
	{"钢拳2", ""},
	{"钢拳3", ""},
	{"霸拳1", ""},	
	{"霸拳2", ""},	
	{"霸拳3", ""},	
	{"柔拳1", ""},	
	{"柔拳2", ""},
	{"柔拳3", ""},]]
	{"钢拳", "拳法威力+10%", 80},
	{"霸拳", "每一拳法到极伤害加25", 100},	
	{"柔拳", "每一拳法到极气攻+100", 120},
	{"钢剑", "剑法威力+10%", 80},
	{"霸剑", "每一剑法到极伤害加25", 100},	
	{"柔剑", "每一剑法到极气攻+100", 120},
	{"钢刀", "刀法威力+10%", 80},
	{"霸刀", "每一刀法到极伤害加25", 100},	
	{"柔刀", "每一刀法到极气攻+100", 120},
	{"钢棍", "奇门威力+10%", 80},
	{"霸棍", "每一奇门到极伤害加25", 100},	
	{"柔棍", "每一奇门到极气攻+100", 120},	
	{"轻身壹", "集气速度+2", 60},
	{"轻身贰", "集气速度+4", 120},	
	{"轻身叁", "集气速度+6", 240},
	{"连击壹", "增加连击率１０点", 60},
	{"连击贰", "增加连击率２０点", 120},	
	{"连击叁", "增加连击率３０点", 240},
	{"暴击壹", "增加暴击率１０点", 60},	
	{"暴击贰", "增加暴击率２０点", 120},
	{"暴击叁", "增加暴击率３０点", 240},
	{"战意壹", "初始战意+10，不可叠加", 40},	
	{"战意贰", "初始战意+15，不可叠加", 80},
	{"战意叁", "初始战意+20，不可叠加", 160},
	{"互搏壹", "左右发动几率+10，不可叠加", 400},	
	{"互搏贰", "左右发动几率+20，不可叠加", 600},
	{"互搏叁", "左右发动几率+30，不可叠加", 800},
	{"天资壹", "升级获得属性点数+1，不可叠加", 50},	
	{"天资贰", "升级获得属性点数+2，不可叠加", 100},	
	{"天资叁", "升级获得属性点数+3，不可叠加", 150},		
	{"仁者无敌", "开局满道德", 100},
	{"博览群书", "修炼物品攻击力增加翻倍", 200},
	{"博览群书", "修炼物品防御力增加翻倍", 200},	
	{"博览群书", "修炼物品轻功增加翻倍", 200},
	{"博览群书", "修炼物品拳掌功夫增加翻倍", 400},
	{"博览群书", "修炼物品御剑能力增加翻倍", 400},	
	{"博览群书", "修炼物品耍刀技巧增加翻倍", 400},
	{"博览群书", "修炼物品特殊兵器增加翻倍", 400},	
	{"精打细算", "战斗后获得金钱食材", 400},
	{"大内总管", "性别为太监，不受集气惩罚", 500},	
	{"料敌先机", "初始集气位置+400", 500},
	{"料事如神", "初始满集气", 800},	
	{"战意高昂", "在场时己方队友伤害+10%", 500},	
	{"罗汉金身", "在场时敌方伤害-10%", 500},
	{"妙手回春", "在场时己方吃药效果+30%", 500},
	{"姹紫嫣红", "攻击时无视毒抗上毒20", 500},
	{"万毒心经", "全场敌人无视毒抗上毒20", 800},	
	{"神出鬼没", "无视ＺＯＣ移动", 600},
	{"激流勇进", "己方队友集气速度+10%", 600},
	{"龙象神威", "暴击时伤害为２倍", 600},
	{"武学经义", "己方特效几率加10", 600},
	{"坚若磐石", "被攻击时造成的流血值减半", 600},
	{"铜皮铁骨", "被攻击时造成的内伤值减半", 700},
	{"身轻如燕", "被攻击时造成的迟缓值减半", 700},
	{"精妙玄奇", "己方误伤伤害为1点", 700},		
	{"妙手连环", "连击伤害不减", 700},
	{"气海无量", "攻击后集气位置+200", 700},	
	{"排兵列阵", "战斗开始前可以布阵", 800},
	{"武中无相", "必出招式且招式杀气值加５０％", 800},	
	{"天罡战气", "可以使用内功攻击", 800},
	{"拳倾天下", "攻击时发动连击则必暴击", 1000},
	{"奇经八脉", "可以装备两个功体", 1000},
	{"夺命阎罗", "生命小于３０％时１０％几率秒杀杂兵", 1000},
	{"剑痴刀狂", "攻击时２０％几率增加随机连击次数", 1000},
	{"开碑裂石", "攻击时２０％几率触发，此次攻击必破防必流血", 1000},
	{"剑发琴音", "攻击时２０％几率触发，全体敌人封穴10时序", 1000},
	{"霹雳狂刀", "攻击时２０％几率触发，全体敌人集气后退２００点", 1000},
	{"兵甲武狂", "攻击时２０％几率触发，全体敌人怒气清零", 1000},
	--{"万妙众生", "攻击时１０％几率触发，马上二次行动", 1000},
	{"逆运经脉", "免疫封穴", 1000},
	{"罡炎霸体", "被攻击时２５％几率发动，所受伤害上限为100", 1000},
	{"天机身法", "被攻击时２０％几率回避", 1000},
	{"祸乱江湖", "攻击时２０％几率触发，攻击全体敌人", 1000},	
	{"天地独尊", "不会被杀集气", 1000},	
	--{"", ""},

}



CC.TFlist = {
	{[0] = 1, "天镇武魂", "拳系武功威力加２０％", 600, ["type"] = 1}, --个人任务：周伯通
	{[0] = 2, "剑御万法", "剑系武功威力加２０％", 600, ["type"] = 1}, --飞狐前代线单挑苗人凤
	{[0] = 3, "魂系一刀", "刀系武功威力加２０％", 600, ["type"] = 1}, --飞狐前代线单挑胡一刀
	{[0] = 4, "幻遁寒星", "特系武功威力加２０％", 600, ["type"] = 1}, --破打狗阵
	{[0] = 5, "悬壶济世", "医疗能力增加２５０ ", 500, ["type"] = 1}, --程灵素为救胡斐而死
	{[0] = 6, "毒煞千阵", "用毒能力增加２５０ ", 500, ["type"] = 1}, --交还金蛇三宝
	{[0] = 7, "时乘六龙", "攻击加２０％", 500, ["type"] = 1}, --个人任务：萧峰
	{[0] = 8, "碧波浩渺", "防御加２０％", 500, ["type"] = 1}, --个人任务：金花婆婆
	{[0] = 9, "虚步凌云", "轻功加２０％", 500, ["type"] = 1}, --飞狐前代邪线杀苗人凤
	{[0] = 10, "法身非相", "内功的气攻气防值加５０％", 700, ["type"] = 1}, --个人任务：枯荣
	{[0] = 11, "武中无相", "招式气攻值加５０％", 600, ["type"] = 1}, --鸠摩智离开
	{[0] = 12, "无我无剑", "战斗开始时满集气 ", 800, ["type"] = 2}, --战胜独孤求败
	{[0] = 13, "殇阳狂血", "战斗开始时满怒气值 ", 800, ["type"] = 2}, --个人任务：段延庆
	{[0] = 14, "悲酥清风", "出战时敌方全体中毒１０点内力减１０００点", 800, ["type"] = 2}, --个人任务：李秋水
	{[0] = 15, "追风逐电", "集气速度加５点", 600, ["type"] = 3}, --个人任务：裘千仞
	{[0] = 16, "乘云游雾", "集气速度加１０点", 1000, ["type"] = 3},	--个人任务：东方不败
	{[0] = 17, "踏雪无痕", "移动时无视敌人包围", 700, ["type"] = 3}, --光明顶密道战成昆
	{[0] = 18, "灵逸佻脱", "移动距离加３格", 600, ["type"] = 3}, --光明顶密道战成昆
	{[0] = 19, "掠影流光", "内伤越重集气速度越快", 700, ["type"] = 3}, --单挑欧阳克
	{[0] = 20, "疏影暗香", "中毒越深集气速度越快 ", 700, ["type"] = 3}, --星宿门派剧情之暗算丁春秋
	{[0] = 21, "疾风迅雷", "攻击时附加１０００点气攻值", 700, ["type"] = 4}, --个人任务：成昆
	{[0] = 22, "上善若水", "被攻击时附加１０００点气防值", 700, ["type"] = 4}, --少林救任盈盈
	{[0] = 23, "孤山北望", "战场上每多一位己方退场自身攻击效果增加５％", 700, ["type"] = 4}, --夏雪宜死亡
	{[0] = 24, "醉武成痴", "每行动一次攻击效果提升５％", 800, ["type"] = 4}, --第一次战胜周伯通
	{[0] = 25, "楚挽沧浪", "战场上每多一位存活的敌方自身攻击效果增加５％", 700, ["type"] = 4},	--鸳鸯刀阿九线
	{[0] = 26, "羿落天阳", "攻击距离越远伤害效果越大", 600, ["type"] = 4}, --郭靖射雕任务
	{[0] = 27, "长生不息", "１０％几率把敌方对己的伤害转化为生命", 900, ["type"] = 4}, --龙女战重阳
	{[0] = 28, "冰肌玉骨", "受到的伤害减１０％", 500, ["type"] = 4}, --苗若兰
	{[0] = 29, "无天若水", "受到的伤害减３０％", 700, ["type"] = 4}, --个人任务：天山童姥
	{[0] = 30, "软红千丈", "攻击造成的伤害加１０％", 500, ["type"] = 4}, --战何铁手
	{[0] = 31, "龙战于野", "攻击造成的伤害加３０％", 700, ["type"] = 4}, --天龙邪单挑乔峰
	{[0] = 32, "四大皆空", "被异性攻击伤害减５０％但不增加怒气", 700, ["type"] = 4}, --加入少林派
	{[0] = 33, "残魂穷魄", "攻击时追加等同敌方内伤程度的伤害", 600, ["type"] = 4}, --个人任务：欧阳锋
	{[0] = 34, "紫气天罗", "攻击时追加等同敌方中毒程度的伤害", 600, ["type"] = 4}, --明霞岛战胜欧阳锋	
	{[0] = 35, "明断天启", "攻击如果造成杀集气效果则杀集气值增加５０％", 700, ["type"] = 4}, --个人任务：王重阳
	{[0] = 36, "七星聚会", "攻击范围内每多一名敌人伤害加３％", 700, ["type"] = 4},	--神雕正过重阳宫
	{[0] = 37, "万相武藏", "选择攻击范围时无视地形限制", 600, ["type"] = 4}, --加入逍遥派	
	{[0] = 38, "暴雨梨花", "攻击时５０％几率杀敌全员生命８０点", 800, ["type"] = 4}, --交还金蛇三宝
	{[0] = 39, "箫韶九成", "攻击时５０％几率杀敌全员内力５００点", 800, ["type"] = 4}, --曲非烟加入
	{[0] = 40, "天霄狂浪", "攻击时５０％几率杀敌全员集气１００点", 800, ["type"] = 4}, --个人任务：文泰来
	{[0] = 41, "风流轻狂", "对异性伤害减１５％，被异性伤害减３０％", 600, ["type"] = 4}, --个人任务：云中鹤
	{[0] = 42, "灭情绝念", "对异性伤害加３０％，被异性伤害加１５％", 600, ["type"] = 4}, --个人任务：灭绝	
	{[0] = 43, "魍魉夜行", "攻击时自身回复等同伤害值１０％的生命", 800, ["type"] = 4}, --个人任务：余沧海	
	{[0] = 44, "白首穷经", "怒气满时内伤清零", 900, ["type"] = 4}, --侠客岛战石龙木	
	{[0] = 45, "松风水月", "自身受到攻击时攻击方的战意和怒气减少", 700, ["type"] = 4}, --郭襄剧情襄阳战胜金轮	
	{[0] = 46, "天无尽藏", "计算自身攻击与防御时无视敌我兵器值系数以增加效果", 700, ["type"] = 4}, --四神挑战 
	{[0] = 47, "绝境凭临", "受伤越大攻击力计算时效果越高", 700, ["type"] = 4}, --个人任务：殷天正
	{[0] = 48, "渊定禅心", "受伤越大防御计算时效果越高", 700, ["type"] = 4}, --个人任务：玄慈	
	{[0] = 49, "玉山孤松", "若敌方攻击时只指定了自身一个目标则伤害减少２０％", 700, ["type"] = 4}, --个人任务：范遥
	{[0] = 50, "乱云飞渡", "被攻击时若该次攻击指定了多个目标则对自身造成的伤害减少２０％", 800, ["type"] = 4}, --个人任务：韦一笑	
	{[0] = 51, "霸者横栏", "攻击效果加５０％，防御效果减５０％", 700, ["type"] = 4}, --个人任务：萧远山
	{[0] = 52, "血沸神狂", "暴击时伤害效果额外增加２５％", 700, ["type"] = 4}, --个人任务：金轮法王
	{[0] = 53, "安禅制龙", "对三围高于自身的敌人攻击伤害加２０％；被三围高于自身的敌人攻击伤害减２０％", 700, ["type"] = 4}, --个人任务：张三丰
	{[0] = 54, "玉碎石焚", "生命值大于５０％时，攻击时失去１０％自身现有生命，追加目标５％最大生命值的伤害", 700, ["type"] = 4}, --个人任务：天门	
	{[0] = 55, "志镂金石", "攻击不破防时伤害加５０％", 700, ["type"] = 4}, --杀狄云	
	{[0] = 56, "瑶台清绝", "内力消耗减２０％", 600, ["type"] = 4}, --凌霜华死亡
	{[0] = 57, "乘龙引玉", "连击时可以带出招式", 600, ["type"] = 4}, --袁冠南加入
	{[0] = 58, "孤阴独阳", "若自身内力非调和且与敌方内力性质相反，则攻击伤害加３０％，被攻击伤害加１５％", 700, ["type"] = 4}, --丽春院战赏罚二使	
	{[0] = 59, "藏离七伤", "攻击时伤害加３０％，如果自身内力比敌方小则自身内伤增加", 700, ["type"] = 4}, --灭崆峒	
	{[0] = 60, "莲花落唱", "每次攻击命中后杀伤内力２００", 600, ["type"] = 4}, --加入丐帮
	{[0] = 61, "赤炼修罗", "每击退一名敌人攻击效果加１０％", 700, ["type"] = 4}, --单挑任我行
	{[0] = 62, "解语忘忧", "行动后战场全员内伤恢复５点，本方生命加５０点", 600, ["type"] = 5}, --主角选择女性
	{[0] = 63, "海棠烛泪", "行动后敌方全体内力减５００点", 700, ["type"] = 5},	--倚天赵敏线打败阿大阿二阿三
	{[0] = 64, "天隐万相", "行动后２０％几率进入隐蔽状态３０时序", 1000, ["type"] = 5}, --四神挑战 
	{[0] = 65, "随遇而安", "行动后进行自动休息", 800, ["type"] = 5}, --个人任务：苏星河
	{[0] = 66, "百草凝魂", "行动后本方全体内力加５００点", 700, ["type"] = 5},	--药王庄小游戏
	{[0] = 67, "壁观真如", "行动前２０％几率自动蓄气", 900, ["type"] = 5}, --四神挑战
	{[0] = 68, "潜龙在渊", "行动后２０％几率自动防御", 900, ["type"] = 5}, --天龙邪单挑乔峰且道德>=80/天龙正结束
	{[0] = 69, "天下布武", "己方全体攻击效果加１５％ ", 700, ["type"] = 6}, --书剑正单挑张召重 
	{[0] = 70, "四海归仁", "己方全体防御效果加１５％ ", 700, ["type"] = 6}, --书剑邪三战红花会
	{[0] = 71, "决胜千里", "己方全体集气效果加１０％ ", 800, ["type"] = 6}, --书剑邪单挑陈家洛
	{[0] = 72, "媚眼如丝", "敌方全体攻击效果减１５％", 700, ["type"] = 6}, --神龙教战洪教主
	{[0] = 73, "倾国倾城", "敌方全体防御效果减１５％ ", 700, ["type"] = 6}, --台湾岛战冯锡范
	{[0] = 74, "奇门遁甲", "敌方全体集气效果减１０％ ", 800, ["type"] = 6},	--个人任务：黄药师
	{[0] = 75, "雁过拔毛", "击退敌人后获得金钱", 500, ["type"] = 11}, --飞狐前代邪线杀阎基
	{[0] = 76, "散魂灭魄", "退场时击退自己的普通敌人也一同退场", 600, ["type"] = 11}, --带着任盈盈/曲非烟整理蔡邕墓	
	{[0] = 77, "刹那芳华", "退场时本方全体战意加３０点", 700, ["type"] = 11}, --喀丝丽加入
	{[0] = 78, "断霞千缕", "每击退一个敌人自身集气加１００点", 700, ["type"] = 11},	--个人任务：无尘
	{[0] = 79, "醉生梦死", "将被击退时暂不退场，５０时序后自动退场", 1000, ["type"] = 11}, --个人任务：慕容博	
	{[0] = 80, "冷月花魂", "退场时敌方全体战意减３０点", 700, ["type"] = 11}, --陆无双剧情
	{[0] = 81, "万里长屠", "敌方每有一人被击退，自身生命加１００内力加２００", 700, ["type"] = 11}, --个人任务：洪安通
	{[0] = 82, "同袍同仇", "己方每有一人被击退，自身生命加２００内力加５００", 700, ["type"] = 11}, --杀江南七怪
	{[0] = 83, "超世正觉", "无视任何复活技能与天赋必定击退敌人", 1200, ["type"] = 11}, --四神挑战	
	{[0] = 84, "玲珑璇玑", "修炼秘籍成功时兵器值成长两倍", 1200, ["type"] = 7}, --何足道的黑白棋游戏
	{[0] = 85, "学究天人", "修炼秘籍成功时三围成长两倍", 1000, ["type"] = 7}, --觉醒前战胜张三丰	
	{[0] = 86, "狂放羁傲", "无视内力属性阴阳需求修炼武功", 1000, ["type"] = 7}, --个人任务：任我行
	{[0] = 87, "执两用中", "无视资质需求修炼武功", 1200, ["type"] = 7}, --30~70资普通/畅想人物觉醒
	{[0] = 88, "百世经纶", "无视除性别外的任何限制条件修炼武功", 1500, ["type"] = 7}, --单挑春风醉
	{[0] = 89, "流风回雪", "轻功对集气速度的影响增加５０％", 900, ["type"] = 7}, --萧中慧加入
	{[0] = 90, "奇经八脉", "可装备两个功体", 1000, ["type"] = 8}, --个人任务：逍遥子
	{[0] = 91, "心无所住", "可用内功攻击", 900, ["type"] = 8}, --天龙正单挑游坦之
	{[0] = 92, "雄才大略", "升级时额外增加３点可分配数", 800, ["type"] = 8}, --单挑郭靖	
	{[0] = 93, "观达知命", "内力硬上限无视资质武功门派必定为一万点", 1100, ["type"] = 8}, --天龙邪战三兄弟
	{[0] = 94, "浮生逍遥", "大地图上的随机奇遇等级上升", 800, ["type"] = 8}, --名声达到50	
	{[0] = 95, "倚天照海", "装备兵器时附加的效果加倍", 700, ["type"] = 8}, --抢倚天剑
	{[0] = 96, "百家穷衣", "装备防具时附加的效果加倍", 700, ["type"] = 8}, --四帮主战	
	{[0] = 97, "妙手空空", "攻击时５０％几率窃取敌人物品一件", 700, ["type"] = 8}, --盗帅
	{[0] = 98, "无欲无名", "左右互搏几率上升４５％", 1000, ["type"] = 9}, --神雕邪线杀龙女
	{[0] = 99, "碧空凌霄", "连击率增加１０％", 600, ["type"] = 9}, --萧雨客
	{[0] = 100, "冯虚御风", "连击率增加２０％", 800, ["type"] = 9}, --个人任务：赵半山
	{[0] = 101, "气贯长虹", "暴击率增加１０％", 600, ["type"] = 9}, --萧雨客
	{[0] = 102, "气侠风雷", "暴击率增加２０％ ", 800, ["type"] = 9}, --杀袁承志
	{[0] = 103, "无如是相", "特效发动率增加１０点", 800, ["type"] = 9}, --仁者剧情
	{[0] = 104, "天纵武才", "攻击时普通招式出招率１００％", 800, ["type"] = 9}, --个人任务：鸠摩智
	{[0] = 105, "井月天星", "功体加力几率１００％", 900, ["type"] = 9}, --金轮加入战胜
	{[0] = 106, "玄元真武", "功体护体几率１００％", 900, ["type"] = 9}, --金轮加入战胜
	{[0] = 107, "九曲连环", "连击率１００％", 1000, ["type"] = 9},	--单挑神秘小二
	{[0] = 108, "云雷奋激", "暴击率１００％", 1000, ["type"] = 9},  --单挑神秘小二
	{[0] = 109, "血海飘香", "攻击造成流血几率１００％", 800, ["type"] = 9},	--个人任务：血刀老祖
	{[0] = 110, "天魅凝阴", "攻击造成冰封几率１００％", 800, ["type"] = 9}, --个人任务：左冷禅
	{[0] = 111, "流火授衣", "攻击造成灼烧几率１００％", 800, ["type"] = 9},	--石中玉加入
	{[0] = 112, "镜花水月", "攻击时几率随机造成异常状态", 1000, ["type"] = 10}, --杀落花流水	
	{[0] = 113, "明心见性", "免疫暴击的额外伤害", 800, ["type"] = 10}, --觉醒前战胜张三丰
	{[0] = 114, "立心天地", "免疫杀气效果", 1200, ["type"] = 10}, --灭少林
	{[0] = 115, "凝元守一", "免疫封穴", 1200, ["type"] = 10}, --个人任务：扫地神僧
	{[0] = 116, "神游太虚", "免疫多次连击的最后一击", 1000, ["type"] = 10}, --挨打10次
	{[0] = 117, "松贞玉刚", "战意不会减少", 700, ["type"] = 10}, --个人任务：萧半和	
	{[0] = 118, "明镜止水", "免疫内伤", 800, ["type"] = 10}, --个人任务：一灯
	{[0] = 119, "悲歌断肠", "被击退时攻击者进入封印状态", 700, ["type"] = 11}, --神雕正线玉女心经剧情
	{[0] = 120, "大风狂歌", "己方有人被击退时自身集气全满", 900, ["type"] = 11}, --华山灭门
	{[0] = 121, "无始无明", "被攻击时自身内力大于敌方则反弹受到的内伤", 700, ["type"] = 4}, --个人任务：无崖子
	{[0] = 122, "固步自封", "攻击效果减５０％，防御效果加５０％", 700, ["type"] = 4}, --光明顶战华山派
	{[0] = 123, "炼神还虚", "时序恢复内力", 800, ["type"] = 8}, --四神挑战
	{[0] = 124, "太和补天", "时序恢复生命", 800, ["type"] = 8}, --夫妻刀法战萧半和
	{[0] = 125, "天威奋烈", "武功威力和消耗内力值均增加５０％", 900, ["type"] = 1}, --个人任务：达尔巴
	{[0] = 126, "换日偷天", "攻击造成敌方内伤时，自身减少等同效果值５０％的内伤", 700, ["type"] = 4}, --四神挑战
	{[0] = 127, "腾蛟起凤", "连击时不减少伤害", 800, ["type"] = 4}, --黑木崖战东方不败
	{[0] = 128, "投木报琼", "被旁人医疗时使医者自身回复医疗效果的５０％", 800, ["type"] = 8}, --医生
	{[0] = 129, "痴者自伤", "生命上限减少１０％，队友对三围的加成加倍", 600, ["type"] = 1}, --李逍遥
	{[0] = 130, "逆水凝霜", "攻击时追加自身前一次受到伤害值的３０％", 700, ["type"] = 4}, --萧秋水
	{[0] = 131, "明德善道", "攻击时不会造成误伤", 800, ["type"] = 4}, --仁者
	{[0] = 132, "无尽无极", "攻击伤害减５０％，被攻击伤害减５０％", 700, ["type"] = 4}, --策士
	{[0] = 133, "残梅遗梦", "自宫后没有集气惩罚", 1000, ["type"] = 8}, --洪教主加入
	{[0] = 134, "明镜非台", "每时序自身封穴，流血，冰封，灼烧，迟缓状态清零", 1000, ["type"] = 10}, --单挑水镜
	{[0] = 135, "风起云涌", "行动后本方全体集气值加１００", 800, ["type"] = 5}, --四神挑战
	{[0] = 136, "梵音清流", "行动后敌方全体集气值减１００", 800, ["type"] = 5}, --四神挑战
	{[0] = 137, "国士无双", "战意增加速度加倍", 800, ["type"] = 8}, --四神挑战
	{[0] = 138, "剑胆成灰", "退场时敌方全体生命减３００点", 700, ["type"] = 11}, --四神挑战
	{[0] = 139, "浮云朝露", "退场时我方全体生命加３００点", 700, ["type"] = 11}, --四神挑战
	{[0] = 140, "浮光掠影", "自身集气速度与场上集气速度最快者持平", 1500, ["type"] = 3}, --四神挑战
	{[0] = 141, "九州一剑", "战斗中自身兵器值视为９９９", 1500, ["type"] = 4}, --华山论剑
	{[0] = 142, "听风辨位", "无视刺目和隐蔽效果", 1500, ["type"] = 4}, --少女和猴子的故事
	{[0] = 143, "心如止水", "时序恢复异常状态（刺目之类）", 1500, ["type"] = 10}, --华山后山，谢无悠
	{[0] = 144, "苦集灭道", "任意武功８０％出极意,与其他极意冲突", 1500, ["type"] = 4}, --天龙正结束获得
    {[0] = 145, "步步为营", "３０％打断敌人攻击", 800, ["type"] = 9},	--挑战独孤求败后获得	
	{[0] = 146, "乌云蔽日", "３０％攻击敌人后致盲", 1500, ["type"] = 4}, --黑木崖战胜东方不败
	{[0] = 147, "回春妙手", "３０％清除内伤并恢复１００点生命值", 800, ["type"] = 9}, --医主
	{[0] = 148, "追命无声", "暗系武功威力加２０％", 600, ["type"] = 1}, --暗主
	{[0] = 149, "釜底抽薪", "被攻击后３０％攻击者集气位置为０", 1500, ["type"] = 3}, --武当山
	{[0] = 150, "雾里看花", "３５％闪避，免疫杀气", 1500, ["type"] = 4}, --宗师阵
	{[0] = 151, "反戈一击", "被攻击后必反击伤害１００点", 800, ["type"] = 5}, --天龙新邪燕子坞慕容复入队
	{[0] = 152, "其疾如风", "恢复集气３５０点", 800, ["type"] = 5}, --华山观武后获得
	{[0] = 153, "其徐如林", "集气速度大于３０点，增加集气速度３０点", 800, ["type"] = 5}, --华山观武后获得
	{[0] = 154, "侵略如火", "必破防，攻击效果提升１００％", 800, ["type"] = 5}, --华山观武后获得
	{[0] = 155, "不动如山", "受到伤害不超过３０点", 800, ["type"] = 5}, --华山观武后获得
	{[0] = 156, "运筹帷幄", "每打败一个敌人增加实战１５点", 600, ["type"] = 7}, --百花谷与老顽童切磋获得
	{[0] = 157, "重门击柝", "攻击时１００％封穴５０点", 800, ["type"] = 9},	--叫欧阳锋爹后获得
	{[0] = 158, "百孔千疮", "攻击时１００％附加内伤２０点", 800, ["type"] = 9},	--领悟九阳神功后获得
	{[0] = 159, "饮鸩止渴", "攻击时１００％附加中毒２０点", 800, ["type"] = 9},	--领悟圣火神功后获得
	{[0] = 160, "止戈为武", "基础杀伤力１０００以下的武功威力视为０", 1000, ["type"] = 8}, --策士初始自带 
	--{[0] = , "", "", },
}
CC.SK = CC.TFlist
CC.SKNum = #CC.SK
CC.SKNumMax = 300

CC.DZ = {
	{[0] = 1, "气盖九州", "战意技可全屏攻击，剑系附加系数气攻", 200, ["type"] = 1}, 
	{[0] = 2, "惊雷撼世", "战意技必封穴，拳系附加系数伤害", 200, ["type"] = 1}, 
	{[0] = 3, "力破天罡", "战意技必破气防，刀系附加系数气攻", 200, ["type"] = 1}, 
	{[0] = 4, "天机蟠龙", "战意技必暴击，特系附加系数伤害", 200, ["type"] = 1}, 
	{[0] = 5, "千手遮天", "战意技必附加不良效果，暗系附加系数气攻 ", 200, ["type"] = 1}, 
	{[0] = 6, "气焰充天", "战意技附加内力伤害 ", 200, ["type"] = 1}, 
	{[0] = 7, "八门回天", "行动后集气恢复1000", 200, ["type"] = 1}, 
	{[0] = 8, "松涛连斩", "战意技第一击发动，增加2次连击", 200, ["type"] = 1}, 
	{[0] = 9, "妖狐狱炎", "战意技攻击化敌人内力为灼烧", 200, ["type"] = 1}, 
	{[0] = 10, "辣手毒心", "战意技攻击根据敌人中毒程度附加伤害", 200, ["type"] = 1},
	{[0] = 11, "极道一击", "战意技攻击附加无视防御的伤害", 200, ["type"] = 1}, 
	{[0] = 12, "毒爆天心", "战意技造成全屏引毒，效果与毒术相关", 200, ["type"] = 1},
	{[0] = 13, "药师仁心", "战意技己方恢复生命，效果与医术相关", 200, ["type"] = 1},
	{[0] = 14, "伤心小箭", "战意技造成全屏引伤，效果与解毒相关", 200, ["type"] = 1},
	{[0] = 15, "刀剑十杀", "觉醒后刀剑各具特效，并可互博依次使用", 200, ["type"] = 1},
}
CC.DZNum = #CC.SK
CC.DZNumMax = 300

for i = 1, #CC.TFlist do
	CC.HZ[i] = {CC.TFlist[i][0], CC.TFlist[i][1], CC.TFlist[i][2], CC.TFlist[i]["type"]}
end

CC.HZNum = #CC.HZ
CC.HZNumMax = 300

CC.SMMENU = {"神兵宝甲", "功体搭配", "外功组合", "神功盖世"}
CC.SB = {
	{"玄铁剑", "与玄铁剑法搭配必爆击"},
	{"倚天剑", "与剑法搭配必流血"},
	{"君子淑女剑", "与剑法搭配增加连击率"},
	{"金蛇剑", "与金蛇剑法搭配追加杀气１００点"},
	{"屠龙刀", "与刀法搭配增加暴击率", "暴击时几率增加气攻值"},
	{"血刀", "与血刀大法搭配吸血"},
	{"冷月宝刀", "与胡家刀法搭配追加杀气１２０点", "与刀法搭配增加冰封几率"},
	{"绿波香露刀", "与刀法搭配必上毒"},
	{"金刀黑剑", "与特系搭配增加连击率"},
	{"打狗棒", "与打狗棒法搭配增加大招和封穴几率"},
	{"伏魔杵", "与特系搭配增加暴击率"},
	{"软蝟甲", "反弹部分拳系攻击伤害，减低其他系的伤害"},
	{"乌蚕衣", "减轻内伤值"},
	{"金丝背心", "减轻封穴值"},
	{"鳄皮护甲", "减轻中毒值"},
	{"佛心甲", "减轻流血值"},
	{"皮衣", "减轻迟缓，冰封，灼烧值"},
	{"白马", "增加集气速度五点"},
	{"真武剑", "与太极剑法搭配必爆击", "与其他剑法搭配增加连击率"},
	{"金蜈钩", "与拳系搭配必上毒"},
	{"玄铁指环", "与拳法搭配增加暴击率"},
	{"逍遥神仙环", "与拳法搭配增加封穴率"},
	{"白雕", "增加集气速度三点"},
	{"闯王宝刀", "与刀法搭配增加灼烧值"},
	{"鸳鸯宝刀", "与刀法搭配增加连击率"},
	{"西毒蛇杖", "与特系搭配必上毒"},
	{"霹雳狂刀", "与霹雳刀法搭配２０％杀全体敌人集气２００点"}, --武骧金星：追加说明
	{"火枪", "与火枪连射搭配对方无法使用内功护体"},

}
CC.GT = {
	{89, "紫霞神功", "普通特效", "行动后恢复已消耗内力值的１０％；低几率时序减少受伤程度；剑系武功的威力增加１０％",  "", "主功体特效", "行动后恢复已消耗内力值的２０％；几率时序减少受伤程度；剑系武功的威力增加１５％", "", "武功搭配", "五岳剑法 增加杀气，几率增加范围"},
	{90, "混元功", "普通特效", "行动后减少受伤程度以及恢复体力３点内力５０点",  "", "主功体特效", "行动后减少受伤程度以及恢复体力１０点内力２５０点；几率时序恢复体力",  "", "（生命归０时使用体力代替伤害，每次３０体力，时序恢复１点体力，攻击时不消耗体力，几率触发--混元一气·气海无量）","", "武功搭配"},
	{152, "天南易阳决", "普通特效", "攻击几率造成封穴；攻击时造成的灼烧效果增强；暗系武功的威力增加１０％",  "", "主功体特效", "攻击几率造成封穴；攻击时造成的封穴以及灼烧效果增强；时序减少冰封值；暗系武功的威力增加１５％", "", "武功搭配"},
	{92, "狮子吼", "普通特效", "攻击时低几率出狮子吼减少全体敌人少量集气值；战意提升速度增加２０％", "", "主功体特效", "攻击时高几率出狮子吼减少全体敌人集气值以及几率造成迟缓；战意提升速度增加５０％", "", "武功搭配"},
	{93, "圣火神功", "普通特效", "初始集气增加２００点；行动后如果没有移动过则可移动；移动范围加１格；集气速度加１点；刀系武功的威力增加１０％",  "", "主功体特效", "初始集气增加５００点；行动后可以再次移动；移动范围加１格；集气速度加３点；刀系武功的威力增加１５％","","武功搭配"},
	{124, "寒冰真气", "普通特效", "免疫冰封；免疫北冥与吸星的内力吸取；攻击时几率造成冰封",  "", "主功体特效", "免疫冰封；免疫北冥与吸星的内力吸取；攻击时高几率造成冰封；时序恢复灼烧值", "", "武功搭配", "万岳朝宗 功体加力时必冰封"},
	{150, "金关玉锁诀", "普通特效", "集气速度加１点；攻击时造成的杀气值增加１５％；体力消耗减少２点；拳系武功的威力增加１０％", "", "主功体特效", "集气速度加２点；攻击时造成的杀气值增加３０％；体力消耗减少４点；拳系武功的威力增加１５％",  "", "武功搭配"},	
	{94, "神照功", "普通特效", "第一次退场时必复活一次，恢复生命值至５０％；有５％几率再次复活",  "", "主功体特效", "第一次退场时满状态必复活一次；有１０％几率再次复活", "", "武功搭配", "血刀大法 吸血效果加５％"},
	{95, "蛤蟆功", "普通特效", "怒气提升速度增加１０％；被攻击时几率进行蓄力，达到一定程度时出蟾震九天大幅度提升气攻以及追加中毒", "", "主功体特效", "怒气提升速度增加３０％；被攻击时高几率进行蓄力，蟾震九天的效果大幅度提升", "", "武功搭配"},
	{96, "罗汉伏魔功", "普通特效", "行动后恢复已消耗生命值的１０％；低几率时序减少流血值；特系武功的威力增加１０％",  "", "主功体特效", "行动后恢复已消耗生命值的２０％；几率时序减少流血值；特系武功的威力增加１５％", "", "（几率触发特效罗汉伏魔，几率随资质降低而增加）", "", "武功搭配", "龙爪功 攻击时２５％几率造成缠足状态"},
	{97, "乾坤大挪移", "普通特效", "几率反弹受到伤害的３０％；被攻击时造成的受伤程度减少１０％",  "", "主功体特效", "高几率反弹受到伤害的３０％；被攻击时造成的受伤程度减少３０％；被杀气时集气值不会减至负３００以下", "", "武功搭配", "鹰爪功 攻击时２５％几率造成缠足状态"},
	{98, "小无相功", "普通特效", "修炼武功的兵器需求值减少１０点；体力消耗减少２点；可用小无相功攻击",  "", "主功体特效", "修炼武功的兵器需求值减少１０点；体力消耗减少４点；普通招式出招率增加３０％；集气速度增加３点", "", "武功搭配"},
	{151, "金刚不坏诀", "普通特效", "受到的伤害值减少１０％（１５％）；被攻击时造成的杀气值减少１５％（２５％）", "", "主功体特效", "受到的伤害值减少１５％（３０％）；被攻击时造成的杀气值减少３０％（４０％）；被封穴时的效果减５０％", "", "（免疫内伤和暴击的额外伤害，主运额外减伤３０点，被动减伤２０点）", "", "武功搭配"},	
	{153, "临济十二庄", "普通特效", "暴击率加１０％；被连击时降低伤害", "", "主功体特效", "暴击率加２０％；被连击时降低伤害；集气速度加２点", "", "武功搭配"},	
	{99, "纯阳无极功", "普通特效", "内力消耗减少２５％；几率时序减少中毒程度和迟缓值",  "", "主功体特效", "内力消耗减少５０％；时序减少中毒程度，迟缓值和冰封值；行动后减少受伤程度１０点", "", "武功搭配", "神门十三剑 攻击时１５％几率造成封印状态"},
	{100, "先天功", "普通特效", "被攻击时造成的受伤程度减少２５％；高几率时序恢复生命和内力值",  "", "主功体特效", "被攻击时造成的受伤程度减少５０％；时序恢复生命和内力值；被杀气时集气值如果达到负５００时清除所有内伤" , "（主运生命６０％以上增加攻防效果２０％，被动效果１０％，死亡可先天重生，回血回内效果增加）", "", "武功搭配"},
	{101, "八荒六合功", "普通特效", "免疫普通伤害造成的杀气值；防御状态下增加气防值１０００点以及减少伤害３０％",  "", "主功体特效", "免疫普通伤害造成的杀气值；防御状态下增加气防值１５００点以及减少伤害５０％；非防御状态下增加气防值８００点；集气速度增加２点", "", "武功搭配"},
	{102, "太玄神功", "普通特效", "特效几率上升１０点，集气速度加２点，攻击造成的怒气减３０％",  "", "主功体特效", "特效几率上升２０点，集气速度加４点，攻击造成的怒气减６０％", "", "武功搭配"},
	{121, "玉女心经", "普通特效", "限制女性；集气速度加２点；连击率加１０％", "", "主功体特效", "集气速度加５点；连击率加１５％；体力消耗减少２点", "", "武功搭配"},	
	{103, "龙象般若功", "普通特效", "普通伤害可造成杀气，蓄力状态下增加气攻值１０００点以及增加伤害３０％ ",  "", "主功体特效", "普通伤害可造成杀气，怒气提升速度增加１５％；蓄力状态下增加气攻值１０００点和伤害５０％并一定造成迟缓","","（主运攻击几率触发一至十层龙象之力，每层龙象之力增加１０％伤害，资质５０及以下随机一至五，资质５０以上随机六至十）", "", "武功搭配"},
	{104, "逆运真经", "普通特效", "免疫封穴状态，几率进入走火入魔状态造成无法操作，集气絮乱并且伤害、暴击率、连击率上升", "", "主功体特效", "免疫封穴状态；走火入魔时可以操作，习有九阴神功时不走火入魔且集气速度加２点；暴击造成的伤害加２５％",  "", "（免疫走火，集气随机1-2倍变化）","", "武功搭配"},
	{105, "葵花神功", "普通特效", "集气速度加３点，被攻击时１５％几率出现葵花移行减少杀气和伤害",  "", "主功体特效", "３０％几率出葵花移行；集气速度加８点；体力消耗减少５点；攻击时１０％几率造成盲目状态", "", "（无视自宫修炼葵花神功，辟邪剑法，葵花神针）", "", "武功搭配", "辟邪剑法 攻击时６０％几率造成盲目状态", "葵花神针 攻击时５０％几率造成盲目状态"},
	{106, "九阳神功", "普通特效", "被攻击时伤害减少１０％，时序恢复内力和减少冰封值",  "", "主功体特效", "需阳性内力；被攻击时伤害减少３０％，时序恢复内力，减少冰封值和受伤程度；被封穴时９时序后必定解穴", "", "武功搭配"},
	{107, "九阴神功", "普通特效", "攻击时伤害增加１０％，时序恢复生命和减少灼烧值",  "", "主功体特效", "需阴性内力；攻击时伤害增加３０％；时序恢复生命，减少灼烧值、流血值、封穴值", "", "武功搭配"},
	{108, "易筋神功", "普通特效", "内力硬上限增加７５０点；时序减少封穴、流血、迟缓、冰封、灼烧、受伤程度",  "", "主功体特效", "内力硬上限增加７５０点；时序减少封穴、流血、迟缓、冰封、灼烧、受伤程度；免疫中毒；体力消耗减少５点", "","（可使用指令洗髓，随时调整自身资质）","", "武功搭配"},
	{6, "碧海潮生功", "普通特效", "攻击时造成的内伤增加３０％，低几率出碧海潮生曲减少全体敌人战意",  "", "主功体特效", "攻击时造成的内伤增加６０％，几率出碧海潮生曲减少全体敌人战意，集气速度加２点", "", "武功搭配"},
	{178, "擒龙功", "普通特效", "战意提升速度增加３０％；被攻击时战意不会减少",  "", "主功体特效", "战意提升速度增加６０％；被攻击时战意增加１点；暴击率增加１０％", "", "武功搭配"},
	{43, "斗转星移", "", "特殊内功", "限五系总合大于１８０；被攻击时几率以同样的招式还击；五系值总合越大效果越高：２８０点以下出北斗移辰，２８０－３９０点出斗转星移，３９０点以上出离合参商"},
	{85, "北冥神功", "", "特殊内功", "内力硬上限增加７５０点；攻击时４０％几率吸取敌人内力；被攻击时４０％几率增加气防值８００点（几率出海纳百川吸取敌人内力最大值１０％的内力，增加内力硬上限２５００）"},
	{88, "吸星大法", "", "特殊内功", "攻击时４０％几率吸取敌人内力和体力"},
	{87, "化功大法", "", "特殊内功", "攻击时４０％几率化去敌人内力以及增加中毒程度"},
	{115, "梯云纵横", "", "轻功特效", "集气速度加５点；被攻击时几率减少杀气值５０％，习有纯阳无极功则减少杀气值７０％"},
	{116, "飞天神行", "", "轻功特效", "集气速度加５点；被攻击时几率减少伤害２５％"},
	{117, "神行百变", "", "轻功特效", "集气速度加５点；被攻击时几率把杀气值转化为集气值"},
	{118, "瞬息千里", "", "轻功特效", "集气速度加５点；内伤越高集气速度越快"},
	{119, "天罗地网", "", "轻功特效", "集气速度加５点；行动后恢复集气值，轻功越高恢复越多"},
	{143, "一苇渡江", "", "轻功特效", "集气速度加５点；免疫迟缓"},
	{179, "凌波微步", "", "轻功特效", "集气速度加５点；几率闪避"},
	{180, "太虚剑意", "普通特效","剑系武功破防加４％；每６点轻功值增加１点伤害；剑系武功攻击范围加２",  "", "主功体特效", "剑系武功破防加８％；每４点轻功值增加１点伤害；剑系武功攻击范围加３","", "武功搭配"},
	{181, "玄武真功", "普通特效","攻击时伤害增加１０％；被攻击时伤害减少１０％；各系武功破防加４％；每６点攻击力增加１点伤害",  "", "主功体特效", "攻击时伤害增加３０％；被攻击时伤害减少３０％"},
	{182, "太极神功", "普通特效","拳、刀系武功破防加４％；每６点轻功值增加１点伤害；免疫乾坤反弹（乾坤领悟无视）","","主功体特效", "自动防御，几率进入蓄力状态，蓄力成功后攻击必连，增加５０％伤害，几率断连"},
	{183, "洗髓神功", "普通特效","特、暗系武功破防加４％；每６点轻功值增加１点伤害；时序清内伤、清毒","","主功体特效", "伤害不会大于６００点，并减伤１００点"},
	{184, "瑜伽神功", "普通特效","时序清毒，体力和内力消耗减少，消除迟缓、流血、冰封、灼烧","","主功体特效", "伤害减少３００点，免疫暴击的额外伤害"},
	{185, "武当九阳功", "普通特效","集气速度增加１点，暴击增加３０，２０时序解除封穴","","主功体特效", "集气速度增加３点，暴击增加５０，１０时序解除封穴"},
	{186, "峨眉九阳功", "普通特效","战意增加３点，连击增加２０，３０％时序涨怒１点","","主功体特效", "战意增加５点，连击增加３０，３０％时序涨怒２点"},
	{187, "少林九阳功", "普通特效","内伤减２５％，时序恢复１点流血","","主功体特效", "内伤减５０％，时序恢复２点流血"},
	{188, "神足经", "普通特效","恢复生命、内力１０％，恢复体力１点","","主功体特效", "恢复生命、内力２０％，恢复体力２点"},
	{189, "阴阳磨", "效果太多，请自行看更新说明"},--"普通特效","恢复生命、内力１０％，恢复体力１点","","主功体特效", "恢复生命、内力２０％，恢复体力２点"},
	{190, "流云逐月", "", "轻功特效", "当自身集气速度并非场上最快时；集气速度增加１５点"},
	{191, "追命无影", "", "轻功特效", "流血影响降低；流血回复速度下降；并依照敌我流血值加成自身伤害和杀气"},
	{192, "金雁功", "", "轻功特效", "依照自身内力增加移动格数；并且无视内伤带来的移动格数下降效果"},
	{193, "旋风扫叶腿", "", "轻功特效", "时序清除缠足；羁绊效果；加快定身；蛊毒的清除"},
	{194, "暗影迷踪", "", "轻功特效", "被攻击时机率进入隐蔽状态１５时序（不可叠加）"},
	{195, "踏雪无痕", "", "被攻击时机率以自身轻功值加成防御力计算"},
	{196, "暗香疏影", "", "被攻击时机率反弹对方异常状态"},
	{197, "逍遥游身法", "", "食用任何物品效果加成５０％"},
}


CC.WG = {
	{"太极奥义", "武功需求", "太极拳", "太极剑", "", "被攻击时几率免杀气，免疫乾坤反弹", "资质越高几率越大"},
	{"刀剑归真", "武功需求", "苗家剑法", "胡家刀法", "", "以其中之一攻击时几率大幅度增加气攻和伤害"},
	{"玄阴烈阳", "武功需求", "玄冥神掌", "火焰刀法", "", "以玄冥神掌攻击几率造成内伤以及增加伤害", "以火焰刀法攻击几率造成中毒以及增加伤害"},
	{"慈悲六道", "武功需求", "须弥山神掌", "伏魔杖法", "", "以其中之一攻击时高几率暴击", "如同时练有易筋经则几率增加气防值"},
	{"五岳剑法", "武功需求", "万花剑法", "泰山十八盘", "云雾十三式", "万岳朝宗", "太岳三青峰", "", "随机产生封穴，流血，内伤，迟缓，连击的效果", "增加气攻值和威力", "与紫霞神功搭配增加攻击范围"},
	{"琴箫和鸣", "武功需求", "玉箫剑法", "持瑶琴", "", "攻击时几率恢复全场己方生命50点", "曲非烟使用可以恢复体力3点"},
	{"琴棋书画", "武功需求", "持瑶琴", "棋盘招式", "裴将军帖", "泼墨披麻剑", "", "使用持瑶琴几率杀怒气", "使用棋盘招式几率杀体力", "使用裴将军帖几率封穴", "使用泼墨披麻剑几率冰封", "使用以上任一武功气攻值增加"},
	{"桃花极意", "武功需求", "落英神剑掌", "弹指神通", "玉箫剑法", "", "使用落英神剑掌几率迟缓", "使用弹指神通几率封穴", "使用玉箫剑法几率减少敌人内力", "使用以上任一武功伤害加１０％，几率三连击"},
	{"双剑合璧", "武功需求", "全真剑法", "玉女剑法", "左右互搏之术", "", "出左右互搏时依次使用两种剑法攻击追加气攻值", "减少敌人体力，不加怒气值"},
	{"正反两仪", "武功需求", "两仪剑法", "反两仪刀法", "", "使用两仪剑法附加刀法系数一半的伤害", "使用反两仪刀法附加剑法系数一半的伤害", "以其中之一攻击时高几率造成迟缓"},
	{"金乌映雪", "武功需求", "金乌刀法", "雪山剑法", "", "使用金乌刀法高几率灼烧", "使用雪山剑法高几率冰封"},
	--{"古墓极意", "武功需求", "天罗地网势", "银索金铃", "玉女剑法", "玉女心经", "", "使用天罗地网势高几率迟缓", "使用银索金铃高几率封穴", "使用玉女剑法高几率内伤"},
	{"森罗万象", "武功需求", "九阳神功", "九阴神功", "", "免疫暴击的额外伤害"},
	{"白罗灭精", "武功需求", "易筋神功", "吸星大法", "易筋神功为主功体", "", "被攻击时吸收敌人生命并增加气防值", "几率与实战相关"},
	{"万流归宗", "武功需求", "九阳神功", "北冥神功", "九阳神功为主功体", "", "被攻击时吸收敌人内力并增加气防值", "几率与实战相关"},
	{"阴邪逆转", "武功需求", "九阴神功", "化功大法", "九阴神功为主功体", "", "被攻击时使敌人中毒并吸取体力", "几率与实战相关"},
	{"逍遥御风", "武功需求", "八荒六合功", "小无相功", "北冥神功", "", "被攻击时增加集气速度", "几率与实战相关"},
	{"丐世无双", "武功需求", "降龙十八掌", "打狗棒法", "", "使用其中一种武功攻击几率追加另一种武功攻击"},
	{"八荒八灭", "武功需求", "八荒六合功", "生死符或者天山六阳掌", "", "使用天山六阳掌或者生死符攻击时几率触发八荒八灭，","同时中了八荒八灭则会每隔一段时间集气错乱"},
	{"凌波缥缈", "武功需求", "凌波微步", "北冥神功", "", "根据移动距离回复内力"},
    {"炼虚化神", "武功需求", "神照经", "先天功", "", "被攻击时回复一定生命", "同时减少内伤与中毒"},
	{"返璞归真", "武功需求", "太玄神功", "左右互搏之术", "", "主运太玄被攻击时几率减伤同时回复内力", "几率随资质降低而提高"},
	--{"降龙伏虎", "武功需求", "", "", "", "", ""},
	--{"长生未散", "武功需求", "", "", "", "", ""},
}

CC.STATUS = {
	{"鼓舞", "攻击力上升", 4376},
	{"破兵", "攻击力下降", 4377},
	{"钢体", "防御力上升", 4378},
	{"碎甲", "防御力下降", 4379},
	{"神行", "集气值上升", 4380},
	{"羁绊", "集气值下降", 4381},
	{"补益", "时序恢复生命和内伤", 4382},
	{"毒击", "时序失去生命以及增加中毒值", 4383},
	{"盲目", "下回合攻击无法命中", 4384},
	{"封印", "下回合无法进行攻击", 4387},
	{"缠足", "无法进行移动", 4386},
	{"定身", "集气值为零", 4391},
	{"混乱", "不分敌我攻击", 4385},	
	{"魅惑", "敌我身份转换", 4389},
	{"隐蔽", "受到的攻击等同为误伤，进行攻击则解除", 4388},
	{"蛊毒", "行动后集气从负值算起", 4397},
	{"冰心", "怒气无法增长", 4398},
}

CC.WXZL = {
	{"先机", "使用需求", "学有独孤九剑,传承独孤求败衣钵", "", "敌方目标集气超过980时，自身立刻行动"},
	{"洗髓", "使用需求", "学有易筋神功,打败任务扫地僧领悟", "", "随意调整自身资质"},
	{"幻化", "使用需求", "学有小无相功打败任务逍遥子领悟", "", "每场战斗可使用一次，暂时领悟其他可领悟的武学"},
	{"金刚", "使用需求", "学有金刚不坏打败达摩领悟", "", "两回合内减伤80点"},
	{"龙象", "使用需求", "学有龙象般若功金轮传郭襄武学时领悟", "", "三回合内自动蓄力，攻击必定触发龙象之力（龙象之力需主运）"},
	{"涅槃", "使用需求", "笑傲邪线获得葵花宝典领悟", "", "男：攻击效果增加30%","","女：场上敌方目标行动时几率休息，几率葵花魅影闪避","","阴阳：集气速度增加30%（无集气惩罚）（白马邪的可以几率出葵花诡影几率闪避；几率高于葵花魅影）","","葵花百劫：几率全屏刺目"},
	{"北冥", "使用需求", "027或者学有北冥神功灵鹫宫入口处领悟", "", "海纳百川：吸取所有敌方目标15%最大生命最大内力和体力，每场战斗限定一次", "", "化为己用：吸收目标主功体效果，使得自身过得对方主功体效果，对方将失去主功体效果（如果换目标，原目标将会恢复）"},
	{"狮吼", "使用需求", "学有狮吼功明教拿天书时领悟", "", "所有敌方目标满内伤，晕眩20时序，每场战斗限定一次，随后出狮吼功强制内伤15点"},
	{"逆运", "使用需求", "射雕邪线不带杨过叫欧阳锋爸爸领悟","", "被攻击几率直接暴怒，集气进入走火状态可控"},
	{"先天", "使用需求", "学有先天功重阳宫正拿书时领悟", "", "重生前开启武功威力增加50%，重生后攻防效果增加30%；重生后开启重置重生一次"},
	{"互搏", "使用需求", "学有左右百花谷第一次打败周伯通领悟", "", "三回合内必定左右，左右必定连击，无法被连击，双武功组合必出特效"},
	--{"古墓极意", "武功需求", "天罗地网势", "银索金铃", "玉女剑法", "玉女心经", "", "使用天罗地网势高几率迟缓", "使用银索金铃高几率封穴", "使用玉女剑法高几率内伤"},
	{"罗汉", "武功需求", "学有罗汉伏魔打败少林练功弟子慧聪领悟", "", "敌方全体攻防集气效果降低15%，自身被攻击战意不减"},
	{"圣火", "武功需求", "赵敏线拿到秘籍领悟", "", "暗尘弥散：隐身50时序", "业海罪缚：目标集气速度降低50%，持续80时序", "怖畏暗邢：目标伤害降低50%，持续两回合", "极乐引：自身6格范围内敌方无法移动", "怖畏暗邢：目标伤害降低50%，持续两回合", "贪魔体：自身无法攻击且受到的伤害降低80，持续两回合", "幻光步：移动至10格范围内任意地点"},
	--{"炼虚化神", "武功需求", "", "", "", "", ""},
	{"神照", "武功需求", "凌霜华不死线", "", "重生：可以两次指定复活队友或者自身", "", "续命：指定敌方目标，我方生命不满，则敌方目标时序15点生命为我方续命"},
	{"潮音", "武功需求", "任务挑战黄药师", "", "碧海潮生曲：所有敌方单位攻防轻进入负波动状态，我方单位进入正波动状态"},
	{"化功", "武功需求", "不入星宿派杀死丁春秋", "", "散功：指定目标某个内功，使其失去被动效果"},
	{"吸星", "武功需求", "笑傲邪线走任我行线", "", "万象吸引：时序吸收自身10格范围内的敌人内力10点，如果敌方处于流血状态降时序掉血5点"},
	{"混元", "武功需求", "5本天书买秘籍", "", "混元一气：攻击必出招式，招式杀气翻倍，学有神行百变时，被攻击必定触发神行百变，时序耗体力2点"},
	{"冰封", "武功需求", "任务挑战左冷禅", "", "寒冰气场：自身8格范围内敌方集气降低30%，时序冰封，自身时序消耗15点内力"},
	--{"返璞归真", "武功需求", "", "", "", "", ""},
	--{"降龙伏虎", "武功需求", "", "", "", "", ""},
	--{"长生未散", "武功需求", "", "", "", "", ""},
}

CC.SG = {
	{"", ""},
	{"", ""},
	{"", ""},
	{"", ""},
	{"", ""},
	{"", ""},
	{"", ""},
	{"", ""},
	{"", ""},
	{"", ""},
	{"", ""},
	{"", ""},
	{"", ""},
	{"", ""},		
}

--战斗快捷键提示
--CC.EVB117 = "A攻击 D防御 P蓄力 E物品 F医疗 V用毒 R休息 T指令 Z状态"
CC.EVB117 = "A攻击 D防御 P蓄力 E物品 F医疗 V用毒 R休息 Z状态 W待机" --武骧金星：增加待机

--大地图快捷键提示
CC.EVB119 = "F1：传送 F2：走速 F3：队列 F4：物品 F5：全屏 F6：音乐 H:回家"
 --dofile (CONFIG.ScriptPath .."ZP.lua");
 
CC.DYRW = -1
CC.DYRW2 = -1

CC.AddEnemy = {
	{9, 798, 799, 800, 801, 802, 803, 804, 805, 806, 807},
	{11, 818, 819, 820, 821, 822, 823, 824, 825, 826, 827},
	{12, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817},
	{21, 788, 789, 790, 791, 792, 793, 794, 795, 796, 797},
	{24, 843, 844, 845, 846, 847},
	{26, 921, 922, 923, 919, 920},
	{28, 833, 834, 835, 836, 837},
	{38, 909, 910, 911, 912, 913},
	{63, 896, 897, 889, 890, 891, 892, 893, 894, 895},
	{71, 742, 743, 744, 745, 746, 747, 748},
	{72, 742, 743, 744, 745, 746, 747, 748},
	{73, 753, 754, 755, 756, 757, 758},
	{84, 732, 733, 734, 735, 736, 737},
	{86, 722, 723, 724, 725, 726, 727, 728},
	{91, 902, 903, 904, 905, 716, 717, 718},
	{95, 853, 854, 855, 856, 857},
	{98, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688},
	{146, 798, 799, 800, 801, 802, 803, 804, 805, 806, 807},
	{147, 818, 819, 820, 821, 822, 823, 824, 825, 826, 827},
	{148, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817},	
	{152, 811, 812, 813, 814, 815, 816, 817},
	{155, 801, 802, 803, 804, 805, 806, 807},
	{162, 682, 683, 684, 685, 686, 687, 688},
	{163, 682, 683, 684, 685, 686, 687, 688},
	{176, 868, 869, 870, 871, 872, 873, 874, 875, 876},
	{207, 913, 914, 915, 909, 910, 911, 912},
	{240, 887, 878, 879, 880, 881, 882, 883, 884, 885, 886},
	{257, 851, 852, 853, 854, 855, 856, 857},
}

