dofile ".\\script\\nino_MP_event.lua"; --nino门派剧情
dofile ".\\script\\nino_quest_event.lua"; --nino奇遇+任务
--dofile ".\\script\\nino_gambling_event.lua"; --赌博
--dofile ".\\script\\nino_emblem_event.lua"; --勋章
--dofile ".\\script\\change_zhujue.lua"; 

--[[LDCR - 2000-2005
OEVENT - 2006, 8001-8017, 8201-8208, 8301-8306, 8601-8615, 8650-8652
ninoevent - 9999, 10000, 10001-10019, 10020-10024 郭襄支线，20000-20011 离队 5000-5008 新增事件
tjm_event - 5009 -6000
newevent - 1300 and so on
free to use: 3000-4999]]

function openplace(s)
	JY.Scene[s]["进入条件"] = 0
end

function closeplace(s)
	JY.Scene[s]["进入条件"] = 1
end

function null(sid, pid)
	addevent(sid, pid, 0, 0, 0, 0)
end

function bgtalk(str)
	TalkEx(str, 0, 2)
end

function daode(a)
	AddPersonAttrib(zj(), "品德", a)
end

function teammate(a)
	if not instruct_20() then		
		instruct_10(a)
		dark()
		null(-2, -2)
		light()
	else
		say("你的队伍已满，我就回小村等你吧。", a)
		dark()
		null(-2, -2)
		setteam(a)
		light()
	end		
end

function dowar(a)
	if WarMain(a) == false then
		instruct_15()
		do return end
	end		
end

OEVENTLUA[1300] = function() --飞狐前代线
	addevent(-2, 2, 1, 666, 1)
	addevent(-2, 3, 1, 666, 1)
	null(3, 17)
	null(0, 4)
	addevent(108,50,0)
	addevent(108,51,0)
	--closeplace(0)
	say("听说金面佛苗人凤与辽东大侠胡一刀过几天就要进行决斗。",201,0,"酒客") 	
	say("此话当真？这等高手间的比武，一定要去见识一下才行。不知决斗地点在哪里？",203,0,"酒客") 
	say("就在东北边的玉笔山庄。",201,0,"酒客") 
	say("好，等喝完这杯酒我们就上路！",203,0,"酒客") 
	say("好，干！",201,0,"酒客") 
	addevent(108,-2,0,1301,3,-2,44,21)--addevent(108, 12, 0, 1301, 3)
	addevent(108, 13, 0, 0, 0, 4686*2)
	addevent(108, 14, 0, 0, 0, 4687*2)
end

OEVENTLUA[1301] = function()
	null(-2, -2)
	dark()
	light()
	instruct_25(44,21,44,12)
	say("好刀法！", 3)
	say("好剑法！", 621)
	say("咱们再来！", 3)
	say("（这两人武功好俊，使刀的如猛虎下山，使剑的似凤凰飞舞，只是一刚一柔，各擅胜场，看来谁也胜不了谁。）")
	say("苗兄，经过这四天的切磋，你我的武功相互都已了然於胸。这样吧，我使苗家剑法，你使胡家刀法，咱俩再决胜负。不论谁胜谁败，都不损了威名。", 621)
	say("好主意！", 3)
	dark()
	addevent(108, 14, 0, 0, 0, 2720*2)
	light()
	say("啊！", 621)	
	say("啊！", 3)	
	TalkEx("只见两人酣战之中突然分开，胡一刀的左臂被划了一个口子，苗人凤却被踢中了腰间的京门穴。",0,2)	
	say("胡兄，我出刀时固然略有容让，但即令砍下你的左臂，你这一腿仍能致我死命。这场比试是你赢了。", 3)	
	say("咦....胡兄？", 3)
	say("（不对！看胡一刀脸颊深紫，分明是中了剧毒！我要上前帮忙吗？）")
	if yesno("要帮忙吗？") then
		daode(2)
		say("苗大侠别慌，待我来看看。")
		My_Enter_SubScene(108, 44 ,12 ,0)
		say("原来这刀上抹了毒....幸好伤口不深，还有救！")
		dark()
		addevent(108, 15, 0, 0, 0, 7012)
		light()
		say("臭小子，坏我好事！", 72)
		if WarMain(306) == false then
			instruct_15(0);   
			instruct_0();  
			do return; end			
		end			
		addevent(108, 15, 0, 0, 0, 0)
		light()		
		say("原来是那个小人在搞鬼！这位少侠，胡兄就拜托你照顾了！", 3)
		dark()
		addevent(108, 13, 0, 0, 0, 0)
		addevent(108, 16, 1, 1303, 1, 2583*2)
		light()
		say("（胡大侠余毒未清，还是快点把他送到客栈休息吧。）")
		My_Enter_SubScene(108, 41 ,33, 0)
		addevent(108, 14, 0, 0, 0, 0)		
		say("胡大侠感觉怎么样？")
		say("这次多亏了小兄弟你出手相助，胡某才不至于丧于奸人之手。", 621)
		say("胡大侠客气了，可惜我医术不精，未能根除余毒....不过我看这毒似乎是药王庄一脉的，请胡大侠安心在此疗伤，等我去药王庄求得解药。")
		say("好，那就有劳小兄弟了。", 621)
		addevent(49, 5, 1, 1302, 1, 4645*2)
	else
		daode(-2)
		dark()
		addevent(108, 15, 0, 0, 0, 7012)
		light()
		say("恭喜苗兄手刃大敌。", 72)
		say("田归农！是你搞的鬼？", 3)
		say("做大事者不拘小节，这胡一刀武功高强，如果不动点手脚怎么能报我们祖上之仇。", 72)
		say("我和胡兄的比武原本光明正大，你竟然下毒害了他，苗某一时不察害了胡兄性命。田归农，我如今就要拿你祭奠英灵！", 3)
		say("苗兄，请冷静一下！", 72)
		say("哪里走！", 3)	
		dark()
		null(-2, 13)
		null(-2, 15)
		light()
		say("怎么都走了，待我上前看看胡一刀有没有值钱的遗物....")
		My_Enter_SubScene(108, 44, 12, 0)
		say("有了，有把好刀，还有几本书。")
		addthing(45, 1)
		addthing(239, 1)
		addthing(136, 1)
		dark()
		addevent(108, 15, 0, 0, 0, 2584*2)
		null(-2, 14)
		light()
		say("小子，把东西交出来！", 4)
		local aa = 4
		JY.Person[aa]["生命"] = 700
		JY.Person[aa]["生命最大值"] = 700
		JY.Person[aa]["内力"] = 3000
		JY.Person[aa]["内力最大值"] = 3000
		JY.Person[aa]["攻击力"] = 300
		JY.Person[aa]["防御力"] = 250
		JY.Person[aa]["轻功"] = 200
		JY.Person[aa]["受伤程度"] = 0
		JY.Person[aa]["中毒程度"] = 0
		JY.Person[aa]["武功等级1"] = 200		
		if WarMain(307) == false then
			instruct_15(0);   
			instruct_0();  
			do return; end			
		end			
		addevent(108, 15, 0, 0, 0, 0)
		addevent(3, 17, 1, 1312, 1, 7012)
		light()		
		addthing(136, -1)
		say("啊，那本刀法被抢走了！可恶....")
		say("听说胡家后人掌握着一个宝藏的关键，现在胡一刀已死，也不知道还有没有人知道这个宝藏的下落。我不如去找找那位田相公吧。")
	end
end

OEVENTLUA[1302] = function()
	say("这位姑娘，请问这里是药王庄吗？")	
	say("你到药王庄去干吗？", 2)
	say("我有位朋友中了毒，我们特地来求药王赐些解药，请姑娘指点途径。")	
	say("你到那边粪池去装小半桶粪，到溪里加满清水，帮我把这块花浇一浇。", 2)
	say("（这姑娘说话怎么毫不客气，罢了，帮她挑一担粪又有何妨。）好。")	
	dark()
	light()
	TalkEx("这时夕阳已落到山坳，金光反照，射在一大片蓝花之上，辉煌灿烂，甚是华美。",0,2)
	say("这些花当真好看！")	
	say("那边有株药草，我够不着，你帮我采来吧。", 2)
	say("好。")
	--local win = plant(-1, 1, 1)
	--if win then
		--addthing(253, 1)
		addHZ(66) --武骧金星：修正BUG
		say("好，他们就要来了，你别动。", 2)
		say("啊？")		
	--else
	--	say("就差一点，没够着....")
	--	say("算了，他们就要来了，你别动。", 2)
	--	say("啊？")
	--end
	dark()
	addevent(-2, 6, 0, 0, 0, 4688*2)
	addevent(-2, 7, 0, 0, 0, 4689*2)
	addevent(-2, 8, 0, 0, 0, 4690*2)
	light()
	say("嘿嘿，小丫头警觉性倒高，你就是无嗔那贼秃的小徒弟？",624) 
	instruct_0();	
	say("程师妹，见了师叔怎不快磕头？",622) 	
	instruct_0();	
	say("咱们哪里钻出师叔来啦？没听见过。",2) 	
	instruct_0();	
	say("毒手神枭的名字听过没有？你师父难道从来不敢提我吗？",624)	
	instruct_0();	
	say("这名字倒听见过的。我师父说他从前确是有过一个师弟，只是他滥用毒药害人，不守门规，早给师祖逐出门墙了。石前辈，那便是你么？",2) 	
	instruct_0();	
	say("臭丫头，敬酒不吃吃罚酒！",624)	
	if WarMain(308) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end			
	null(-2, 6)
	null(-2, 7)
	null(-2, 8)
	light()			
	say("原来姑娘是毒手药王的传人，在下眼拙了。")
	say("少侠今番助我甚多，我愿去为少侠那位朋友解毒。", 2)
	say("如此甚好，有劳姑娘了。不知姑娘尊姓大名？")
	say("程灵素。〈灵枢〉的灵，〈素问〉的素", 2)	
	addevent(108, 16, 1, 1304, 1, 2583*2)	
	instruct_3(104,41,1,0,946,0,0,7224,7224,7224,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [41]
	if instruct_20(18,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
		instruct_10(2);   --  10(A):加入人物[程灵素]
		instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
		instruct_0();   --  0(0)::空语句(清屏)		
		do return; end
	end    --:Label1
	instruct_1(12,2,0);   --  1(1):[程灵素]说: 你的队伍已满，我就直接去*小村吧。
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
	instruct_3(70,6,1,0,103,0,0,5210,5210,5210,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [6]
	
end

OEVENTLUA[1303] = function()
	say("那就有劳小兄弟了。", 621)	
end

OEVENTLUA[1304] = function()
	if hasppl(2) == false then
		say("那就有劳小兄弟了。", 621)	
		do return end
	end
	daode(2)
	say("胡大侠，我把药王传人带回来了。程姑娘，那就拜托你了。")
	say("让我看看....", 2)
	dark()
	light()
	say("呼，药王传人果然名不虚传。胡某在此谢过姑娘和少侠出手相助。", 621)	
	say("胡大侠客气了。", 2)
	say("苗大侠光明磊落，我相信这刀上的毒绝不是他的主意。")
	say("这是当然，胡某一直敬佩苗兄的为人。当日决战之前，胡某曾经见到一江湖郎中鬼鬼祟祟站在我俩的武器旁，可恨我当时没太在意，现在想来，估计就是那人搞的鬼。", 621)
	say("为何胡大侠会和苗大侠进行比武呢？")
	say("此事说来话长，这都是上代的恩怨了........", 621)	
	dark()
	light()
	say("就是这样，胡苗范田四家，从此世世代代，结下深仇大怨....", 621)	
	say("唉，造化弄人。我得想个办法把这段怨仇了结了才是。胡大侠，请你在此静养，待我去找苗大侠解释个明白。")
	say("那就拜托小兄弟了。", 621)
	say("等等，在此之前，你先陪我去找一个人。", 2)
	say("什么人？")
	say("那个江湖郎中，他身上有我药王门的毒，我要收回来才行。另外他有可能知道田归农的下落，既然苗大侠去追杀田归农了，找到他们两个就能找到苗大侠。", 2)
	say("好，我们走吧。")
	addevent(108, 16, 1, 1303, 1, 2583*2)
	addevent(50, 1, 1, 1305, 1, 2584*2)
end

OEVENTLUA[1305] = function()	
	say("你们是何人？", 4)
	say("你们的事发了，快点交待出田归农的下落。")
	say("原来是胡一刀的帮手，让你们见识一下我新到手的毒药。", 4)
	if hasppl(2) then
		say("这种雕虫小技也来班门弄斧。", 2)
		say("什么！为什么毒药没起作用！", 4)
		say("那是因为你碰到毒药里的祖宗了，看打！")
	else
		for i=1, CC.TeamNum do                 
			local id = JY.Base["队伍" .. i]
			if id >=0 then
				JY.Person[id]["内力"] = 0
			end
		end		
	end
	if WarMain(307) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end			
	light()		
	say("大侠饶命！", 4)	
	say("田归农在哪里？")
	say("田归农联合了一些武林高手，正准备去苗家庄找苗人凤。", 4)	
	say("好，你滚吧。")
	say("是，是。", 4)		
	dark()
	null(-2, -2)
	addevent(24, 0, 0, 1306, 3)
	light()
end

OEVENTLUA[1306] = function()	
	null(-2, -2)
	dark()
	addevent(24, 1, 0, 0, 0, 4686*2)
	addevent(24, 4, 0, 0, 0, 4691*2)
	addevent(24, 3, 0, 0, 0, 2718*2)
	light()
	daode(2)
	say("田归农，你竟然利用阿兰暗算我！", 3)
	say("嘿，谁叫你苗家藏有那张藏宝图。匹夫无罪怀壁其罪，那丫头被我稍微一哄就倒贴上来，原本我只想让她把那张藏宝图偷到手，可是她却死心塌地要跟我走，而且对你心怀内疚一定要为你做最后一顿饭才离开。我只是将计就计而已。你既无防她之心，她也无伤你之意，这石万嗔的毒放在你俩的酒里反而叫你防不胜防。哈哈。", 72)
	say("小人！", 3)
	say("哈哈，你现在自身难保，看还有谁能救你！", 72)
	say("苗大侠，我来助你！")
	if WarMain(306) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end			
	null(-2, 4)	
	light()		
	say("阿兰....", 3)	
	say("大哥....对不起....我不知道他是这样的人....",455,0,"南兰")	
	say("欠你的....南兰只能来世....再报....",455,0,"南兰")	
	say("阿兰！", 3)
	dark()
	null(-2, 3)
	addevent(24, 8, 1, 1309, 1, 5216)
	light()
	say("苗大侠....人死不能复生，请节哀。")
	say("唉，我这一生醉心于武，对阿兰总是不够温柔体贴....如今却都晚了....", 3)
	null(-2, 1)
	My_Enter_SubScene(24, 18 ,23, 2)	
	say("小兄弟，这次多亏你出手相助，这把刀就作为谢礼吧。", 3)
	addthing(45, 1)
	say("多谢苗大侠。")
	addevent(108, 16, 1, 1307, 1, 2583*2)
end

OEVENTLUA[1307] = function()	
	say("小兄弟，可有找到苗兄？", 621)
	say("这事说来话长......")
	dark()
	light()
	say("原来还有这一番缘故。唉，可惜苗兄一代豪侠，如今只怕会受不小的打击....", 621)
	say("既然此间事了，我的伤亦已无大碍，我这就起程回辽东老家了。小兄弟日后若是经过，不妨来我家一叙。", 621)	
	say("好，胡大侠保重。")	
	dark()
	null(-2, -2)
	addevent(0, 4, 1, 1308, 1, 5166)
	--openplace(0)
	light()
end

OEVENTLUA[1308] = function()	
	say("多日不见，小兄弟武功似乎又进步不少，可要与胡某切磋一番？", 621)	
	if yesno("要切磋吗？") == false then
		do return end
	else
		JY.Person[621]["攻击力"] = JY.Person[621]["攻击力"] + 100
		JY.Person[621]["防御力"] = JY.Person[621]["防御力"] + 50
		JY.Person[621]["轻功"] = JY.Person[621]["轻功"] + 50		
		if WarMain(309) == false then
			say("小兄弟还是要多加历练才是。", 621)	
			JY.Person[621]["攻击力"] = JY.Person[621]["攻击力"] - 100
			JY.Person[621]["防御力"] = JY.Person[621]["防御力"] - 50
			JY.Person[621]["轻功"] = JY.Person[621]["轻功"] - 50			
			do return end			
		end			
		JY.Person[621]["攻击力"] = JY.Person[621]["攻击力"] - 100
		JY.Person[621]["防御力"] = JY.Person[621]["防御力"] - 50
		JY.Person[621]["轻功"] = JY.Person[621]["轻功"] - 50		
		light()		
		say("小兄弟果然厉害，这场比试倒是让胡某又起了争雄之心。", 621)	
		say("胡大侠可要与在下一起见识天下英雄？")
		say("好，我这就与你一行！", 621)
		addHZ(3)
		instruct_39(5)
		addevent(5, 9, 1, 1311, 1)
		if not instruct_20() then		
			instruct_10(621)
			dark()
			null(-2, -2)
			light()
		else
			say("你的队伍已满，我就回小村等你吧。", 621)
			dark()
			null(-2, -2)
			setteam(621)
			light()
		end
		addthing(145, 1)
		addthing(225, 1)
	end
end

OEVENTLUA[1309] = function()	
	if hasppl(621) == false or hasthing(144) == false then
		say("希望小兄弟能继续行侠仗义。", 3)
		do return end
	end
	say("原来是胡兄，别来无恙？", 3)	
	say("苗兄，不要让你的宝剑生锈，来与我再次一战如何。", 621)	
	say("那就恭敬不如从命了。", 3)	
	JY.Person[3]["攻击力"] = JY.Person[3]["攻击力"] + 100
	JY.Person[3]["防御力"] = JY.Person[3]["防御力"] + 100
	local p1 = 1
	local p2 = 1
	if WarMain(310) == false then
		p1 = 0
	else
		say("两位的比试让在下心痒难耐，苗大侠可愿意指教几招？")
		say("好，小兄弟请！", 3)
		if WarMain(4) == false then
			p2 = 0
		end	
	end
	JY.Person[3]["攻击力"] = JY.Person[3]["攻击力"] - 100
	JY.Person[3]["防御力"] = JY.Person[3]["防御力"] - 100	
	if p1 == 1 and p2 == 1 then
		say("我还担心苗兄因为嫂夫人之事从此一蹶不振，原来是我多虑了。", 621)	
		say("今天一战使在下获益良多，苗大侠可愿意来我小村暂居，方便切磋？")
		say("好，我这就去小村。", 3)
		say("说起来，和两位大战一场，我对我苗家天剑奥义的理解更深了。", 3)
		say("惭愧，酣畅淋漓之下，我也感觉胡家绝刀的奥义也逐渐明晰了。", 621)
		setJX(3,1)
		setJX(621,1)
		QZXS("苗胡二人各自领悟天剑绝刀奥义");
		addHZ(2)
		if GetS(114,0,0,0) == 0 then
		say("说来，要不是有少侠的大力帮忙，我和苗兄的下场不堪设想啊。", 621)
		say("我身无长物，拿的出手就只有刀法和轻功了。不如我传轻功予少侠可好？", 621)
		instruct_0();
		if instruct_11(0,188) == true then
			QZXS("领悟飞天神行秘要！")
			instruct_0();
			say("多谢胡大侠！",0) 
			SetS(114,0,0,0,116)
		else
			say("但那是胡大侠家传武功吧，我想...不妥。",0) 
			say("好吧。之后叫我胡大哥吧，有需要帮忙就开口！",621)
		end
		end
		dark()
		null(-2, -2)
		light()
		addthing(117, 1)
		setteam(3)
		instruct_35(3,1,67,0)
		instruct_35(621,2,44,0)		
		if inteam(92) and MRL(92) then
			say("爹爹，胡伯伯。",92)
			say("好女儿，看你如今这模样，也有阿兰的七八分像了，唉。", 3)
			say("苗兄，本来你我两家的功夫传子不传女，但令爱既跟着小兄弟，我看倒也不必墨守成规。",621)
			say("原当如此，原当如此。", 3)
			QZXS("苗若兰领悟刀剑归真");
			setJX(92)
			instruct_35(92,0,67,0)
			instruct_35(92,1,44,0)
			addHZ(28)
		end
	else
		JY.Person[621]["武学常识"] = JY.Person[621]["武学常识"] + 20
		JY.Person[3]["武学常识"] = JY.Person[3]["武学常识"] + 20
		tb("胡一刀和苗人凤武常加20")
		say("哈哈，今天果然是痛快淋漓，我苗人凤也可以安心封剑了。", 3)
		say("苗兄！", 621)	
		say("胡兄不必多劝了，这是我苗家的剑谱，还请胡兄收下。", 3)
		addthing(117, 1)
		say("闲话就不必多说了，来，比武比不出胜负我们还可以比酒！", 3)
		say("好！请！", 621)
		say("惭愧，酣畅淋漓之下，我也感觉胡家绝刀的奥义也逐渐明晰了。", 621)
		say("那就恭喜胡兄了。", 3)
		setJX(621,1)
		QZXS("胡一刀领悟胡家绝刀奥义");
		dark()
		addevent(-2, -2, 1, 1310, 1)
		light()	
	end
end

OEVENTLUA[1310] = function()	
	say("希望小兄弟能继续行侠仗义。", 3)
end

OEVENTLUA[1311] = function()	
	say("把宝藏交出来！", 72)
	if WarMain(311) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end			
	light()			
    instruct_3(-2,-2,-2,0,0,0,0,3500,3500,3500,-2,-2,-2)
    instruct_2(144,1)
end

OEVENTLUA[1312] = function()
	daode(-2)
	say("听说少侠在四处寻找田某，可是对闯王宝藏有兴趣？", 72)
	say("你知道就好，快把宝藏的秘密告诉我。")
	say("别急，藏宝图现在在苗人凤的手里，可惜我武功不及他，无法得到藏宝图。如果少侠愿意助我一臂之力，我愿意与少侠分享宝藏。", 72)
	say("好，你准备怎么做？")
	say("胡一刀有个儿子叫胡斐，我们只需要上门通风报讯，告诉他杀父仇人是谁....嘿嘿....", 72)
	say("好个驱虎吞狼，那我们走吧。")	
	addevent(0, 4, 1, 1313, 1, 5166)
	instruct_3(104,84,1,0,973,0,0,7012,7012,7012,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [84]
	if instruct_20(5,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
		instruct_10(72);   --  10(A):加入人物[田归农]
		dark()
		null(-2, -2)
		light()
		do return; end
	end    --:Label2
	instruct_1(12,72,0);   --  1(1):[田归农]说: 你的队伍已满，我就直接去*小村吧。
	dark()
	null(-2, -2)
	light()
	instruct_3(70,40,1,0,159,0,0,7012,7012,7012,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [40]
	do return; end
end

OEVENTLUA[1313] = function()
	say("阁下来我家有何贵干？", 1)
	if hasppl(72) == false then
		do return end
	end	
	say("在下田归农，是令尊辽东大侠胡一刀的好友。我有要事要告知胡贤侄，你爹与那金面佛苗人凤在上个月决斗，被那姓苗的暗算，已经....", 72)
	say("什么！此话当真？", 1)
	say("这位小兄弟当时也在场，你可以向他求证。", 72)
	say("我亲眼看见令尊惨死在苗人凤的暗算之下，可叹胡大侠一生磊落，却天妒英才....唉....")
	say("该杀的奸贼！可恨我的家传刀谱不知所踪，无法练成胡家刀法....", 1)
	say("我倒是知道那本刀谱的下落，胡兄如不嫌弃，在下愿意跑这一趟为你找回刀谱。")
	say("那就有劳少侠了！", 1)
	addevent(0, 4, 1, 1314, 1, 5166)	
	addevent(50, 1, 1, 1315, 1, 5168)	
	daode(-2)
end

OEVENTLUA[1314] = function()
	say("那就有劳少侠了！", 1)
end

OEVENTLUA[1315] = function()
	say("把胡家刀谱交出来！")
	say("原来是你这小子，让你尝尝我刀法的利害！", 4)
	JY.Person[4]["攻击力"] = JY.Person[4]["攻击力"] + 100
	JY.Person[4]["武功等级1"] = 999
	JY.Person[4]["生命"] = 800
	JY.Person[4]["生命最大值"] = 800
	JY.Person[4]["内力"] = 4000
	JY.Person[4]["内力最大值"] = 4000	
	if WarMain(307) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	addHZ(75)
	null(-2, -2)
	addevent(0, 4, 1, 1316, 1, 5166)	
	light()		
	addthing(136, 1)
end

OEVENTLUA[1316] = function()
	say("胡兄，你家的刀谱在此。")
	addthing(136, -1)
	say("多谢少侠！待我闭关数月就去找那姓苗的报仇。这把闯王军刀是我家传之物，我这一去也不知能否回来，这刀就转送给少侠吧。", 1)
	say("那在下就却之不恭了，祝胡兄可以如愿报得大仇。")
	addthing(249, 1)
	dark()
	null(-2, -2)
	addevent(24, 0, 0, 1317, 3)
	light()
	say("嘿嘿，我这就去苗人凤家看好戏！")
	daode(-1)
end

OEVENTLUA[1317] = function()
	if hasppl(72) == false then
		do return end
	end
	daode(-3)
	dark()	
	addevent(24, 1, 0, 0, 0, 4686*2)
	addevent(24, 4, 0, 0, 0, 4692*2)	
	light()
	say("当日胡兄的死一直让我耿耿于怀，你要报仇也是天经地义的事。来吧！", 3)
	say("接刀！", 1)
	dark()
	light()
	say("（两人这样子打来打去倒让我想起当日玉笔山庄那一战了。糟糕，两个人总不会又打出感情来吧....）田大侠，你看....")
	say("一不做二不休，趁他们筋疲力尽，我们上！", 72)
	say("啊，少侠你这是？？", 1)
	say("原来是你们这群小人在兴风作浪！", 3)
	if WarMain(312) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	addHZ(9)
	null(-2, -2)
	null(-2, 1)
	null(-2, 4)
	light()			
	addthing(136, 1)
	addthing(117, 1)
	addthing(144, 1)
	for i,v in ipairs(CC.TFWG) do
      if v[1] == 72 then
         v[2] = 44
	     break
      end
    end
	for i,v in ipairs(CC.TFWG1) do
      if v[1] == 72 then
         v[2] = 67
	     break
      end
    end
	say("哈哈，我终于把胡家刀法和苗家剑法拿到手了！", 72)
	instruct_35(72,0,44,0)
	instruct_35(72,1,67,0)
	tb("田归农领悟刀剑归真！")
	addthing(225, 1)
	instruct_39(5)
    instruct_3(5,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_17(5,1,21,21,0);   --  17(11):修改场景贴图:当前场景层1坐标15-15
    instruct_17(5,1,20,20,3694);   --  17(11):修改场景贴图:当前场景层1坐标14-14
    instruct_17(5,1,20,21,4064);   --  17(11):修改场景贴图:当前场景层1坐标14-15	
	say("既然藏宝图已经到手，我们这就去找宝藏吧！", 72)
	say("好！")
end
--[[instruct_39(5)
飞/雪前代线	
	有间客栈 - 酒客消息，苗vs胡
	玉笔山庄 - 苗战胡，胡中毒，选择上前/等待
	上前 - 群战田归农+天龙子弟，田逃，苗追，救胡
			药王庄，遇程，帮忙采药，打药王3叛徒，程加入，采药成功则程自带药王符且得七心海棠
			回玉笔山庄，给解药，得知上代恩怨与跌打郎中的下落
			阎基居，中毒，群殴阎基，得知田下落
			苗家庄，田与苗对峙，苗中暗算，群殴田+范+丐帮+天龙子弟，得冷月刀
			回玉笔山庄，告诉事情经过，胡唏嘘，回家闭关
			胡家，单挑之，胜则胡加入，得闯王刀+四相步+雪山飞狐
			
			开启雪山宝藏，群殴药王3叛徒+田+范+天龙+丐帮子弟
			开宝箱得飞狐外传
			苗家，胡单挑苗，胡赢则主角再挑苗，赢则苗加入；胡输或主角输则胡武常+20；不论输赢得苗家剑
			
	等待 - 胡死，田出现，苗怒，追之，搜索胡的尸体得闯王刀+四相步+胡家刀，阎基出现抢夺，单条之，阎基逃，失去胡家刀
			有间客栈，与田共谋宝藏，田加入			
			胡家，有田，挑拨胡斐与苗决斗，胡需胡刀修炼
			阎基居，群殴加强版阎基，得胡家刀
			回胡家，给胡家刀，得冷月刀+闯王刀，胡斐找苗决斗
			苗家，有田，胡苗两败俱伤，群殴之，得胡刀+苗剑+飞狐外传，田洗胡刀苗剑
			
			开启雪山宝藏，得雪山飞狐
			
			
			
]]

--[[

连城诀丁典线
	衡阳 - 遇见丁典救梅念笙
	洛阳花会 - 遇见凌霜华，丁典花痴
	荆州 - 客栈遇丁典，被抓，拷问后丢牢里，丁典神志不清，战之，丁典清醒，得知凌霜华有难	
		与丁典演戏，引官兵入牢，丁典+主角群殴之，逃出
	荆州目前 - 丁典自尽，挑之阻止，丁典走，有王难姑/程灵素则救活凌霜华
	荆州官府 - 丁典找凌退思报仇，群殴官兵+凌退思
		如果没救活凌霜华，杀凌退思，丁典加入，得乌蚕衣+神照经+无影拳+连城剑+连城诀
		如果救活凌霜华，两人退隐江湖，得乌蚕衣
			去天宁寺，打凌退思等人，得连城诀
				去血山，血刀老祖掳走凌霜华，群殴之，两人加入，得无影拳+连城剑+神照经（#）
]]
OEVENTLUA[839] = function() --昆仑支线，救小妾
	if not checkpic(92, 1, 5284) then
		TalkEx("在下云游各方，途经崑仑，*见此三圣坳绿草如茵，*忍不住前来欣赏一番，*并顺道拜会人称*”铁琴先生”的何掌门．", 0, 1)  
		
		TalkEx("你是打从中原来的吧！*欣赏完了就赶紧离去吧．**最近西域已成多事之地，*小心惹上祸端．", 7, 0)  
		
	else
		say("唉....这可怎么办才好....", 7)
		say("不知何掌门因何事烦恼？")	
		say("这事说来难以启齿，我的第五小妾突然一病不起，已叫了七八个算是有名的大夫来看过，连什么病也说不上来，全身浮肿，一个如花似玉的人儿，肿得....唉，不消提了....", 7)
		if JY.Person[zj()]["医疗能力"] >= 240 then
			say("在下略通岐黄之术，如果何掌门不介意的话，我可以试试。")	
			say("那就有劳了。", 7)
			dark()
			light()
			say("少侠真是医术通神！我昆仑上下同感少侠大恩！", 7)
			addthing(174, 1000)
			tb(addfame(3))
			dark()
			addevent(68, 32, 0, 0, 0, 8950)
			light()
			say("你好大的胆子！敢救那个小贱人！", 166)	
			say("夫人！难道....难道是你下的毒....？", 7)
			say("当然！谁叫你这老不修娶了一个又一个！那小贱人我早就看不顺眼了！臭小子你竟然敢坏我好事！", 166)	
			say("夫人息怒，夫人息怒....", 7)
			say("何太冲！快把这烦人的臭小子给我杀了，否则你那五姑别想活命！", 166)	
			say("（杀死这小子，夫人的怒气便可早些平息，免得她另生毒计，害死五姑，火烧眉毛，不管了！）小子，虽然你救了五姑，可是今日我也是身不由己....", 7)
			say("变脸变得真快，昆仑派自居武林中名门大派，谁知皆是凉薄之辈。来吧！")	
			dark()
			addevent(68, 33, 0, 0, 0, 8844)
			light()
			say("昆仑派的名声都给你们这些家伙败光了！", 626)
			say("你....你是！", 7)	
			JY.Person[626]["攻击力"] = JY.Person[626]["攻击力"] + 100
			JY.Person[626]["轻功"] = JY.Person[626]["轻功"] + 100				
			if WarMain(314) == false then
				instruct_15(0);   
				instruct_0();  
				do return; end			
			end			
			light()	
			say("看在你们师父的份上放过你们一次，以后给我乖乖夹着尾巴做人。如果再让我发现你们做出这种伤天害理之事，别怪我心狠手辣清理门户！", 626)
			dark()
			null(68, 33)
			light()
			say("（那人来去如风，真是神秘啊....不知是何来头....）嘿，昆仑派有你们这种败家子，也坚持不长了。")	
			say("......", 7)
			say("......", 166)
			addevent(-2, -2, 1, 1318, 1)	
			addevent(68, 32, 1, 1318, 1)	
			addevent(93, 32, 0, 1319, 3)			
		end
	end
end

OEVENTLUA[1318] = function() 
	say("......", 7)
	say("......", 166)
end

OEVENTLUA[1319] = function() 
	if not hasthing(54) then
		do return end
	end
	dark()
	addevent(93, 31, 0, 0, 0, 8844)		
	light()
	say("这荒僻之处，居然有高人雅士在此操琴。")
	bgtalk("只见三株大松树下一个白衣男子背向而坐，膝上放着一张琴，正自弹奏。他身周树木上停满了鸟雀，黄莺、杜鹃、喜鹊、八哥，还有许多不知其名的，和琴声或一问一答，或齐声和唱。")
	say("兄台这一曲，空山鸟语，百禽来朝，实深钦佩。")
	say("原来是你，看来小兄弟不仅医术精湛，还深通琴理。", 626)
	say("不敢当，只是因缘际会得到了一把焦尾琴，听朋友略提了些而已。")
	say("焦尾琴？请问可否借在下一观。", 626)
	say("好，请看。")
	dark()
	light()
	say("好琴，好琴！能见到蔡邕亲制的琴，我何足道也算不枉此生了。", 626)
	say("（何足道？难道就是那个年纪虽轻但辈分极高的昆仑异人？）原来兄台就是大名鼎鼎的昆仑三圣！")
	say("嘿，什么昆仑三圣，都是虚名罢了。我因为厌倦世俗琐事所以避世在此，没想到昆仑派十数年间却已经败落到这种程度了，唉。", 626)
	say("闲话休提，小兄弟棋力可好？我最近在研究一个打发时间的棋局，小兄弟可要一试？", 626)
	addevent(93, 31, 1, 1320, 1)
	null(-2, -2)
end

OEVENTLUA[1320] = function() 
	if yesno("要下棋吗？") then
		if chess2() then
			addHZ(84) --85 武骧金星：学究天人通过在觉醒前单挑张三丰获得
			say("小兄弟资质果然惊人！我何足道自负琴棋剑三绝，看来今天也要被小兄弟比下去了。", 626)			
			say("既然如此，那我就再来请教一下小兄弟的武功吧。", 626)	
			addevent(93, 31, 1, 1321, 1)
		else
			say("这棋局对我来说还是有点难....")
		end
	end
end

OEVENTLUA[1321] = function() 
	if yesno("要讨教吗？") then
		if WarMain(315) == false then
			say("不愧为昆仑三圣。")
			do return end			
		end			
		JY.Person[626]["攻击力"] = JY.Person[626]["攻击力"] - 100
		JY.Person[626]["轻功"] = JY.Person[626]["轻功"] - 100			
		light()		
		say("哈哈哈，果然是长江后浪推前浪，看来我这昆仑三圣的名号也是时候改一改了。", 626)			
		say("何先生过誉了。")	
		say("客套话不用多说，我何足道今天算是服了人了。小兄弟以后有什么事情尽管来找我，如果力所能及的话我决不会推辞的。", 626)		
		say("那就谢谢何先生了。")
		if not instruct_20() then		
			instruct_10(626)
			dark()
			null(-2, -2)
			light()
		else
			say("你的队伍已满，我就回小村等你吧。", 626)
			dark()
			null(-2, -2)
			setteam(626)
			light()
		end		
	end
end

OEVENTLUA[1322] = function() --袁紫衣支线
	say("风天南，我终于找到你了！")
	say("又是你，可恶，我和你拼了！", 637) 
	if WarMain(316) == false then
		instruct_15()
		return
	end	
	addevent(107, 22, 0, 0, 0, 6376)
	light()
	say("等等！", 636) 
	say("姑娘，又是你？这人坏事做尽，你为何要帮他？")
	say("对不起啦！我迫不得已....", 636) 
	if WarMain(317) == false then
		instruct_15()
		return
	end	
	null(-2, 21)
	light()	
	say("姑娘为何要与凤天南狼狈为奸！")
	say("少侠，这已经是我第三次救他了，决不能有第四次。", 636) 	
	dark()
	null(-2, 22)
	addevent(40, 58, 1, 1323, 1, 5926)
	light()
end

OEVENTLUA[1323] = function() --袁紫衣支线2
	say("风天南，这次你再也走不了了！")
	say("嘿，臭小子，这次我可不怕你了，兄弟们给我出来！", 637) 	
	dark()
	addevent(-2, 59, 0, 0, 0, 6376)
	light()
	say("少侠，我来助你。", 636) 	
	if WarMain(318) == false then
		instruct_15()
		return
	end	
	null(-2, 58)
	light()	
	say("风天南此次终于伏诛，但姑娘为何这次反而出手相助。")
	say("这....说来话长....", 636) 
	dark()
	light()
	say("所以....风天南原来是姑娘的....")
	say("不错，凤天南便是我的亲生爹爹。我师父说，你父亲作恶多端，此生必遭横祸。他如遭难，你可救他三次，以了父女之情。自此之后，你是你，他是他，不再相干。", 636) 
	say("姑娘以后有何打算？")
	say("风天南虽非我所亲手杀，但也与我大有关系。今后只想退隐江湖，不过问世事。", 636) 
	say("姑娘一身功夫，何不加入我等一起行走江湖，只要多行善事，一定可以为令....他赎罪的。")
	say("....也好，那就请多指教了。我叫袁紫衣。", 636) 	
	if not instruct_20() then		
		instruct_10(636)
		dark()
		null(-2, 59)
		light()
	else
		say("你的队伍已满，我就回小村等你吧。", 636)
		dark()
		null(-2, 59)
		setteam(636)
		light()
	end		
	daode(2)
end


OEVENTLUA[1324] = function() --连城诀丁典线开始
	dark()
	null(-2, 10)
	addevent(-2, 11, 0, 0, 0, 7154)
	addevent(-2, 12, 0, 0, 0, 5430)
	addevent(-2, 13, 0, 0, 0, 6778)
	null(65, 0)
	null(65, 1)
	instruct_17(2,1,24,31,0);   --  17(11):修改场景贴图:当前场景层1坐标18-1F
    instruct_17(2,1,27,27,0);   --  17(11):修改场景贴图:当前场景层1坐标1B-1B
    instruct_17(2,1,30,34,0);   --  17(11):修改场景贴图:当前场景层1坐标1E-22
    instruct_17(2,1,25,29,0);   --  17(11):修改场景贴图:当前场景层1坐标19-1D
	null(2, 0)
	null(2, 1)
	null(2, 2)
	null(2, 3)
	light()
	say("别走！那位兄弟快点帮我拦住他们！", 632)
	say("啊？")
	if WarMain(322) == false then
		instruct_15()
		return
	end	
	null(-2, 13)
	light()
	say("这位兄台，这里发生了什么事？这位老丈又是....？")
	say("我在江中救起了这位老丈，没想到才刚到这里，就被人暗算....", 632)
	say("兄台节哀，老丈他已经....")
	say("唉....", 632)
	dark()
	null(-2, 12)
	addevent(-2, 11, 0, 0, 0, 7152)
	light()
	say("在下丁典，刚才多谢少侠出手相助。", 632)
	say("丁兄客气了。")
	say("在下还身有要事需要赶赴洛阳，先告辞了。", 632)
	say("丁兄慢走。")
	dark()
	null(-2, 11)
	addevent(40, 60, 0, 1325, 3)
	addevent(40, 61, 0, 1325, 3)
	light()
	daode(1)
end

OEVENTLUA[1325] = function()
	say("今年的洛阳花会真热闹，咱们洛阳百花齐聚，真是美哉盛事。", 192)
	say("哈哈，只怕你老哥醉翁之意不在酒，与其说是看花，还不如说是采花来的。", 201)
	say("哈哈，花会期间洛阳美女云集，这等好机会咱岂能错过。", 192)
	say("老哥，你看那边....", 201)
	dark()
	addevent(-2, 62, 0, 0, 0, 9388)
	null(-2, 60)
	null(-2, 61)
	light()
	bgtalk("只见一少女幽然伫立在菊丛中，清秀绝俗，亭亭玉立。")
	say("（好一雅致清丽的姑娘，当真是人淡如菊。）")
	say("采菊东篱下....悠然见南山....好美....好美....", 632)
	say("咦？刚才那个身影，难道是丁兄？")
	dark()
	null(-2, 62)
	light()
	say("奇怪，怎么转眼间那个姑娘和丁兄都不见了....")
	say("刚才的姑娘真美，不知是哪家的千金，赶明儿我就提亲去。", 192)
	say("得了吧，人家是荆州府知府的大小姐，你老兄可高攀不起，还是喝你的酒吧。", 201)	
	say("哈哈，好，来，我们继续喝！", 192)
	addevent(112, 10, 1, 1326, 1, 7156)
end

OEVENTLUA[1326] = function()
	say("丁兄？你怎么在这里？")
	say("原来是兄弟你啊。这个说来话长，当初与你分手之后，我去洛阳办一件事，然后....见到了一个人....", 632)
	say("（怎么脸突然红了，难道丁兄与那位姑娘....）那天我在洛阳似乎见到丁兄尾随一位姑娘而去....")
	say("哈哈，原来你已经猜到了，我与那姑娘一见钟情，她叫凌霜华，是这荆州城知府的千金，我今天是受邀前来拜见她父亲的。", 632)	
	say("恭喜丁兄，到时候一定要请兄弟多喝几杯。")
	say("哈哈，一定一定！", 632)	
	dark()	
	light()
	say("奇怪，霜华去找她父亲，怎么那么久还没回来....", 632)
	say("（说起来这间府邸也有些奇怪，为何一直这么安静，全然不像有人住的样子....）")
	dark()
	addevent(-2, 11, 0, 0, 0, 5174)
	light()
	say2("大胆狂徒！竟敢私闯官家府邸，还不束手就擒！", 208)
	say("什么？霜华她，霜华她....", 632)
	say("丁兄，他们人多势众，不要乱来。这中间一定有什么问题，我们就随他们去衙门走一趟讲个明白。")
	dark()
	null(-2, 10)
	null(-2, 11)
	addevent(-2, 9, 0, 0, 0, 6008)
	instruct_25(34, 10, 14, 37)
	light()
	
	say2("威～～～武～～～～", 208)
	say("堂下小贼，你私闯本府官邸，抢掠财物，你可认罪！", 634)
	say("大人，你听我说....")	
	say("大胆！还敢顶嘴！来人，给我打！", 634)
	dark()
	light()
	say("啊～哎哟～～")	
	say("你可认罪！", 634)
	local count = 0
	while yesno("认罪么？") == false do
		count = count + 1
		say("我....我冤枉啊....")	
		say("还嘴硬！继续打！", 634)
		dark()
		light()		
		say("啊～哎哟～～")	
		if count > 10 then
			say("呃....啊....（翻白眼，气绝身亡）")
			addHZ(116)
			break
			--instruct_15()
			--do return end
		end
		say("你可认罪！", 634)
	end
	say("（好汉不争这一时之气，先躲过这一场再说）好，我认了....")	
	say("来人！把这小贼关入大牢！", 634)	
	null(-2, 9)
	addevent(112, 16, 1, 1328, 1, 7156)
	My_Enter_SubScene(112, 14 ,47 ,0)
end

OEVENTLUA[1327] = function()
	say2("看什么看，快滚！不然把你抓起来！", 208)
end

OEVENTLUA[1328] = function()
	say("丁兄？你怎么也被关起来了？")
	say("霜华......", 632)	
	say("丁兄？丁兄？？")
	say("霜华！霜华啊啊啊！！！", 632)
	say("糟了，丁兄好像神志不清！")
	JY.Person[632]["攻击力"] = JY.Person[632]["攻击力"] + 100
	JY.Person[632]["防御力"] = JY.Person[632]["防御力"] + 100	
	if WarMain(323) == false then
		instruct_15()
		return
	end	
	light()
	say("丁兄！冷静下来！")
	say("呼....呼....兄弟....是你啊....霜华，霜华她....", 632)
	say("怎么了，发生了什么事？凌姑娘她怎么了？")
	say("凌退思那个老贼，竟然不惜利用霜华来暗算我....那日我来到衙门见到霜华，澄清这一切都是一场误会....", 632)	
	say("我俩刚刚走出衙门，看见花圃中多了几盆颜色特别娇艳的黄花。这些花的花瓣黄得像金子一样，闪闪发亮，花朵的样子很像荷花，只是没荷花那么大。我二人都是最爱花的，立时便过去观赏。", 632)
	say("霜华说从来没见过这种黄花，我们一齐凑近去闻闻，要知道这花的香气如何....", 632)
	say("结果两人都中了奇毒....", 632)
	say("我身负武功，还好一些，可霜华她....她....", 632)
	say("好狠的父亲！可凌退思为什么处心积虑对付丁兄？")
	say("当日那个老丈身怀一个宝藏的秘密，怀壁其罪，被人追杀。如今他把这个秘密告诉了我，所以那个老贼....唉....", 632)
	say("惟今之计，我们先逃出这个大牢再说。丁兄，助我演一场戏....")
	say("好....", 632)	
	dark()
	light()
	say("拿水来！！再不拿水来，我将这疯汉先砍死再说。！！！")
	say("啊！！", 632)	
	dark()
	addevent(-2, 14, 0, 0, 0, 5176)
	addevent(-2, 15, 0, 0, 0, 5176)
	null(-2, 12)
	null(-2, 13)
	light()
	say2("吵什么吵！再吵就把你们全捆起来！", 208)	
	say("就是现在！")
	if WarMain(324) == false then
		instruct_15()
		return
	end	
	null(-2, 14)
	null(-2, 15)
	light()	
	say("霜华！", 632)
	dark()
	null(-2, 16)
	addevent(-2, 17, 1, 0, 0, 6700)
	addevent(-2, 18, 1, 0, 0, 6696)
	addevent(-2, 19, 1, 1329, 1, 7150)
	light()
	say("丁兄等等我！")
	say("（不知道丁兄会不会出事，快点追上去瞧瞧）")	
end

OEVENTLUA[1329] = function()	
	say("（这个墓....难道就是....）")
	say("霜华！！凌老贼，我跟你誓不两立！", 632)
	dark()
	null(-2, 19)
	addevent(-2, 9, 1, 0, 0, 7152)
	addevent(-2, 0, 0, 1330, 3, 0)
	addevent(-2, 1, 0, 1330, 3, 0)	
	addevent(-2, 18, 1, 1331, 1, 6696)
	light()
	say("（糟糕，丁兄一定是去找凌退思了，寡不敌众，我还是赶紧跟上去的好）")
end

OEVENTLUA[1330] = function() --霜华死
	addevent(-2, 18, 1, 0, 0, 6696)
	say("凌老贼，我今天就要你血债血偿！", 632)
	say("臭小子，我正愁无处找你，你却送上门来。把宝藏的秘密交出来，不然休想活着离开！", 634)
	say("丁兄小心！")	
	if WarMain(325) == false then
		instruct_15()
		return
	end	
	for i = 0, 9 do
		null(-2, i)
	end	
	addevent(-2, 19, 0, 0, 0, 7150)
	My_Enter_SubScene(112, 14 ,13, 0)	
	say("......", 632)
	say("丁兄，人死不能复生....你这个样子，凌姑娘在天之灵也不会开心的......")
	say("这盆绿菊，是栽在凌姑娘墓前的....")
	say("这..这是春水碧波....难道是她留下来的么....", 632)
	addHZ(56)
	dark()	
	addevent(-2, 19, 0, 0, 0, 7156)
	light()
	say("抱歉耽误了小兄弟这些时日，如果你有什么需要帮忙的尽管说。", 632)
	say("那就有劳丁兄了。")
	say("这些日子我仔细研究了一番，所谓的宝藏秘密，其实不过是一本书而已。世上多少人为了这虚妄的秘密丧了性命，唉....", 632)
	addthing(146)
	JY.Person[632]["攻击力"] = JY.Person[632]["攻击力"] - 100
	JY.Person[632]["防御力"] = JY.Person[632]["防御力"] - 100			
	JY.Person[632]["携带物品2"] = 71
	JY.Person[632]["携带物品数量2"] = 1
	JY.Person[632]["携带物品3"] = 59
	JY.Person[632]["携带物品数量3"] = 1
	teammate(632)
	null(-2, 19)	
end

OEVENTLUA[1331] = function() --霜华活
	local p = -1
	if hasppl(2) then p = 2 end
	if hasppl(17) then p = 17 end
	if p ~= -1 then
		say("等等，这个香味，是金波旬花！", p)
		say("什么？")
		say("这天竺传来的毒花，没想到这里也能见到。中了这毒的人在死前会进入类似于假死的状态，如果我所料没错，凌姑娘还有救！", p)
		say("真的？")
		say("看我的吧。", p)	
		dark()
		null(-2, 18)
		addevent(-2, 17, 0, 0, 0, 9388)
		light()
		say("凌姑娘！")
		say("我的头好晕....你....是谁？", 633)
		say("这事说来话长，我们边走边说，丁兄有危险！")
		dark()
		null(-2, 17)
		addevent(-2, 0, 0, 1332, 3, 0)
		addevent(-2, 1, 0, 1332, 3, 0)
		light()
		daode(2)
	end	
end

OEVENTLUA[1332] = function()
	say("凌老贼，我今天就要你血债血偿！", 632)
	say("臭小子，我正愁无处找你，你却送上门来。把宝藏的秘密交出来，不然休想活着离开！", 634)
	say("丁兄小心！")	
	if WarMain(325) == false then
		instruct_15()
		return
	end	
	addevent(-2, 9, 0, 0, 0, 7154)
	say("丁大哥，等等！", 633)
	say("霜华？！我不是在做梦吧！", 632)
	say("是这位小兄弟救了我....丁大哥....请你让他走吧....他毕竟是我父亲....", 633)
	say("好吧....凌老贼，今天算你好运，滚吧！", 632)
	say("......哼！", 634)
	addevent(-2, 17, 0, 0, 0, 9388)	
	addevent(-2, 19, 0, 0, 0, 7150)		
	My_Enter_SubScene(112, 14 ,13, 0)	
	for i = 0, 9 do
		null(-2, i)
	end	
	say("丁大哥..没想到我还能再见到你....", 633)
	say("霜华....我们走吧，我带你去一个平静的地方....", 632)	
	dark()	
	addevent(-2, 19, 0, 0, 0, 7156)
	light()
	say("小兄弟，这次多亏了你。为兄无以为报，这件宝甲请你收下。", 632)	
	addthing(59)
	say("我这几天一直在研究那宝藏的秘密，发现宝藏就藏在天宁寺内。你可以去那里看看有没有你一直在找的东西。", 632)	
	say("谢谢丁兄，后会有期！")
	say("后会有期！", 632)	
	dark()
	null(-2, 17)
	null(-2, 19)
	addevent(63, 18, 1, 1333, 1)
	light()
end

OEVENTLUA[1333] = function()
	say("找到了..这里有个暗门..这是....")
	addthing(146)
	dark()
	addevent(-2, 18, 1, 0, 0)
	addevent(-2, 21, 0, 0, 0, 9386)
	addevent(-2, 22, 0, 0, 0, 5170)
	addevent(-2, 23, 0, 0, 0, 5170)
	light()
	say("臭小子，把宝藏交出来！", 634)
	say("凌退思！你竟然还不学乖！")
	say("小的们，给我上！", 634)
	if WarMain(326) == false then
		instruct_15()
		return
	end		
	bgtalk("混战中暗门被打开了，地下滚满了珍珠、宝石、金器、白玉、翡翠、珊瑚、祖母绿、猫儿眼。知府官兵，江湖豪客，不管是谁都抢了起来。有些人开始斗殴，于是有人打胜了，有人流血，有人死了。这些人越斗越厉害，有人突然间扑到金佛上，抱住了佛像狂咬，有的人用头猛撞。")
	say("怎么会这样....就算是财迷心窍，也不该这么发疯？")
	say("是了，定是当年藏宝的人怕人盗宝，因此在珠宝上涂了毒药....")
	bgtalk("此时抢宝藏的人群已经近似疯狂，再也救不得了....")
	dark()
	for i = 21, 23 do null(-2, i) end
	light()
	say("唉，幸好我只碰了这本书，这连城诀，实在是书尽了人世黑暗。")
	addevent(2, 0, 0, 1334, 3)
	addevent(2, 1, 0, 1334, 3)
	addevent(2, 2, 0, 1334, 3)
end

OEVENTLUA[1334] = function()
	dark()
	null(-2, 0)
	null(-2, 1)
	null(-2, 2)
	addevent(-2, 3, 0, 0, 0, 8216)
	addevent(-2, 8, 0, 0, 0, 9390)
	addevent(-2, 7, 0, 0, 0, 7154)
	JY.Person[97]["内力"] = 1500
	JY.Person[632]["受伤程度"] = 80
	light()
    instruct_30(27,49,27,34);   --  30(1E):主角走动27-49--27-34
    instruct_25(27,34,27,30);   --  25(19):场景移动27-34--27-30	
	say("你这淫僧！想对霜华做什么！", 632)	
	say("嘿嘿，臭小子别碍事，快给老子滚！如果你识相的话等老子享受完了就给你点剩下的。", 97)	
	say("找死！", 632)
	say("丁兄，我来助你！")
	if WarMain(327) == false then
		instruct_15()
		return
	end			
	null(-2, 3)
	addthing(356)
	say("凌姑娘没事吧？")
	say("我没事，谢谢少侠再次仗义相助。", 633)
	say("我俩本来在这雪山隐居，今早却突然撞上这淫僧，对霜华出言不逊....我与之缠斗，疏忽之下中了他的暗算....幸好兄弟你及时赶到。", 632)
	if GetS(111, 0, 0, 0) == 0 then
	   say("少侠多次出手相助，我无以为报，就将这神照功交予少侠。",632) 
	   if DrawStrBoxYesNo(-1, -1, "是否领悟神照功？", C_WHITE, 30) == true then 
	      say("多谢丁兄。")
	      SetS(111,0,0,0,94)
	   else
	      say("丁兄好意，在下心领了。")
	   end  
	end 
	say("既然凌姑娘受了惊，丁兄你又有伤，不如来我小村暂居吧。")
	say("好吧，多谢兄弟美意，我俩这就去小村。", 632)
	JY.Person[632]["携带物品2"] = 71
	JY.Person[632]["携带物品数量2"] = 1	
	JY.Person[632]["攻击力"] = JY.Person[632]["攻击力"] - 100
	JY.Person[632]["防御力"] = JY.Person[632]["防御力"] - 100		
	dark()
	null(-2, 7)
	null(-2, 8)
	setteam(632)
	setteam(633)
	light()	
	daode(2)
end

OEVENTLUA[1335] = function()
	dark()
	addevent(-2, 11, 0, 0, 0, 7042)
	null(61, 13)
	null(46, 0)
	null(46, 1)
	null(-2, -2)
	light()
	say2("拦住她，别让她跑了！", 201,0,"五仙教弟子")
	say("（前面那堆五仙教徒在追赶一个女子，我应该帮谁呢？）")
	if yesno("要帮五仙教吗？") then
		JY.Person[176]["生命"] = 800
		JY.Person[176]["生命最大值"] = 800
		JY.Person[176]["内力"] = 3500
		JY.Person[176]["内力最大值"] = 3500
		JY.Person[176]["攻击力"] = 250
		JY.Person[176]["防御力"] = 180
		JY.Person[176]["轻功"] = 280
		instruct_35(176, 0, 144, 999)	
		say("别跑！")
		if WarMain(328) == false then
			instruct_15()
			do return end
		end		
		null(-2, 11)
		say("结果还是让她跑掉了。")
		say2("多谢少侠出手相助，那个女子叫何红药，是我们五仙教的护法。可是今早她突然闯入禁地，盗走了我们镇教三宝，金蛇剑，金蛇剑法以及金蛇锥。少侠可否助我们寻回她？", 201,0,"五仙教弟子")
		say("好的，我会多加留意她的去向。")
		say2("如此便谢谢了。", 201,0,"五仙教弟子")
		addevent(61, 13, 1, 1336, 1, 9392)
	else
		say("一群人欺负一个姑娘算什么！")
		if WarMain(329) == false then
			instruct_15()
			do return end
		end		
		for i = 1, 8 do
			null(-2, i)
		end		
		say("姑娘你没事吧？")
		say("......", 176)
		dark()
		null(-2, 11)
		light()
		say("怎么一溜烟的就跑掉了....")
		addevent(61, 40, 0, 1345, 3)
	end
end

OEVENTLUA[1336] = function()
	say("你有何贵干？", 630)
	say("在下正在寻人，请问兄台有没有见过一蒙面女子。")
	say("没有。", 630)
	say("（看此人神色不定，似乎是在说谎，他身边那把剑的形状....）兄台那把剑....")
	say("多管闲事！", 630)
	JY.Person[630]["攻击力"] = JY.Person[630]["攻击力"] + 100
	JY.Person[630]["防御力"] = JY.Person[630]["防御力"] + 50
	JY.Person[630]["轻功"] = JY.Person[630]["轻功"] + 50		
	if WarMain(336) == false then
		instruct_15()
		do return end
	end		
	JY.Person[630]["攻击力"] = JY.Person[630]["攻击力"] - 100
	JY.Person[630]["防御力"] = JY.Person[630]["防御力"] - 50
	JY.Person[630]["轻功"] = JY.Person[630]["轻功"] - 50		
	say("哼，技不如人我也无话可说，要杀我的就来吧。", 630)
	say("兄台言重了，在下没有任何歹意，只是在找一位姓何的姑娘而已。她盗取了五仙教的宝物，而你身边的那把剑似乎就是其中之一....")
	say("......", 630)
	say("兄台似乎有难言之隐，虽然只是萍水相逢一场，但是兄台如果有什么困难，可以说出来大家一起想办法。")
	say("好，我说给你听也不妨。我身怀血海深仇，这金蛇三宝对我寻仇大有帮助。", 630)
	say("不知兄台的仇家为何人？")
	say("苏州温家堡的人！当年温家老六污辱我亲姊，然后将其杀害，并将我父母兄长，一家五口尽数杀死，只剩我孤身一人逃脱在外二十余年。如今我艺成归来，是讨回血债的时候了！", 630)
	say("温家是武林世家，兄台一人只怕报仇不易....")
	say("只要有了这金蛇三宝，我武功很快就能大进，我在暗他们在明，血债十倍回报，方解我恨。", 630)
	say("（此人偏激乖张，已入邪道，须得找个法子劝导一下才行）如兄台不弃，在下愿意陪兄台去讨个说法。")
	say("哼，不用了！我夏雪宜不需要旁人同情！", 630)
	dark()
	null(-2, -2)
	light()
	say("走得好快，我得去温家堡看看。")
	addevent(110, 14, 0, 1337, 3)
	addevent(110, 15, 0, 1337, 3)
end

OEVENTLUA[1337] = function()
	dark()
	null(-2, 14)
	null(-2, 15)
	addevent(-2, 13, 0, 0, 0, 9392)
	for i = 8, 12 do
		addevent(-2, i, 0, 0, 0, 7072)
	end
	light()
	say("夏雪宜，你害了我温家三十八口人命，我定要把你碎尸万段！", 645)
	say("温家五老，我说过我必杀你家五十人，污你家妇女十人，现在还差一些呢，哈哈！", 630)
	say("你好狠！连女人也不放过，竟然把我的两个夫人卖到娼寮！", 648)
	say("哈哈哈，无毒不丈夫，我这是跟你温家学的，你不是已经派人去过扬州把那娼寮男女老少通通杀光，连你那两个夫人也没放过么。", 630)
	say("可恶的混小子，我温家和你誓不两立！", 645)
	say("（夏雪宜果然偏激，祸不及妻儿，这下可是做得狠了。只是温家五老也不是什么好人，道上伤天害理的事情似乎也做得不少....两害相较取其轻，我还是帮夏雪宜吧。）夏兄，我来助你！")
	if not WarMain(331) then
		instruct_15()
		return
	end
	light()
	say("臭小子，竟然带了硬帮手。你别得意，你看这是谁！", 645)
	dark()
	addevent(-2, 16, 0, 0, 0, 9394)
	light()
	say("阿仪？！", 630)
	say3("夏郎....！", 91, "温仪")
	say("哼，小子，别以为你把阿仪和那贱种藏起来我们就找不到她们了。你可想要她母女平安？", 645)
	say("卑鄙小人！", 630)
	say("哈哈，你小子也有今天，乖乖束手就擒吧！", 645)
	say3("夏郎....！", 91, "温仪")
	say("阿仪....好，你们赢了....", 630)
	say("哈哈哈！", 645)
	say("（夏雪宜竟然这么容易就改变心意....看来这女子对他真的很重要啊。如今形势对我们不利，还是先走一步，以后再行营救吧。）青山不改绿水长流，咱们后会有期。")
	say("别走！", 645)
	My_Enter_SubScene(110, 25, 44, 3)
	for i = 8, 16 do
		null(110, i)
	end
	addevent(110, 14, 0, 1338, 3)
	addevent(110, 15, 0, 1338, 3)
end

OEVENTLUA[1338] = function()
	null(-2, 14)
	null(-2, 15)
	say("奇怪，怎么温家堡的人都不见了....看来应该找个人问问。")
	for i = 4, 7 do
		addevent(-2, i, -2, 1339, 1, -2)
	end
end

OEVENTLUA[1339] = function()
	say2("听说温家堡前几天捉了个仇人，以温家狠辣的作风来看，此人凶多吉少了。", 193)
	say2("怎么，你没听说？昨天夜里看守牢房的那些人突然都死光了，那犯人也被救走了。据温家的下人说他们都是中了毒，如今温家五老气得跳脚，倾巢而出誓要抓到下手的人呢。", 195)
	say("（原来夏兄被救走了....难道是何姑娘出的手？不知他二人如今在何处呢....）")
	for i = 4, 7 do
		addevent(-2, i, -2, 670, 1, -2)
	end
	addevent(46, 7, 0, 1340, 3)
	addevent(46, 1, 1, 0, 0, 7170)
	addevent(46, 0, 0, 0, 0, 7042)
end

OEVENTLUA[1340] = function()
	dark()
	null(-2, -2)
	daode(2)
	light()
	say("前方似乎有人在说话。")
	instruct_25(28, 42, 23, 29)
	say("我为了你叛教盗宝，你转眼却喜欢上了另外的人！", 176)	
	say("我从来没有喜欢过你，当初的事不过是逢场作戏而已。", 630)
	say("你就是不肯说出她是谁么！", 176)
	say("只要你说出那女子的姓名住所，我就饶了你对我的负心薄幸，好好的服侍你一生。", 176)
	say("......", 630)	
	say("你！好你个夏雪宜！", 176)	
	bgtalk("只见两人纠缠不清，何红药怒极出手，不停的抽打夏雪宜，夏雪宜大笑着，不停的夸他的未婚妻，他说一句，何红药就抽一鞭，打到后来，夏雪宜全身没一块完整皮肉了，还是笑着夸个不停。")
	say("（我以为夏兄已经够偏执了，没想到何姑娘只有更甚....）这样下去夏兄性命不保，不管怎样，还是先救了他再说。")
	My_Enter_SubScene(46, 24 ,27 ,2)
	say("何姑娘请住手！")
	say("是你！你来这里干什么！", 176)
	say("我在旁边听了这会，也大概了解了你们之间的恩怨。何姑娘，夏兄的心既然不在你的身上，不管你怎样打他，他也不会回心转意的....")
	say("你！你给我住口！", 176)	
	JY.Person[176]["攻击力"] = JY.Person[176]["攻击力"] + 50
	JY.Person[176]["防御力"] = JY.Person[176]["防御力"] + 50
	JY.Person[176]["轻功"] = JY.Person[176]["轻功"] + 50
	if not WarMain(334) then
		instruct_15()
		return
	end
	say("何姑娘，你还是走吧，天大地大，你总有一天会碰到真心实意待你的那个人的....")
	say("......哼！", 176)	
	dark()
	null(-2, 0)
	addevent(46, 1, 1, 1341, 1, 7170)
	light()
end


OEVENTLUA[1341] = function()
	say("夏兄，你觉得怎么样？")
	say("我中了温家的醉仙蜜，又被断了筋骨，看来是不成了......", 630)
	if hasthing(27) and hasthing(2) then
		say("夏兄别急，我身上有解毒和续骨的灵药，让我看看....")
		addthing(27, -1)
		addthing(2, -1)
		dark()
		addevent(-2, 1, 0, 0, 0, 9392)
		light()
		say("夏兄感觉如何？")
		say("我夏雪宜生平从不亏欠人情，你想要我帮什么，说吧。", 630)
		say("不敢当，只是在下恳请夏兄以后能收敛下戾气，仇可以报，可是请务必避免伤及无辜。")
		say("也罢，那就随你意吧，再会。", 630)		
		dark()
		null(-2, 1)
		addevent(110, 13, 1, 1344, 1, 9392)
		light()
		say("他一定是又去了温家堡，唉，看来我也要再跑一趟了。")
		daode(1)
	else
		say("少侠..我请求你一件事..请你去温家..把阿仪..和我女儿青青救出来....", 630)
		say("从南..来了..一群雁..也有成双..也有孤单..阿仪............", 630)
		dark()
		null(-2, 1)
		addevent(-2, 1, 1, 0, 0, 6700)
		addevent(-2, 9, 1, 0, 0, 6696)
		light()
		addthing(30, 10)
		addthing(40)
		addthing(121)
		addthing(156)
		say("唉，此人虽然乖戾，可偏偏情深意重，他到底是好人呢，还是坏人呢....")
		addHZ(23)
		addevent(110, 13, 1, 1342, 1, 7032)
	end
end

OEVENTLUA[1342] = function()
	daode(2)
	say("温姑娘....？不对，你比她年轻得多....")
	say("你认识我娘？那你一定认识我爹了！", 91)
	say("难道你就是青青....？你娘呢？")
	say("我娘..她已经....", 91)
	dark()
	for i = 8, 12 do
		addevent(-2, i, 0, 0, 0, 7072)
	end	
	light()
	say("不用问了！阿仪那个贱人，竟然为了那个混小子而自尽了！", 645)
	say("胡说！明明就是你们逼死了我娘！", 91)
	say("没大没小的丫头，等下再找你算账！小子，夏雪宜呢？", 645)
	say("夏兄已经去了，临死前他托我来接回温姑娘和她女儿。")
	say("啊！爹....！", 91)
	say("做梦！他们两人生是我温家的人，死是我温家的鬼！", 645)
	say("那就得罪了。")
	for i = 645, 649 do
		JY.Person[i]["攻击力"] = JY.Person[i]["攻击力"] + 50
		JY.Person[i]["防御力"] = JY.Person[i]["防御力"] + 100
		JY.Person[i]["轻功"] = JY.Person[i]["轻功"] + 50		
	end
	if not WarMain(331) then
		instruct_15()
		return
	end	
	for i = 8, 12 do
		null(-2, i)
	end		
	light()
	say("娘....你的仇，终于报了....", 91)
	say("温姑娘..我们去金蛇山洞把你爹娘合葬一处吧....")
	say("好....", 91)
	dark()
	null(-2, 13)
	addevent(46, 1, 1, 1343, 1, 6700)
	addevent(46, 9, 1, 1343, 1, 6696)	
	light()
end

OEVENTLUA[1343] = function()
	dark()	
	light()
	say("爹，娘，如今你们可以一直在一起了....", 91)
	say("温姑娘，我们走吧？")
	setJX(91)
	JY.Person[91]["姓名"] = "夏青青"
	instruct_35(91, 0, 40, 999)	
	JY.Person[91]["御剑能力"] = JY.Person[91]["御剑能力"] + 30
	JY.Person[91]["攻击力"] = JY.Person[91]["攻击力"] + 100	
	say("不，请少侠别称呼我温姑娘了。从今天起，我叫夏青青！", 91)
		if GetS(114,0,0,0) == 0 then
		say("感谢少侠帮忙。这本是我从「那人」处得到的秘笈", 91)
		say("为感谢少侠恩义，就送予少侠吧吧", 91)
		instruct_0();
			  if instruct_11(0,188) == true then
				 QZXS("领悟神形百变精义！")
				 instruct_0();
				 say("多谢夏姑娘。",0) 
				 SetS(114, 0, 0, 0,117)
				 addthing(240)
			  else
				 say("我还是算了吧",0) 
			  end
		end
	teammate(91)
	addevent(46, 1, 1, 0, 0, 6700)
	addevent(46, 9, 1, 0, 0, 6696)		
end

OEVENTLUA[196] = function()
	if JX(91) then
		TalkEx("夏姑娘，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	else
		TalkEx("温姑娘，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)  
	end
	
	instruct_21(91)  --离开队伍
	instruct_3(70, 51,1,0,197,0,0,7032,7032,7032,-2,-2,-2)  
	do return end
end

OEVENTLUA[1344] = function()
	say("夏兄，你怎么看起来如此焦急？")
	say("我找遍了温家堡上下，就是没看见阿仪和青青的影子！", 630)
	dark()
	for i = 8, 12 do
		addevent(-2, i, 0, 0, 0, 7072)
	end	
	light()
	say("不用找了！阿仪那个贱人，竟然为了你自尽了。", 645)
	say("那青青呢！", 630)
	say("那个贱种反正也养不活，我便送她去见她娘了！", 645)
	say("虎毒不食子，你们的手段也太狠了！")
	say("阿仪！青青！我要替你们报仇！", 630)
	for i = 645, 649 do
		JY.Person[i]["攻击力"] = JY.Person[i]["攻击力"] + 100
		JY.Person[i]["防御力"] = JY.Person[i]["防御力"] + 100
		JY.Person[i]["轻功"] = JY.Person[i]["轻功"] + 100		
	end
	if not WarMain(331) then
		instruct_15()
		return
	end	
	for i = 8, 12 do
		null(-2, i)
	end		
	light()
	say("......", 630)
	say("从南来了一群雁，也有成双也有孤单....", 630)
	say("成双的欢天喜地声嘹亮，孤单的落在后头飞不上....", 630)
	say("不看成双，只看孤单，细思量你的凄凉，和我是一般样....", 630)
	say("细思量你的凄凉，和我是一般样....", 630)
	say("夏兄，人死不能复生....你先来我小村暂住吧。")
	say("......", 630)
	teammate(630)
	say("唉，青衿心上意，彩笔画中人。这恩怨纠缠，谁又能说得清楚。")
	addthing(156)
end
--[[
	五仙教 - 何红药盗走金蛇三宝，分支：（灭青青，灭金蛇洞
	帮助五仙教 - 打何红药，何红药逃走
		高升客栈 - 见夏雪宜，得知故事
		苏州 - 打温家五老，温仪出现，夏雪宜迟疑，被暗算
		苏州 - 发现温家堡空了
		金蛇山洞 - 何红药逼问夏雪宜，夏雪宜不屈，单挑何红药
		有通犀地龙丸及天王保命丹救活夏雪宜，否则得金蛇三宝，去苏州挑温家五老得碧血剑，加强版温青青加入
		苏州 - 夏雪宜+主角挑温家五老加强版，得碧血剑
		

	
	帮助何红药 - 打五仙教，何红药逃走
		高升客栈 - 打何红药+夏雪宜，五仙教赶到，何红药被夏雪宜抛下，被抓走
		苏州 - 夏雪宜vs温家五老，夏雪宜威胁主角群殴温家五老
		金蛇洞 - 夏雪宜重伤，问之要三宝，单挑之，夏死，得三宝+碧血剑
		五仙教 - 群殴五仙教+何铁手，何红药加入
]]
OEVENTLUA[1345] = function()
	dark()
	null(-2, -2)
	addevent(-2, 13, 0, 0, 0, 7042)
	addevent(-2, 41, 0, 0, 0, 9392)
	light()
	say("好剑！原来这就是五仙教的金蛇剑。", 630)	
	say("红药，你这次为我做了这么大的牺牲，我很感激......", 630)
	say("夏郎....", 176)
	say("（原来那位姑娘是小偷，那我岂不成了帮凶？）")
	say("是谁！", 630)
	say("糟糕，被发现了！")
	JY.Person[630]["攻击力"] = JY.Person[630]["攻击力"] + 100
	JY.Person[630]["防御力"] = JY.Person[630]["防御力"] + 50
	JY.Person[630]["轻功"] = JY.Person[630]["轻功"] + 50		
	if not WarMain(330) then
		instruct_15()
		return
	end		
	addevent(-2, 42, 0, 0, 0, 6808)
	say2("何红药，你暗算教主，盗走教中宝物，快点跟我们回去领罪！", 201)
	say("啊！夏郎，被那小子一个耽误，他们追过来了，怎么办？", 176)
	say("......", 630)
	dark()
	null(-2, 41)
	light()
	say("夏郎？夏郎！！", 176)
	say("（竟然丢下那个姑娘不管自己逃跑....那个人真是薄情）")	
	say2("竟然被那个小子跑了，也罢，他的份也算在你身上了！", 201)
	say("请等等！")
	instruct_30(40, 23, 39, 20)
	say("五仙教的大哥们，我可以作证，何姑娘是被人所骗的。我愿意帮你们把宝物抢回来，请对何姑娘从轻发落。")
	say2("小子，你有这个能耐么？", 201)
	say("我可以用性命担保！")
	say2("好，我们这就回去请示教主，何红药，走吧！", 201)
	say("公子....你为何要帮我....", 176)
	say("因为你也是个可怜人。")
	say("我对他如此一往情深，你说....我是下贱之人么....", 176)
	say("一往情深，怎么会是下贱？负心薄幸，那才下贱！")
	say("....", 176)
	dark()
	null(-2, 42)
	null(-2, 13)
	addevent(-2, 18, -2, 1346, 1)
	addevent(-2, 19, -2, 1346, 1)
	light()
	say("不知道那个人跑到哪里去了，我还是四周问问吧。")
end

OEVENTLUA[1346] = function()
	addevent(-2, 18, -2, 681, 1)
	addevent(-2, 19, -2, 681, 1)
	say2("刚刚看到有个人拿着一把很奇怪的剑往苏州方向去了。", 193)
	say("苏州....？")
	addevent(110, 14, 0, 1347, 3)
	addevent(110, 15, 0, 1347, 3)
end

OEVENTLUA[1347] = function()
	dark()
	null(-2, 14)
	null(-2, 15)
	addevent(-2, 13, 0, 0, 0, 9392)
	for i = 8, 12 do
		addevent(-2, i, 0, 0, 0, 7072)
	end
	light()	
	say("夏雪宜，你害了我温家三十八口人命，我定要把你碎尸万段！", 645)
	say("温家五老，你灭我满门，我说过我必杀你家五十人，污你家妇女十人，现在还差一些呢，哈哈！", 630)
	say("你好狠！连女人也不放过，竟然把我的两个夫人卖到娼寮！", 648)
	say("哈哈哈，无毒不丈夫，我这是跟你温家学的，你不是已经派人去过扬州把那娼寮男女老少通通杀光，连你那两个夫人也没放过么。", 630)
	say("可恶的混小子，我温家和你誓不两立！", 645)
	say("（这是，黑吃黑？）")
	say("那边的小子，你是要抢回五仙教的宝物么？那就帮我杀了这五个老家伙，不然我立刻把这把剑毁掉！", 630)
	say("（温家五老也可说是多行不义作恶多端，与之为敌也算是为民除害）好！")
	if not WarMain(331) then
		instruct_15()
		return
	end
	say("可恶，姓夏的小子，你要灭我温家，我也不要你好过！着！", 645)
	say("啊！", 630)
	for i = 8, 12 do
		null(-2, i)
	end
	My_Enter_SubScene(110, 45 ,37 ,2)
	say("哈哈哈..我..我终于报仇了...", 630)
	say("（伤口有毒，不清理不行）你别动，让我看看。")
	say("我夏雪宜不需要人同情，给我让开！", 630)
	dark()
	null(-2, 13)
	addevent(46, 1, 1, 1348, 1, 9396)
	light()
	say("怎么带着伤就跑了..")
end

OEVENTLUA[1348] = function()
	say("原来你跑到这里来了。")
	say("你追着我干吗？", 630)
	say("你伤得太重，先让我看看再说。")
	say("道不同不相为谋，你也不用惺惺作态了，要夺回金蛇三宝的话就来吧！", 630)
	if WarMain(333) == false then
		instruct_15()
		return
	end
	say("你别再动了，不然真的性命难保。")
	say("哈哈，我孤身一人，大仇已报，苟活在这世上也没什么意思。", 630)
	bgtalk("只见夏雪宜大笑三声，自绝经脉。")
	dark()
	null(-2, -2)
	light()
	say("唉，真是一个乖张到了极点的人....")
	addthing(333)
	addthing(40)
	addthing(121)
	addthing(156)	
	addevent(96, 9, 1, 1349, 1, 7042)
end

OEVENTLUA[1349] = function()
	say("少侠来我五仙教有何贵干？", 83)
	if hasthing(40) and hasthing(333) and hasthing(121) then	--武骧金星：修正判定代码为30金蛇锥的错误
		say("这是贵教的宝物，我依约前来归还，请教主放了何姑娘吧。")
		addthing(333, -1)
		addthing(40, -1)
		addthing(121, -1)	
		say("少侠果然是信人，只是教规严格，少侠必须破了我们的五仙阵才有资格让我们放了她。", 83)
		say("好，教主请。")
		JY.Person[83]["攻击力"] = 250
		JY.Person[83]["防御力"] = 150
		JY.Person[83]["轻功"] = 300		
		if WarMain(332) == false then
			instruct_15()
			do return end
		end
		say("少侠果然武功高强，我这就请红药出来。", 83)
		dark()
		addevent(96, 16, 0, 0, 0, 7042)
		light()
		say("你竟然真的来了....那他呢....", 176)
		say("他大仇得报，含笑去了。")
		say("那也好..念桥边红药..年年知为谁生，他经常对我念着这两句诗....", 176)
		say("何姑娘，放下他，也是放下自己。")
		say("....", 176)
		say("何红药听判，你盗取教中重宝，今把你逐出我五仙教，你可认罚？", 83)
		say("是....", 176)
		say("何姑娘，不如你先去我小村暂住吧。")
		say("好吧....我这就去小村。", 176)
		dark()
		null(-2, 16)
		setteam(176)
		light()
		say("少侠真是个善心人。你帮我们寻回了宝物，请收下这些东西聊表心意。", 83)
		addHZ(38)
		addHZ(6)
		addthing(174, 2000)
		addthing(259, 5)
		addthing(256, 2)
		addthing(257, 2)
		addthing(258, 2)
		addevent(96, 9, 1, 1350, 1, 7042)
		daode(3)
	else
		do return end
	end
end

OEVENTLUA[1350] = function()
	say("少侠来我五仙教有何贵干？", 83)
end

OEVENTLUA[1351] = function()
	for i = 4, 7 do
		addevent(108, i, 1, 678, 1, -2)
	end
	say3("听说金国完颜家的小王爷最近来北边巡视，排场大得很呢。", 122, "酒客")
	say3("金国最近蠢蠢欲动，也不知道会发生什么大事。", 124, "酒客")
	say3("管他的呢，我们照样喝我们的酒，来，干！", 122, "酒客")
	addevent(108, 10, 0, 1352, 3)
end

OEVENTLUA[1352] = function()
	dark()
	addevent(-2, 11, 0, 0, 0, 9398)
	addevent(-2, 18, 0, 0, 0, 8844)
	light()
	say("咦，那个不是穆姑娘么....不知道她一个人来这冰天雪地做什么。")
	instruct_25(7, 13, 13, 12)	
	say("那个是....当日的那个公子？锦袍绣带，难道他就是刚刚别人提到的完颜康？看穆姑娘千里迢迢从襄阳跟着他跟到这里....唉，又是一个痴人....")	
	dark()
	null(-2, -2)
	null(-2, 11)
	null(-2, 18)
	instruct_25(13, 12, 7, 13)	
	addevent(110, 20, 0, 1353, 3)
	addevent(110, 21, 0, 1353, 3)
	light()
end

OEVENTLUA[1353] = function()
	null(-2, 20)
	null(-2, 21)
	dark()
	addevent(-2, 17, 0, 0, 0, 9398)
	addevent(-2, 18, 0, 0, 0, 9402)
	addevent(-2, 19, 0, 0, 0, 8988)
	light()
	say("咦，前面的是....穆姑娘和那个公子？似乎他们在被人追杀？")
	say("妹子，我连累你了....", 616)
	say("大哥....", 635)
	say("等等！")
	if WarMain(339) == false then
		instruct_15()
		do return end
	end
	null(-2, 19)
	light()
	say("是你....", 616)
	say("（看他颓态尽现，怎么完全没有了当日飞扬跋扈的样子）穆姑娘，完颜公子，为何你们会被人追杀？")
	say("此事一言难尽....原来我不姓完颜，而姓杨....我生父是天波府杨家的人....", 616)
	say("（杨家？那岂不是金国的死敌....）")
	JY.Person[616]["姓名"] = "杨康"
	say("我自小被金国王爷收养，他待我如子，并不计较我的出身，我也从不知道自己的身份。", 616)
	say("谁知权力倾轧下，我的身世终于被有心人抖了出来，养父因而获罪，我也被迫出走....", 616)
	say("如今金国人视我为大敌，南人却又视我为叛逆....天大地大，岂有我容身之处....", 616)
	say("只有你..在我身边不离不弃....念慈....", 616)
	say("杨大哥....", 635)
	say("（唉，又是一对落难鸳鸯）既然如此，两位来我小村吧，有南贤北丑两位圣人在，我保证两位不会受到伤害。")
	say("..好，少侠以德报怨，在下感激不尽。我们这就去小村。", 616)
	dark()
	null(-2, 17)
	null(-2, 18)
	light()
	setteam(616)
	setteam(635)	
end



--[[
	
	189 萧
	77 慧
	650 卓
	625 yuan
鸳鸯刀袁萧线
	河洛客栈 - 单挑卓天雄救萧中慧，对话后加入
	树林 - 群殴卓天雄+小兵，袁冠南加入
	得到鸳刀+鸯刀去无名岛开门，队伍里有萧袁则萧+袁挑萧半和，可败，胜则洗夫妻刀法，得夫妻刀法+鸳鸯刀书+武器

鸳鸯刀阿九线
	树林 - 太岳四侠抢东西，教训之，得到此地有镖经过
	河洛客栈 - 打听到青竹帮要劫镖
	树林 - 青竹帮与官兵对峙，群殴官兵+卓天雄
	河洛客栈 - 帮阿九采药，得到鸯刀，阿九加入
	树林 - 太岳四侠与卓天雄对峙，群殴大内高手+卓天雄，得鸳鸯刀书+武器
	喀丝丽支线：
	回族部落 - 与回人得知喀丝丽的下落
	龙门客栈 - 如果队伍里有张昭重和阿九，群殴大内高手，喀丝丽加入
]]

OEVENTLUA[22] = function()
	instruct_3(-2, -2,-2,0,0,0,0,3500,3500,3500,-2,-2,-2)
	instruct_2(303, 1)
end

OEVENTLUA[201] = function()
	instruct_3(-2, -2,1,0,0,0,0,3500,3500,3500,-2,-2,-2)
	instruct_2(305, 1)
end

OEVENTLUA[208] = function()
	instruct_3(-2, -2,1,0,0,0,0,3500,3500,3500,-2,-2,-2)  
	instruct_26(1,3,1,0,0) 
	instruct_26(1,4,1,0,0) 
	instruct_26(1,5,1,0,0) 
	instruct_2(157, 1)  
end

OEVENTLUA[200] = function()
	say("恕在下鲁莽，姑娘似乎面有难色？")
	say("你在这附近有没有见到过一个老乞丐？", 77)
	say("啊？")
	dark()
	addevent(-2, 31, 0, 0, 0, 3132*2)
	light()
	say("小丫头，看你能跑到哪里去！", 650)
	say("这位老丈，有话好好说....")
	say("哪里来的小子，滚！", 650)
	if WarMain(343) == false then
		instruct_15()
		do return end		
	end
	null(-2, 31)
	light()
	say("那老乞丐好狠辣的出手，但不像是丐帮的武功。")
	say("你猜对了，那老乞丐是大内十大高手之一的卓天雄。", 77)
	say("原来是他！可是他为何要与姑娘你为难？")
	say("这事说来话长，我叫萧中慧，我爹叫萧半和。", 77)
	say("原来你是晋阳大侠的千金。")
	say("嗯，我爹爹最近要过六十大寿，所以我与我..义兄..决定为他老人家寻得一份罕见的寿礼。", 77)
	say("我们两人本来找到了一对鸳鸯宝刀，可是回去的路上碰上了那个姓卓的，他看中了这对刀，一定要抢去献给朝廷。我们又打不过他，只能逃了，可是途中却失散了....", 77)	
	say("（看萧姑娘着急又脸红的样子，不只是义兄这么简单吧....）")	
	say("原来如此，姑娘别慌，我愿意替你寻找你的那位义兄。")
	say("太好了！那就有劳了。", 77)
	teammate(77)
	addHZ(89)
	addevent(109, 0, 0, 1358, 3)
	addevent(109, 1, 0, 1358, 3)
end

OEVENTLUA[207] = function()
	if hasppl(625) and hasppl(77) then
		say("爹爹！？", 77)
		say("岳丈！？冠南拜见岳丈大人！", 625)
		say("爹爹！你怎么在这里？", 77)
		say("傻丫头，这对鸳鸯刀本来就是我至交的遗物，其中的秘密我也早已知晓。", 189)		
		say("我知道你有心想寻得这对宝刀为我贺寿，可是又放心不下，于是就出来找你们。不过爹爹还是小看了你们两个，你们竟然能找到这里来，看来这次的江湖历练对你们大有益处。来，让我看看你们的本事长了多少。", 189)
		if WarMain(347) then
			light()
			addHZ(124)
			tb("萧中慧和袁冠南习得夫妻刀法！")
			instruct_35(77, 0, 62, 0)
			instruct_35(625, 0, 62, 0)
		else
			light()
		end		
		say("爹爹，你又欺负人！", 77)
		say("哈哈，长江后浪推前浪，爹爹老咯！", 189)
		say("这些东西我一介糟老头子也用不着，就留给你们这些后生吧，我去也。", 189)	
		dark()
		instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)
		light()
		addthing(250)
		addthing(140)
	elseif hasppl(77) then
		say("爹爹！？", 77)
		say("你终于找到这里来了，其实这是我特意给你布下的试炼，看来这次的江湖历练让你受益不少。这些东西就给你吧。", 189)	
		dark()
		instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)
		light()
		addthing(250)		
	elseif hasppl(625) then
		say("岳丈！？冠南拜见岳丈大人！", 625)
		say("你终于找到这里来了，其实这是我特意给你布下的试炼，看来这次的江湖历练让你受益不少。这些东西就给你吧。", 189)	
		dark()
		instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)
		light()
		addthing(250)		
	else
		say("这里不是你该来的地方，速速离去。", 189)
	end
end

OEVENTLUA[1358] = function()
	null(-2, 0)
	null(-2, 1)
	dark()
	addevent(-2, 2, 0, 0, 0, 3132*2)
	addevent(-2, 3, 0, 0, 0, 3157*2)
	light()
	say("那是....袁大哥！", 77)
	say("慧妹？！你怎么在这里！", 625)
	say("哼，来得正好！省了我一个个找的功夫！快点把鸳鸯刀交出来！", 650)
	say("慧妹小心！", 625)
	if WarMain(344) == false then
		instruct_15()
		do return end		
	end
	null(-2, 2)
	addevent(-2, 3, 0, 0, 0, 3154*2)
	light()	
	say("慧妹，你没事吧！", 625)	
	say("我没事，幸好有这位少侠一路保护我。", 77)	
	say("兄台仗义出手，袁冠南感激不尽。", 625)	
	say("袁兄客气了，卓天雄随时都有可能回来，我们快点走吧。")	
	say("好。这段日子我已经查清楚了，这对宝刀牵涉到一个秘密，所以朝廷才会如此紧张。这个秘密就藏在北方的一个小岛上。", 625)	
	say("既然如此我们还等什么，快点走吧！", 77)	
	teammate(625)
	addHZ(57)
	null(-2, 3)
end

OEVENTLUA[1359] = function()
	null(1, 19)
	null(-2, 0)
	null(-2, 1)
	SetS(111,2,0,0,1)
	say("咦，前面怎么有人在喊救命？")
	walkme(32, 31)
	dark()
	addevent(-2, 6, 0, 0, 0, 3183*2)
	addevent(-2, 5, 0, 0, 0, 3184*2)
	addevent(-2, 7, 0, 0, 0, 3186*2)
	addevent(-2, 8, 0, 0, 0, 3185*2)
	light()
	say("哈哈，终于有人上当了！", 653)
	say("你们....你们是什么人？")
	say("我们是什么人？问得好！", 654)	
	say("你小子听了可别吓到！我乃人称劈天裂地，轰天槌雷震天！", 651)	
	say("我乃挑五虎，斩六蛟，日月大刀贾云长！", 652)	
	say("我乃人称无形拳，迷踪腿，万夫莫敌赛飞鸿！", 653)	
	say("我乃来无影，去无踪，急如律令，人称快捷一阵风的赵惊风！", 654)	
	bgtalk("我们是，五岳四龙！！！哈哈哈哈哈......")
	say("..........")
	say("老大，他好像被人我们吓傻了....怎么办？", 652)	
	say("我们是义贼，把东西抢了然后把他放了就好。", 651)	
	say("讲了半天原来是拦路抢劫的，找打！")
	if WarMain(345) == false then
		instruct_15()
		do return end		
	end	
	light()
	say("少侠饶命啊，我们再也不敢了！", 651)
	say("这点功夫也敢来拦路抢劫....")
	say("少侠有所不知，晋阳大侠萧半和萧大侠最近要过六十大寿，我们四个想上门祝寿可是没钱买寿礼....所以只好出此下策....", 653)
	say("原来如此，萧大侠素有侠名，你们怎么能用抢到的东西去贺寿呢！")
	say("少侠说得太有道理了，我们再也不敢了！", 653)	
	say("为了表示歉意，我们愿意贡献一个消息。听说鸳鸯宝刀重现江湖，被此地官府得到了，如今正在大内十大高手之一的卓天雄的护送下送往朝廷。", 654)
	say("据说官府为了抢到这对宝刀，追杀了数个义士好汉，此等不义之财，我们兄弟本来是准备取之而快的。如今见少侠武功高强，义薄云天，这等好事就留给少侠你吧。", 652)	
	say("（凭他们几个去抢卓天雄的东西，能到手才怪）好吧，我知道了，你们几个快点离开这里吧。")
	say("谢谢少侠。兄弟们，撤！", 651)	
	dark()
	for i = 5, 8 do null(-2, i) end
	light()
	say("这卓天雄恶名昭彰，坏一下他的好事也不妨。我还是到附近客栈打听下消息吧。")
	addevent(1, 31, 1, 1360, 1, 3019*2)
	addevent(1, 19, 1, 1360, 1, 3020*2)
	addevent(1, 32, 0, 1360, 3)
end

OEVENTLUA[1360] = function()
	say("卓天雄还有几天就要经过这附近了，也不知道大当家作好准备了没有....",206,0,"青竹帮弟子") 
	say("嘘，小声点，隔墙有耳....我们还是快上路吧。",208,0,"青竹帮弟子") 
	dark()
	null(-2, -2)
	null(1, 31)
	null(1, 19)	
	light()
	say("怎么跟青竹帮也扯上关系了？")
	addevent(109, 0, 0, 1361, 3)
	addevent(109, 1, 0, 1361, 3)
end

OEVENTLUA[1361] = function()
	null(-2, 0)
	null(-2, 1)
	dark()
	addevent(-2, 9, 0, 0, 0, 3019*2)
	addevent(-2, 10, 0, 0, 0, 3019*2)
	addevent(-2, 6, 0, 0, 0, 2570*2)
	addevent(-2, 11, 0, 0, 0, 4584*2)	
	addevent(-2, 7, 0, 0, 0, 4445*2)	
	addevent(-2, 12, 0, 0, 0, 3049*2)	
	addevent(-2, 13, 0, 0, 0, 3049*2)	
	light()
	say("前面有兵器相击的声音，看来青竹帮与官兵已经打起来了。")	
	walkme(37, 31)
	say("青竹帮好大的胆子，朝廷的东西你们也敢要！", 650)
	say("嘿嘿，这种不义之财，若是落在别人身上也就罢了，可就是不能落在你这走狗身上！",167,0,"程青竹") 
	say("哼！大家上！", 650)
	bgtalk("只见官贼混战，不断有人倒下，只是抬眼望去其中竟然有一姑娘，容色清丽，俊雅无俦，端的是画儿一样")
	say("没想到一个小帮派中却竟然有这样的人物。")
	say("着！", 650)
	say("啊，好个贼子，竟然放毒！",167,0,"程青竹") 
	say("师傅！", 629)
	say("小人！")
	if WarMain(344) == false then
		instruct_15()
		do return end		
	end	
	null(-2, 7)
	null(-2, 12)
	null(-2, 13)
	light()	
	say("多谢少侠出手相助，只可惜让那贼子跑了。",167,0,"程青竹") 	
	say("程帮主客气了，那鸳鸯刀....")
	say("哈哈，程某要劫那鸳鸯刀只是为了给卓天雄找麻烦，宝刀虽好，却与我无用，如果少侠最后得到了宝刀，程某应该恭喜才是。",167,0,"程青竹") 
	say("师傅，你受了伤，还是快点去客栈疗伤吧。", 629)
	say("好，我们走吧。少侠保重。",167,0,"程青竹") 
	dark()
	for i = 0, 13 do null(-2, i) end
	light()
	addevent(1, 31, 1, 1362, 1, 4584*2)
end

OEVENTLUA[1362] = function()
	say("少侠好，当日阿九没有机会当面拜谢少侠，心中一直难安。", 629)
	say("阿九姑娘言重了，不知程帮主身体恢复得怎样了？")
	say("师傅正在养伤中，帮中的药不够了，所以我出来采办，可是却买不到需要的草药....", 629)
	say("如果有在下能效劳的地方，请尽管说。")
	say("那太好了，这附近有几种我需要的药，请少侠帮忙采来吧。", 629)
	say("好。")
	--local win = plant(-1, 1, 1)
	--if win then
		say("太好了，我这就叫人把这些草药送回去。", 629)	
		say("姑娘你不自己跑一趟？")
		say("师傅说了，如果能再见到少侠，则一定要我助少侠一臂之力，所以请多多关照了，嘻嘻。", 629)	
		say("（怎么好像我被卖了？）")
		teammate(629)
	--else
	--	say("就差一点，没够着....")
	--	say("没关系，我再去别的地方看看，少侠请保重。", 629)	
	--	say("姑娘保重。")
	--	dark()
	--	null(-2, -2)
	--	light()
	--end	
	addevent(109, 0, 0, 1363, 3)
	addevent(109, 1, 0, 1363, 3)
end

OEVENTLUA[1363] = function()
	null(-2, 0)
	null(-2, 1)
	dark()
	addevent(-2, 6, 0, 0, 0, 3183*2)
	addevent(-2, 5, 0, 0, 0, 3184*2)
	addevent(-2, 7, 0, 0, 0, 3186*2)
	addevent(-2, 8, 0, 0, 0, 3185*2)
	addevent(-2, 4, 0, 0, 0, 4445*2)
	light()		
	say("前面的是....那四个活宝？")
	walkme(37, 31)
	say("你们是什么人？", 650)
	say("我们是什么人？问得好！", 654)	
	say("你小子听了可别吓到！我乃人称劈天裂地，轰天槌雷震天！", 651)	
	say("我乃挑五虎，斩六蛟，日月大刀贾云长！", 652)	
	say("我乃人称无形拳，迷踪腿，万夫莫敌赛飞鸿！", 653)	
	say("我乃来无影，去无踪，急如律令，人称快捷一阵风的赵惊风！", 654)	
	bgtalk("我们是，五岳四龙！！！哈哈哈哈哈......")	
	say("（又来了....）")
	say("装神弄鬼，找死！", 650)
	say("啊啊，等等！救命啊！！", 651)	
	say("别慌，有我在！")
	if WarMain(346) == false then
		instruct_15()
		do return end		
	end	
	null(-2, 4)
	light()		
	addthing(250)
	say("这对宝刀终于到手了。")
	say("少侠！！你的救命之恩，我们没了牙齿也忘不了啊！", 651)	
	say("这是我们趁乱从卓天雄身上偷出来的，就送给少侠您了！", 652)	
	say("少侠您的精神与我们同在！", 653)	
	say("少侠您的事迹与时光一同流传！", 654)	
	say("..........")
	dark()
	for i = 0, 13 do null(-2, i) end
	light()
	addthing(157)
	addHZ(25)
end

OEVENTLUA[232] = function() --书剑邪线香香加入
	instruct_26(60,8,1,0,0)  
	instruct_26(60,9,1,0,0)  
	instruct_26(60,7,1,0,0)  
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  
	instruct_30(24,39,24,32)  
	TalkEx("此书乃我回教圣物，决不允许外人拿走。", 74, 0)  	
	TalkEx("＜书？难道是天书？＞", 0, 1)  	
	TalkEx("这是当今皇上的圣旨，谁敢不从！", 208, 0)  	
	TalkEx("＜原来是官兵……＞", 0, 1)  
	TalkEx("哼，我们远在回疆，向来独立，皇帝是你们的，与我回人何干？我们回人但有一口气在，也要誓死保护自己的圣物。", 74, 0)  
	TalkEx("哼，臭丫头，敬酒不吃吃罚酒，那就别怪我们不客气了。", 208, 0)  
	TalkEx("＜一边是官兵，一边是百姓，我该帮哪一方呢？该帮助回人么？＞", 0, 1)  
	if instruct_11() then  
		instruct_37(2)  
		TalkEx("你们这些官兵，总是欺压老百姓，我早就看不过眼了！", 0, 1)  		
		TalkEx("哪来的不开眼的小子，活的不耐烦了！", 208, 0)  		
		if WarMain(141, 0) == false then  
			instruct_15() 			
			do return end 
		else
			instruct_3(-2, 13,0,0,0,0,0,6094,6094,6094,-2,-2,-2)  
			instruct_3(-2, 23,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 22,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 21,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 20,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 19,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 18,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 17,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 16,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 15,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 14,0,0,0,0,0,0,0,0,-2,-2,-2)  			
			instruct_13() 		
			TalkEx("多谢少侠助我族人保护圣物。", 74, 0)  		
			TalkEx("路见不平，拔刀相助，姑娘太客气了。刚才听姑娘说，这圣物是一本书？", 0, 1)  		
			TalkEx("不瞒恩公，这是回教的圣经《可兰经》。", 74, 0)  			
			TalkEx("哦。＜原来不是天书啊＞", 0, 1)  		
			instruct_14()  
			instruct_3(-2, 25,0,0,0,0,0,7006,7006,7006,-2,-2,-2)  
			instruct_3(-2, 16,0,0,0,0,0,5972,5972,5972,-2,-2,-2)  
			instruct_3(-2, 29,0,0,0,0,0,6056,6056,6056,-2,-2,-2)  
			instruct_3(-2, 31,0,0,0,0,0,6068,6068,6068,-2,-2,-2)  
			instruct_3(-2, 30,0,0,0,0,0,5890,5890,5890,-2,-2,-2)  
			instruct_3(-2, 32,0,0,0,0,0,6784,6784,6784,-2,-2,-2)  			
			instruct_13()  
			TalkEx("少侠好身手！", 75, 0)  		
			TalkEx("过奖，这位公子怎样称呼？", 0, 1)  		
			TalkEx("在下姓陈，名家洛。这是我们红花会的众位兄弟。", 75, 0)  		
			TalkEx("原来是红花会陈当家。久仰红花会大名，今日一见，果然英雄了得。", 0, 1)  			
			TalkEx("少侠过奖。", 75, 0)  		
			TalkEx("却不知红花会群豪为何来此？", 0, 1)  		
			TalkEx("我们的红花会的四当家文泰来被官兵所擒，我们一路跟踪这群官兵而来。适才本要出手相助，但见少侠身手不凡，我们也就不必多此一举了。", 75, 0)  		
			TalkEx("原来陈公子也是要助我回部，青桐在此谢过。", 74, 0)  		
			TalkEx("<哎，脸红了？>", 0, 0)  			
			TalkEx("总舵主，我们搜查一遍，没发现文四弟。", 152, 0)  		
			TalkEx("把那个带头的官兵抓来问问。", 75, 0)  		
			TalkEx("是。快说，你们把文四弟藏到哪了？", 152, 0)  		
			TalkEx("唉呦，唉呦，……轻点……，我说，我说，那位文，文……，文大侠已经被我们张大人押往死囚牢了。", 208, 0)  		
			TalkEx("哪个张大人？", 75, 0)  	
			TalkEx("是，是，张，张召重，张大人。", 208, 0)  	
			TalkEx("这张召重武功非比寻常，一路柔云剑术出神入化，我们需得小心行事。", 153, 0)  	
			TalkEx("哼，那正好，我要和他比比剑法！", 152, 0)  		
			TalkEx("我们还有要事在身，就不在此打扰了，霍姑娘，在下告辞了。", 75, 0)  				
			instruct_14()  
			instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 31,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  
			
			instruct_3(8, 20,1,0,237,0,0,7006,7006,7006,-2,-2,-2)  
			instruct_3(8, 19,1,0,237,0,0,5972,5972,5972,-2,-2,-2)  
			instruct_3(8, 16,1,0,237,0,0,6056,6056,6056,-2,-2,-2)  
			instruct_3(8, 17,1,0,237,0,0,6068,6068,6068,-2,-2,-2)  
			instruct_3(8, 18,1,0,237,0,0,5890,5890,5890,-2,-2,-2)  
			instruct_3(8, 22,1,0,237,0,0,6784,6784,6784,-2,-2,-2)  
			instruct_13()
			do return end
		end
	else
		instruct_37(-2)  
		TalkEx("俗话说民不与官斗。我还是帮着官兵好了。", 0, 1)  		
		instruct_14()  
		instruct_3(-2, 28,0,0,0,0,0,7006,7006,7006,-2,-2,-2)  
		instruct_3(-2, 29,0,0,0,0,0,6056,6056,6056,-2,-2,-2)  
		instruct_3(-2, 31,0,0,0,0,0,6068,6068,6068,-2,-2,-2)  
		instruct_3(-2, 30,0,0,0,0,0,5890,5890,5890,-2,-2,-2)  
		instruct_3(-2, 32,0,0,0,0,0,6784,6784,6784,-2,-2,-2)  
		instruct_3(-2, 27,0,0,0,0,0,5972,5972,5972,-2,-2,-2)  	
		instruct_13()  
		TalkEx("回民弟兄们莫慌，我来助你们。道长、赵三哥，你们去帮助回民杀官兵，其他人跟我来，对付这个小子。", 75, 0)  		
		if WarMain(138, 0) == false then  
			instruct_15() 
			do return end  
		else	
			instruct_13()   
			TalkEx("好厉害，我们先避其锋芒，走！", 75, 0)  
			instruct_14()  
			instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 31,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  
			instruct_3(-2, 13,0,0,0,0,0,6094,6094,6094,-2,-2,-2)  		
			instruct_13()  
			TalkEx("小子，你功夫不错嘛。要不是你，今天恐怕还有些麻烦。", 208, 0)  	
			TalkEx("多谢军爷称赞。却不知军爷到此是为了什么？", 0, 1)  	
			TalkEx("回部听着，皇上有旨，交出其圣物《可兰经》。", 208, 0)  	
			TalkEx("你们一定会被真主阿拉惩罚的！", 227, 1)  	
			TalkEx("你小子武功不错，我们张大人一定会很欣赏你的。现在红花会这帮反贼闹得厉害，我们张大人抓住了他们得一个匪首，姓文的，关押在死囚牢。红花会这帮人肯定要去闹事，小兄弟这么好的功夫，不如和我们一起去报效朝廷吧。", 208, 0)  	
			TalkEx("多谢军爷栽培。", 0, 1)  	
			instruct_14() 
			instruct_3(-2, 13,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 23,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 22,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 21,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 20,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 19,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 18,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 17,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 16,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 15,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 14,0,0,0,0,0,0,0,0,-2,-2,-2)  
			instruct_3(-2, 0,1,0,234,0,0,-2,-2,-2,-2,-2,-2)  
			instruct_3(-2, 1,1,0,235,0,0,-2,-2,-2,-2,-2,-2)  
			instruct_3(-2, 2,1,0,235,0,0,-2,-2,-2,-2,-2,-2)  
			instruct_3(8, 0,1,0,241,0,0,-2,-2,-2,-2,-2,-2)  
			instruct_3(8, 1,1,0,241,0,0,-2,-2,-2,-2,-2,-2)  
			instruct_13()  
			addevent(-2, 33, 1, 1364, 1, 6806)
			do return end
		end
	end
end

OEVENTLUA[1364] = function()
	say("我族的香香公主被皇帝看上，朝廷来要人呢。本来族人是准备誓死不从的，结果那个叫陈什么舵主的来跟香香公主密谈了许久，然后公主就自愿进京了....唉，可惜了一朵鲜花啊....",193,0,"回族居民") 
	addevent(60, 31, 0, 1365, 3)
end

OEVENTLUA[1365] = function()
	if hasppl(629) then
		null(-2, -2)
		null(17, 33)
		dark()
		addevent(-2, 34, 0, 0, 0, 4703*2)
		addevent(-2, 32, 0, 0, 0, 4452*2)
		addevent(-2, 33, 0, 0, 0, 4452*2)
		light()
		say("你们想做什么！", 628)
		say("公主，对不起了，太后密令，不能让你进京....",208,0,"官兵") 
		say("他们这是在干什么？")
		say("是太后怕香香公主进京之后，会成为另一个倾覆家国的祸水吧....嘿，前朝之鉴，还真是有先见之明。", 629)
		say("......阿九姑娘？")
		say("自古美人如名将，不许人间见白头....红颜却是白骨，又有几人能放弃得了江山，这太后和皇帝不是东西，那姓陈的也不是东西。", 629)
		say("我们出手吧？")
		say("嗯。", 629)
		if WarMain(141) == false then	--武骧金星：这里战斗场景代码错了，347是夫妻二人合战萧半和
			instruct_15()
			do return end		
		end	
		null(-2, 32)
		null(-2, 33)
		light()
		walkme(41, 17)
		say("姑娘，别怕。", 629)
		say("你是....？", 628)
		say("和你一样，都算是落难的公主吧....来，我帮你收拾一下。", 629)
		say("嗯....", 628)
		dark()
		light()
		say("你如今不能回家，也不能进京了，跟我们一起走吧。", 629)
		say("好....", 628)	
		say("那....香香公主....")
		say("别叫我公主了，我叫喀丝丽。", 628)
		addHZ(77)
		teammate(628)	
		null(-2, 34)		
	end
end

OEVENTLUA[1354] = function()
	say3("唉..真是让人担心....", 123, "宋远桥")
	say("宋大侠可是有何难处？")
	say3("我俞三弟下山多日还没有音讯，但恩师百岁大寿将至，山上俗物繁琐，我却无法抽身。", 123, "宋远桥")
	say("宋大侠放心，在下可以帮忙探听俞三侠的消息。")
	say3("那就有劳少侠了。", 123, "宋远桥")
	addevent(112, 21, 0, 1355, 3)
	addevent(-2, -2, -2, 1357, 1)
	null(92, 0)
	null(92, 1)
	null(92, 2)	
	null(72, 4)	
end

OEVENTLUA[1355] = function()
	dark()
	null(-2, -2)
	addevent(-2, 22, 0, 0, 0, 2720*2)
	addevent(-2, 23, 0, 0, 0, 4493*2)
	light()
	say("咦？前面有人倒在地上..看那服色，难道是武当派的？")
	say("住手！")
	if WarMain(340) == false then
		instruct_15()
		do return end
	end
	null(-2, 23)
	instruct_30(38, 50, 40, 48)
	say("这位兄台，你没事吧？")
	say3("多谢少侠....我是武当的俞岱岩....", 192, "俞岱岩")
	say("啊，原来你就是俞三侠！武当的人正在四处找你呢！我这就送你回武当。")
	say3("多谢少侠辛苦....", 192, "俞岱岩")
	dark()
	null(-2, 22)
	addevent(43, 35, 1, 1356, 1, -2)
	light()
end

OEVENTLUA[1356] = function()
	dark()	
	light()
	say3("三弟？你怎么会伤得这么重！", 123, "宋远桥")
	say3("这事说来话长..我被人暗算..如今四肢皆废..恐怕....", 192, "俞岱岩")
	say3("三弟....别担心，好好养伤，我们一定会想出办法的....", 123, "宋远桥")
	dark()
	light()
	say3("多谢少侠救了我三弟，这一路辛苦你了。如不嫌弃，请收下这本秘笈。", 123, "宋远桥")
	say("多谢宋大侠。")
	addthing(271)
	daode(3)
	addevent(43, 35, 1, 1357, 1, -2)
	say("宋大侠似乎还面有难色？不妨说出来一听。")
	say3("我张五弟数年前下山后一直没回来，想来已凶多吉少，多年来我们一直在找他，可是....", 123, "宋远桥")
	say("帮人帮到底，在下义不容辞。")
	say3("那就有劳少侠了。", 123, "宋远桥")
	addevent(40, 63, 1, 1366, 1, 6566)
	addevent(40, 64, 1, 1366, 1, 6568)
	addevent(40, 65, 1, 0, 0, 6570)
end

OEVENTLUA[1357] = function()
	say3("那就有劳少侠了。", 123, "宋远桥")
end

OEVENTLUA[249] = function()
	TalkEx("真儿，他就是我们的恩公张*翠山的儿子，你以后要好好*待他，就像亲弟弟一样。", 165, 0)  --对话
	Cls()  --清屏
	TalkEx("无忌，以后你就是我的亲弟*弟，姐姐疼你。", 81, 0)  --对话
	Cls()  --清屏
	TalkEx("姐姐……你待我真好……", 9, 0)  --对话
	Cls()  --清屏
	TalkEx("无忌这孩子真可怜，父母都*死了，唉，在这世上已经没*什么亲人了。", 165, 0)  --对话
	Cls()  --清屏
	TalkEx("不，我还有义父，他双目失*明，一个人住在冰火岛，孤*苦伶仃的，咱们去把他接来*吧。", 9, 0)  --对话
	Cls()  --清屏
	TalkEx("也好，咱们这就打点行装，*过两天就动身，把谢法王接*回来。", 165, 0)  --对话
	Cls()  --清屏
	null(43, 35)
	instruct_3(-2, 15,0,0,0,0,250,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 16,0,0,0,0,250,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, -2,1,0,251,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
end

OEVENTLUA[1366] = function()
	say("听说武当张翠山张五侠和天鹰教的大小姐殷素素在数月前同时与金毛狮王谢逊不知所踪，那把屠龙刀也从此下落不明。", 204, 0, "酒客")
	say("我还听说据当日从王盘山下来的人说，他们似乎是乘船往东北去了。", 203,  0, "酒客")
	say("如今不止武当和天鹰教，连所有大小门派都在寻找三人踪迹，就是为了那把屠龙刀呢。", 204, 0, "酒客")
	say("那老兄我们还等什么，快去找艘船吧。", 203,  0, "酒客")
	dark()
	null(40, 63)
	null(40, 64)
	null(40, 65)
	light()
	openplace(72)
	addevent(72, 0, 0, 1367, 3)
	addevent(72, 1, 0, 1367, 3)
end

OEVENTLUA[1367] = function()
	dark()
	null(-2, 0)
	null(-2, 1)
	addevent(-2, 2, 0, 0, 0, 2646*2)
	light()
	say("谁？？！", 13)
	if WarMain(261) then
		addthing(69)
	end
	dark()
	addevent(-2, 8, 0, 0, 0, 2694*2)
	addevent(-2, 9, 0, 0, 0, 3042*2)
	addevent(-2, 10, 0, 0, 0, 4622*2)
	light()
	say("谢狮王等等！在下是受武当宋大侠之托来寻找张五侠的。")
	say3("大师兄他们还在找我？素素....", 395, "张翠山")
	say3("我们迟早还是要回去的....为了无忌....", 358, "殷素素")
	say("娘，我们要去哪里？", 9)
	say3("爹娘要带你回中土，让你的太师父和外公看看我们的无忌。", 358, "殷素素")
	say("三位这就跟着在下的船回去吧。")
	say("不，我待在这里。", 13)
	say3("大哥！", 395, "张翠山")
	say("我意已决，不必多说。小子，如果你敢泄露我的行踪，我绝对不会放过你的。", 13)
	say("狮王放心。我们这就走吧。")
	say3("那大哥保重。", 395, "张翠山")
	
	null(-2, 2)
	for i = 8, 10 do null(-2, i) end
	transferme(40, 32, 48, 0)	
	say("这里已离武当山不远，我已经请人送信过去，相信很快就会有人来接两位的。")
	say3("这一路有劳少侠了。", 395, "张翠山")
	say3("这里有我天鹰教的一本秘笈，请少侠笑纳。", 358, "殷素素")
	addthing(326)
	say("谢谢张夫人。我们在前面客栈歇息片刻再继续往前走吧。")
	dark()
	addevent(-2, 66, 0, 0, 0, 4505*2)
	addevent(-2, 67, 0, 0, 0, 3993*2)
	light()
	say("慢着！先把谢逊的所在说出来，否则别想离开此地！", 643)
	if WarMain(348) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	null(-2, 66)
	null(-2, 67)
	light()
	say3("无忌！无忌！！", 358, "殷素素")
	bgtalk("殷素素心系爱子，没命的追赶，但那两人轻身功夫极高，越追越远，到后来只见远处大道上两个黑点，转了一个弯，再也瞧不到了。")
	say("张夫人快回来，咱们从长计议....那些人功夫高得很，决不会伤害小孩。")
	say3("他掳去无忌，定是要逼问义兄的下落，不知无忌肯不肯说", 358, "殷素素")
	say3("无忌倘若说了出来，还能是我们的孩儿么？", 395, "张翠山")
	say3("对！他一定不会说的....可是....可是....他们必定会逼他打他....", 358, "殷素素")
	say("如今只有两位快马赶到武当山找武当诸侠帮忙寻找，在下殿后，随后就到。")
	say3("好，少侠小心。素素我们走。", 395, "张翠山")
	dark()
	addevent(43, 35, 1, 1368, 1)
	light()
end

OEVENTLUA[1368] = function()
	say("宋大侠！张五侠他们可有回来？")
	say3("唉，少侠晚来一步....五弟他已经....", 123, "宋远桥")
	say("啊？怎么会？")
	say3("五弟和五妹上山之后，各大小门派分别上门追问谢逊的下落，五弟他为了义气，当众自刎以谢众人，五妹她接着也跟着去了....唉....", 123, "宋远桥")
	say3("可怜五弟他命途坎坷，唯一一个儿子又下落不明....", 123, "宋远桥")
	say("无忌被抓我也有责任，我这就去把他找回来。")
	say3("再次劳烦少侠辛苦，这本剑法就作为酬劳吧。", 123, "宋远桥")
	addthing(272)
	addthing(346)
	if PersonKF(zj(), 166) and GetS(113,0,0,0) == 0 then 
		say3("少侠请留步。", 123, "宋远桥")
		say("宋大侠！还有何事需要在下去做的？")
		say3("五弟与五弟妹临终前希望少侠务必救出他们苦命的孩子，无忌！", 123, "宋远桥")
		say("宋大侠请放心，我一定会救出无忌的！")
		say3("这本精要是五弟妹让我转交予少侠。", 123, "宋远桥")
		if yesno("是否要学？") then 
	        QZXS("领悟蚊须针！")
	        say("宋大侠请放心，我一定会救出无忌的!") 
	        instruct_0();
	        SetS(113, 0, 0, 0,166)
        end
	end
	addevent(43, 35, 1, 1357, 1, -2)
	addevent(33, 0, 0, 1369, 3)
	addevent(33, 1, 0, 1369, 3)
end

OEVENTLUA[1369] = function()
	null(-2, 0)
	null(-2, 1)
	dark()
	addevent(-2, 29, 0, 0, 0, 2662*2)
	light()
	bgtalk("只见眼前一名白袍男子抱着一个峨嵋弟子在屋子里绕圈，灭绝师太在后面急追，连刺数剑，但总是差了尺许，始终刺不到他身上。")
	say("（这人好高的轻功！难道就是那好吸人血的青翼蝠王？）把人放下！")
	local win = false
	if WarMain(349) then
		win = true
	end
	null(-2, 29)
	light()
	if win then
		say("峨嵋派居然有这等人才，灭绝老尼了不起啊。", 14)
		say("嘿，我峨嵋派哪有这样的人才？小子，我从不欠人人情，这本掌法给你！", 6)
		addthing(267)
	end
	say("请问师太，韦蝠王为何会在这峨嵋出现？")
	say("哼，六大门派围剿光明顶，势在必得。小子，你既然不是魔教妖人还是置身事外的好。", 6)
	say("久闻明教倒行逆施，在下愿意出一份薄力。")
	say("随便你，只要不挡在我倚天剑前面就好！", 6)
	addevent(-2, 2, -2, 1370, 1)
	addevent(34, 1, 1, 1371, 1, 5404)
	addevent(68, 3, 1, 1372, 1, 5412)
	addevent(68, 13, 1, 1372, 1, 5412)
	instruct_17(11,1,29,47,0)
	addevent(11, 0, 0, 1373, 3)
end

OEVENTLUA[1370] = function()
	say("六大门派围剿光明顶，势在必得。", 6)
end

OEVENTLUA[1371] = function()
	say("六大门派围剿光明顶，势在必得。", 350)
end

OEVENTLUA[1372] = function()
	say("六大门派围剿光明顶，势在必得。", 340)
end

OEVENTLUA[1373] = function()
	null(-2, -2)
	dark()
	instruct_3(11,65,1,0,0,0,0,5430,5430,5430,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [65]
    instruct_3(11,66,1,0,0,0,0,5436,5436,5436,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [66]
    instruct_3(11,67,1,0,0,0,0,5432,5432,5432,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [67]
    instruct_3(11,68,1,0,0,0,0,5440,5440,5440,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [68]
    instruct_3(11,69,1,0,0,0,0,5444,5444,5444,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [69]
    instruct_3(11,70,1,0,0,0,0,5432,5432,5432,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [70]
    instruct_3(11,3,1,0,0,0,0,2671*2,2671*2,2671*2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [3]
    instruct_3(11,113,1,0,0,0,0,2659*2,2659*2,2659*2,-2,-2,-2)
	instruct_3(11,114,1,0,0,0,0,2663*2,2663*2,2663*2,-2,-2,-2)
	instruct_3(11,6,1,0,0,0,0,5334,5334,5334,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [6]
    instruct_3(11,7,1,0,0,0,0,5348,5348,5348,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [7]
    instruct_3(11,8,1,0,0,0,0,5364,5364,5364,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [8]
    instruct_3(11,9,1,0,0,0,0,5378,5378,5378,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [9]
    instruct_3(11,10,1,0,0,0,0,5362,5362,5362,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [10]
    instruct_3(11,11,1,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [11]
    instruct_3(11,12,1,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [12]
    instruct_3(11,18,1,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [18]
    instruct_3(11,17,1,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [17]
    instruct_3(11,16,1,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [16]
    instruct_3(11,15,1,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [15]
    instruct_3(11,14,1,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [14]
    instruct_3(11,13,1,0,0,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [13]
    instruct_3(11,19,1,0,0,0,0,5434,5434,5434,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [19]
    instruct_3(11,20,1,0,0,0,0,5404,5404,5404,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [20]
    instruct_3(11,27,1,0,0,0,0,5404,5404,5404,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [27]
    instruct_3(11,26,1,0,0,0,0,5404,5404,5404,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [26]
    instruct_3(11,25,1,0,0,0,0,5404,5404,5404,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [25]
    instruct_3(11,24,1,0,0,0,0,5404,5404,5404,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [24]
    instruct_3(11,23,1,0,0,0,0,5404,5404,5404,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [23]
    instruct_3(11,22,1,0,0,0,0,5404,5404,5404,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [22]
    instruct_3(11,21,1,0,0,0,0,5404,5404,5404,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [21]
    instruct_3(11,28,1,0,0,0,0,5428,5428,5428,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [28]
    instruct_3(11,29,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [29]
    instruct_3(11,35,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [35]
    instruct_3(11,34,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [34]
    instruct_3(11,33,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [33]
    instruct_3(11,32,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [32]
    instruct_3(11,31,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [31]
    instruct_3(11,30,1,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [30]
    instruct_3(11,36,1,0,0,0,0,5426,5426,5426,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [36]
    instruct_3(11,46,1,0,0,0,0,5426,5426,5426,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [46]
    instruct_3(11,45,1,0,0,0,0,5426,5426,5426,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [45]
    instruct_3(11,44,1,0,0,0,0,5426,5426,5426,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [44]
    instruct_3(11,43,1,0,0,0,0,5426,5426,5426,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [43]
    instruct_3(11,42,1,0,0,0,0,5426,5426,5426,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [42]
    instruct_3(11,41,1,0,0,0,0,5426,5426,5426,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [41]
    instruct_3(11,40,1,0,0,0,0,5426,5426,5426,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [40]
    instruct_3(11,39,1,0,0,0,0,5426,5426,5426,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [39]
    instruct_3(11,38,1,0,0,0,0,5426,5426,5426,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [38]
    instruct_3(11,37,1,0,0,0,0,5426,5426,5426,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [37]
    instruct_3(11,47,1,0,0,0,0,5444,5444,5444,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [47]
    instruct_3(11,48,1,0,0,0,0,5402,5402,5402,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [48]
    instruct_3(11,56,1,0,0,0,0,5402,5402,5402,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [56]
    instruct_3(11,55,1,0,0,0,0,5402,5402,5402,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [55]
    instruct_3(11,54,1,0,0,0,0,5402,5402,5402,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [54]
    instruct_3(11,53,1,0,0,0,0,5402,5402,5402,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [53]
    instruct_3(11,52,1,0,0,0,0,5402,5402,5402,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [52]
    instruct_3(11,51,1,0,0,0,0,5402,5402,5402,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [51]
    instruct_3(11,50,1,0,0,0,0,5402,5402,5402,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [50]
    instruct_3(11,49,1,0,0,0,0,5402,5402,5402,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [49]
    instruct_3(11,57,1,0,0,0,0,5436,5436,5436,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [57]
    instruct_3(11,58,1,0,0,0,0,5392,5392,5392,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [58]
    instruct_3(11,64,1,0,0,0,0,5392,5392,5392,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [64]
    instruct_3(11,63,1,0,0,0,0,5392,5392,5392,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [63]
    instruct_3(11,62,1,0,0,0,0,5392,5392,5392,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [62]
    instruct_3(11,61,1,0,0,0,0,5392,5392,5392,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [61]
    instruct_3(11,60,1,0,0,0,0,5392,5392,5392,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [60]
    instruct_3(11,59,1,0,0,0,0,5392,5392,5392,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [59]
    instruct_3(11,77,1,0,269,0,0,5302,5302,5302,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [77]
    instruct_3(11,78,1,0,269,0,0,5302,5302,5302,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [78]
    instruct_3(11,79,1,0,0,0,0,5308,5308,5308,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [79]
    instruct_3(11,80,1,0,0,0,0,5310,5310,5310,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [80]
    instruct_3(11,82,1,0,269,0,0,5312,5312,5312,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [82]
    instruct_3(11,81,1,0,0,0,0,5312,5312,5312,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [81]
    instruct_3(11,83,1,0,269,0,0,5310,5310,5310,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [83]
    instruct_3(11,84,1,0,0,0,0,5314,5314,5314,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [84]	
	light()
	walkme(29, 42)
	say("各位，请将场上的魔教余孽一概诛灭了。武当派从西往东搜索，峨嵋派从东往西搜索，别让魔教有一人漏网。昆仑派预备火种，焚烧魔教巢穴。少林子弟各取法器，诵念往生经文，替六派殉难的英雄、魔教教众超度，化除冤孽。", 169)
	say("焚我残躯，熊熊圣火。", 10)
	say("生亦何欢，死亦何苦？", 11)
	say("为善除恶，惟光明故，喜乐悲愁，皆归尘土。", 12)
	say("怜我世人，忧患实多！", 14)
	if WarMain(350) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	instruct_3(11,108,1,0,0,0,0,5284,5284,5284,-2,-2,-2)
	light()
	say("等等，大家住手，听我一言！", 9)
	bgtalk("只见眼前的少年武功高强，把前来挑战的六大门派高手一一击退。")
	say("你是....无忌？")
	say("少侠！这是成昆搞出来的阴谋！", 9)
	bgtalk("张无忌把事情真相一五一十的说了出来，在场众人面面向觎。")
	say("哼，技不如人，有什么好说的！我们走！", 6)
	say("盼望张少侠以后能约束明教众人，少生争端，阿弥陀佛。", 169)
	say("无忌小师叔，你有空了记得回来武当一趟，太师叔祖他们都在挂念你呢。", 320)
	dark()
	for i = 0, 114 do
		if i ~= 112 and i ~= 71 and i ~= 75 and i ~= 74 and i ~= 76 then
			null(-2, i)
		end
		addevent(-2, 105, 1, 0, 0, 2898)
		instruct_3(11,3,1,0,0,0,0,2671*2,2671*2,2671*2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [3]
		instruct_3(11,113,1,0,0,0,0,2659*2,2659*2,2659*2,-2,-2,-2)
		instruct_3(11,114,1,0,0,0,0,2663*2,2663*2,2663*2,-2,-2,-2)
		instruct_3(11,6,1,0,0,0,0,5334,5334,5334,-2,-2,-2)	
		instruct_3(11,108,1,0,0,0,0,5284,5284,5284,-2,-2,-2)
	end
	light()
	say("无忌，你是怎么逃出来的？")
	say("说来话长....", 9)
	dark()
	light()
	say("原来如此，真是旷世奇缘。现在有你坐镇明教，相信武林中的风波也会平息下来。那我就先走一步了。")
	say("少侠后会有期。", 9)
	addevent(-2, 3, 1, 1374, 1)
	addevent(-2, 113, 1, 1374, 1)
	addevent(-2, 114, 1, 1374, 1)
	addevent(-2, 6, 1, 1374, 1)
	addevent(-2, 108, 1, 1375, 1)
	
	null(33, 2)
	addevent(33, 0, 1, 1376, 1, 2699*2)
	addevent(33, 1, 1, 1376, 1, 2699*2)
	null(34, 0)
	addevent(34, 1, 1, 1377, 1, 5404)
	null(68, 7)
	addevent(68, 14, 1, 1378, 1, 5412)
	addevent(68, 0, 1, 1378, 1, 5412)
	null(43, 35)
end

OEVENTLUA[1374] = function()
	say("焚我残躯，熊熊圣火。", 10)
	say("生亦何欢，死亦何苦？", 11)
	say("为善除恶，惟光明故，喜乐悲愁，皆归尘土。", 12)
	say("怜我世人，忧患实多！", 14)		
end

OEVENTLUA[1375] = function()
	say("也不知道义父现在怎么样了。", 9)
end

OEVENTLUA[1376] = function()
	say("师父带领门下弟子讨伐光明顶魔教去了，至今未回。", 330)
	addevent(11, 108, 1, 1379, 1)
end

OEVENTLUA[1377] = function()
	say("师父带领门下弟子讨伐光明顶魔教去了，至今未回。", 350)
	addevent(11, 108, 1, 1379, 1)
end

OEVENTLUA[1378] = function()
	say("师父带领门下弟子讨伐光明顶魔教去了，至今未回。", 340)
	addevent(11, 108, 1, 1379, 1)
end

OEVENTLUA[1379] = function()
	say("少侠！", 9)
	say("最近江湖上纷纷传闻明教在光明顶一战后把数个门派的人都抓了起来囚禁在光明顶上。这是怎么回事？")
	say("我正在为此烦恼。明教上下已经和其他门派止息干戈，释愆修好，绝不可能做出这种事", 9)
	say("属下认为这从中有人捣鬼，企图坐收渔利。", 11)
	say("我们几个伤势已经恢复，就让我们去查查吧。", 10)
	say("那就有劳各位了。", 9)
	dark()
	null(-2, 3)
	null(-2, 6)
	null(-2, 113)
	null(-2, 114)
	light()
	say("那我也去查一查好了。")
	addevent(-2, 108, 1, 1375, 1)
	addevent(9, 2, 1, 1380, 1, 2648*2)
	addevent(33, 0, 1, 1385, 1, 2699*2)
	addevent(33, 1, 1, 1385, 1, 2699*2)
	addevent(34, 1, 1, 1386, 1, 5404)
	addevent(68, 14, 1, 1387, 1, 5412)
	addevent(68, 0, 1, 1387, 1, 5412)		
end

OEVENTLUA[1380] = function()
	say("没想到还能有人找到这里，小子，你就是江湖上传闻在找十四天书的那个人吧。", 18)
	say("你是谁？")
	say("我就是混元霹雳手成昆。", 18)
	say("原来就是你在后面挑拨明教与六大门派的关系！")
	say("哼，阳顶天抢了我的至爱，我与明教势不两立！小子，聪明的你就跟我合作吧。", 18)
	say("我为什么要与虎谋皮。")
	say("哈哈，其一，我身后就是朝廷，一切武林势力都是螳臂当车，那些不知所踪的掌门就是例子", 18)
	say("其二，江湖早在纷纷传言你先于六大门派攻打明教，后于明教新教主称兄道弟，是个反复小人。", 18)
	say("其三，倚天屠龙记这本书就在朝廷的手中！怎么样，要考虑一下么？", 18)
	if yesno("要与成昆合作吗？") then
		say("....好，我与你合作！你要怎么做？")
		say("够爽快，这本掌法给你，算是利息！", 18)
		addthing(94)
		say("接下来你去绿柳山庄，自然会有人给你下一步的指示。", 18)
		dark()
		null(-2, -2)
		null(11, 108)
		for i = 7, 10 do
			addevent(106, i, 0, 1381, 3)
		end
		light()
	else
		say("我才不会与你同流合污！")
		say("哼！敬酒不吃吃罚酒！", 18)
		if WarMain(361) == false then
			instruct_15(0);   
			instruct_0();  
			do return; end			
		end				
		null(-2, -2)
		say("逃得好快！看样子似乎是朝西南方向去的。")
		for i = 7, 10 do
			addevent(106, i, 0, 1391, 3)
		end
	end
end

OEVENTLUA[1381] = function()
	if instruct_20() then
		do return end
	end
	dark()
	for i = 7, 10 do
		null(-2, i)
	end	
	addevent(-2, 1, 0, 0, 0, 4595*2)
	addevent(-2, 2, 0, 0, 0, 3046*2)
	addevent(-2, 5, 0, 0, 0, 3046*2)
	addevent(-2, 6, 0, 0, 0, 3046*2)
	light()
	bgtalk("只见眼前一人是个年轻公子，轻摇折扇，掩不住一副雍容华贵之气。相貌俊美，双目黑白分明，炯炯有神。只见其腰间悬着一柄长剑，剑柄上赫然镂着“倚天”两个篆文。")
	say("（这人分明是男扮女装，她身上那把剑难道是灭绝的倚天剑？）")
	say("少侠就是成师傅推荐的人吧，不过这绿柳山庄不收闲杂人物，这就请少侠证明一下自己吧。", 639)
	say("阿三，你就和这位少侠比一下拳脚吧。", 639)
	say("少侠请！", 640)
	if WarMain(351) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	light()
	say("阿二，你上。", 639)
	say("是！", 641)	
	if WarMain(352) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	light()	
	say("阿大，你去试一试少侠的剑法。", 639)
	say("是！", 642)	
	if WarMain(353) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	light()
	addHZ(63)
	say("很好！不愧是成师傅推荐的人才。在下赵敏，刚才多有得罪，向少侠赔不是了。", 639)
	say("赵姑娘客气了，不知姑娘身上的这把剑....")
	say("少侠猜的没错，各大派的人就囚在我这山庄内，少侠不妨随我出去一看。", 639)
	dark()
	null(-2, 1)
	null(-2, 2)
	null(-2, 5)
	null(-2, 6)
	addevent(-2, 15, 1, 1382, 1, 3046*2)
	addevent(-2, 16, 1, 1382, 1, 3046*2)
	addevent(-2, 17, 1, 1382, 1, 3046*2)
	light()
	instruct_10(639)
end

OEVENTLUA[1382] = function()
	if not hasppl(639) then
		say("......", 642)
		do return end
	end
	say("去把几位掌门请出来吧。", 639)
	say("是！", 642)
	dark()
	addevent(-2, 4, 0, 0, 0, 2685*2)
	addevent(-2, 11, 0, 0, 0, 2685*2)
	addevent(-2, 12, 0, 0, 0, 2685*2)
	addevent(-2, 13, 0, 0, 0, 2681*2)
	addevent(-2, 14, 0, 0, 0, 2709*2)
	addevent(-2, 3, 0, 0, 0, 2677*2)
	light()
	say("诸位掌门，这里的规矩你们是知道的了，如果你们能胜得了这位少侠，你们立刻就能走。如若败了，便斩断一根手指，囚禁一月，再问你降也不降。", 642)
	say("那么少侠请吧。", 639)
	say("（原来她命人逐一与各家掌门相斗，她在旁察看，得以记下各门各派的精妙招数，当真好计谋）")
	if WarMain(354) then
        AddPersonAttrib(639, "御剑能力", 5)
        QZXS("赵敏御剑能力增加5.")
		addthing(124)
	--else
	--	instruct_15(0);   
	--	instruct_0();  
	--	do return; end			
	end			
	if WarMain(355) then
        AddPersonAttrib(639, "耍刀技巧", 6)
        QZXS("赵敏耍刀技巧增加6.")
		addthing(142)
	--else
	--	instruct_15(0);   
	--	instruct_0();  
	--	do return; end				
	end			
	if WarMain(356) then
        AddPersonAttrib(639, "拳掌功夫", 7)
        QZXS("赵敏拳掌功夫增加7.")
		addthing(89)	
	--else
	--	instruct_15(0);   
	--	instruct_0();  
	--	do return; end				
	end			
	if WarMain(150) then
        AddPersonAttrib(639, "御剑能力", 8)
        QZXS("赵敏御剑能力增加8.")
		addthing(120)	
	--else
	--	instruct_15(0);   
	--	instruct_0();  
	--	do return; end				
	end			
	daode(-4)
	say("好了，请几位掌门回去歇息吧。", 639)
	dark()
	null(-2, 4)
	null(-2, 11)
	null(-2, 12)
	null(-2, 14)
	null(-2, 13)
	null(-2, 3)
	light()
	addevent(-2, 15, 1, 1383, 1, 3046*2)
	addevent(-2, 16, 1, 1383, 1, 3046*2)
	addevent(-2, 17, 1, 1383, 1, 3046*2)
end

OEVENTLUA[1383] = function()
	if not hasppl(639) then
		say("......", 642)
		do return end
	end
	dark()
	instruct_3(-2,22,1,0,0,0,0,2671*2,2671*2,2671*2,-2,-2,-2); 
	instruct_3(-2,21,1,0,0,0,0,2659*2,2659*2,2659*2,-2,-2,-2)
	instruct_3(-2,20,1,0,0,0,0,2663*2,2663*2,2663*2,-2,-2,-2)
	instruct_3(-2,19,1,0,0,0,0,5334,5334,5334,-2,-2,-2)	
	instruct_3(-2,18,1,0,0,0,0,5284,5284,5284,-2,-2,-2)	
	light()
	say("姑娘！请把你抓的人放出来！", 9)
	say("原来是张教主大驾光临，真是蓬荜生辉。你们还不好好招呼一下明教各位英雄？", 639)
	if WarMain(357) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	for i = 18, 22 do null(-2, i) end
	light()		
	say("郡主，囚犯们都被明教的人救走了！", 640)
	say("不妨事....", 639)
	say("（刚才看这姑娘望着无忌的样子，似乎颇有情意....难道她是故意放他们去的？）")
	say("少侠没事的话请陪我去武当山一趟吧。", 639)
	say("好！姑娘请。")
	dark()
	for i = 15, 17 do null(-2, i) end
	addevent(43, 36, 0, 1384, 3)
	addevent(43, 37, 0, 1384, 3)
	addevent(33, 0, 1, 1385, 1, 2699*2)
	addevent(33, 1, 1, 1385, 1, 2699*2)
	addevent(34, 1, 1, 1386, 1, 5404)
	addevent(68, 14, 1, 1387, 1, 5412)
	addevent(68, 0, 1, 1387, 1, 5412)	
	light()
end

OEVENTLUA[1384] = function()
	if not hasppl(639) then
		do return end
	end
	null(-2, 36)
	null(-2, 37)
	dark()
	light()
	walkme(22, 28)
	say("晚生执掌明教张无忌，今日得见武林中泰山北斗，幸也何如！", 639)
	say("（怎地魔教教主是如此年轻俊美的一个少女，名字偏又和我那无忌孩儿相同？）不知教主大驾光临，未克远迎，还请恕罪！", 5)
	say("好说，好说。晚生有一句良言相劝，不知张真人肯俯听否？", 639)
	say("请说。", 5)
	say("普天之下，莫非王土，率土之滨，莫非王臣。我朝皇帝威加四海。张真人若能效顺，皇上立颁殊封，武当派自当大蒙荣宠。", 639)
	say("武当向来不与朝廷牵扯关系，教主还是请吧。", 5)
	say("张真人既如此固执，暂且不必说了。就请各位一起跟我走吧！", 639)
	dark()
	addevent(-2, 38, 0, 0, 0, 5284)
	light()
	say("且慢！", 9)
	say("孩儿张无忌叩见太师父！", 9)
	say("好孩子，你没死，翠山可有后了。", 5)
	say("太师父您不用动手，还是孩儿来吧。", 9)
	say("不妨，多年没有走动江湖，与如今的后辈切磋一下也是好的，各位请。", 5)
	if WarMain(358) then
		
	end		
	light()	
	say("张教主，这黑玉断续膏你还要不要？", 639)
	say("赵姑娘若能赠下黑玉断续膏治好三师伯的伤，无忌感激不尽！", 9)
	say("你要黑玉断续膏，我可给你。只是你须得答应我做三件事，那我便心甘情愿地奉上。倘若你用强威逼，那么你杀我容易，要得药，却难上加难。你再对我滥施恶刑，我给你的也只是假药、毒药。", 639)
	say("哪三件事？快说，快说！", 9)
	say("我一时想不起来，什么时候想到了，随时会跟你说，只须你金口一诺，决不违约，那便成了。我不会要你去捉天上的月亮，不会叫你去做违背侠义之道的恶事，更不会叫你去死，自然也不会叫你去做猪做狗。", 639)
	say("只要不背侠义之道，那么不论多大的难题，我也当竭力以赴。", 9)
	say("好，咱们击掌为誓。我给药于你，治好了你三师伯之伤，日后我求你做三件事，只须不违侠义之道，你务当竭力以赴，决不推辞。", 639)
	say("谨如尊言。", 9)	
	say("好，那第一件事，我要你伴我去取那柄屠龙刀。", 639)
	say("屠龙刀是我义父金毛狮王谢大侠之物。我岂能背叛义父，取刀给你？", 9)	
	say("我不是要你去偷去抢、去拐去骗，我也不是真的要了这把刀。我只要你去向你义父借来，给我把玩一个时辰，立刻便还给他。你们是义父义子，难道向他借一个时辰，他也不肯？借来瞧瞧，既不吞没他的，又不用来谋财害命，难道也违背侠义之道了？", 639)
	say("这把刀虽大大有名，其实也没什么看头，只不过特别沉重些、锋利些而已。", 9)	
	say("说什么武林至尊，宝刀屠龙。号令天下，莫敢不从。倚天不出，谁与争锋？倚天剑是在我手中，我定要瞧瞧那屠龙刀是什么模样。你若不放心，我看刀之时，你尽可站在一旁。凭着你的本领，我决不能强占不还。", 639)
	say("你不肯，那也由得你。我可要另外叫你做一件事，那却难得多了。", 639)
	say("好，我答允去给你借屠龙刀。但咱们言明在先，你只能借看一个时辰，倘若意图强占，我可决不甘休。", 9)	
	say("是了。我又不会使刀，重甸甸的要来干吗？你便恭恭敬敬地送给我，我也不稀罕呢。那我们走吧。", 639)
	say("好。", 9)
	say("（这赵姑娘智计多端，无忌这次可是被她吃得死死的了，这一去冰火岛万里迢迢，她分明就只是想和无忌多待在一起而已）")
	JY.Person[9]["携带物品1"] = 83
	JY.Person[9]["携带物品数量1"] = 1	
	JY.Person[9]["携带物品2"] = 74
	JY.Person[9]["携带物品数量2"] = 1	
	JY.Person[9]["携带物品3"] = -1
	JY.Person[9]["携带物品数量3"] = 0	
	JY.Person[9]["携带物品4"] = -1
	JY.Person[9]["携带物品数量4"] = 0
    instruct_3(104,46,1,0,948,0,0,7226,7226,7226,-2,-2,-2);   
    if instruct_20(49,0) ==false then   
        instruct_0();  
        instruct_14(); 
        instruct_0();  
		null(-2, 38)	
        instruct_13();  
        instruct_10(9);  
    else
		instruct_1(12,9,0);  
		instruct_0();  
		instruct_14(); 
		instruct_3(70,17,1,0,107,0,0,5284,5284,5284,-2,-2,-2); 
		null(-2, 38)	
		instruct_13();  		
	end   
	addevent(72, 0, 0, 1388, 3)
	addevent(72, 1, 0, 1388, 3)   	
end

OEVENTLUA[1386] = function()
	if MPPD(0) == 18 then
		say("是长老！快请进！", 350)
		dark()
		null(-2,1)
		addevent(34,0,1,1396,1,5364)
		light()
	elseif PersonKF(zj(),189) then
		say("是本门恩人！快请进！", 350)
		dark()
		null(-2,1)
		addevent(34,0,1,1396,1,5364)
		light()
	else	
		say("......", 350)
	end	
end

OEVENTLUA[1385] = function()
	say("......", 330)
end

OEVENTLUA[1387] = function()
	say("......", 340)
end

OEVENTLUA[1388] = function()
	if not hasppl(9) or not hasppl(639) then
		do return end
	end
	dark()
	null(-2, 0)
	null(-2, 1)
	addevent(-2, 2, 0, 0, 0, 2646*2)
	addevent(-2, 8, 0, 0, 0, 4538*2)
	addevent(-2, 9, 0, 0, 0, 4546*2)
	addevent(-2, 10, 0, 0, 0, 4542*2)
	light()
	say("谢逊，你身为明教中人，就应该听从波斯宗教命令才是！快点把屠龙刀交出来！", 173)
	say("中土明教虽出自波斯，但数百年来独立成派，自来不受波斯总教管辖。三位还是请吧。", 13)
	say("明教中人，不奉圣火令号令者，一律杀无赦矣！", 174)
	say("休伤我义父！", 9)
	if WarMain(360) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	for i = 8, 10 do null(-2, i) end	
	light()
	addthing(311)
	addthing(283)
	addthing(70)
		if GetS(111, 0, 0, 0) == 0 then
	        say("（圣火功？好诡异的武功，要不要好好研究一下？）",0) 
	        instruct_0();
			if instruct_11(0,188) == true then
	            QZXS("领悟圣火功！")
	            instruct_0();
	            say("（居然如此诡异强大，不错不错）",0) 
				instruct_0()
	            SetS(111, 0, 0, 0,93)
				addHZ(159)
			else
				say("波斯武功？？不会要自焚吧？",0) 
				instruct_0()
			end	
		end	
	say("义父，孩儿无忌不孝，没能早日前来相接，累义父受尽辛苦。", 9)
	say("你....你说什么？", 13)
	say("拳学之道在凝神，意在力先方制胜............", 9)
	say("你....你当真便是我那无忌孩儿？老天爷开眼，老天爷开眼！", 13)	
	bgtalk("谢逊惊喜交集，如在梦里。张无忌站起身来，搂住了他，将别来情由，拣要紧的说了一些。")
	say("是你这小姑娘想借屠龙刀？嘿嘿，刚才你那拼命三招，第一招是昆仑派的玉碎昆冈，第二招是崆峒派的人鬼同途，第三招是什么啊，老头子孤陋寡闻，可听不出来了。", 13)	
	say("这第三招是武当派的天地同寿，似乎是新创招数，难怪老爷子不知。", 639)
	say("你出全力相救无忌，当然很好，可是怎么连自己的命也不要了？", 13)
	say("我....对....他....", 639)
	bgtalk("赵敏说到这里，再也说不下去了，只是低下了头，面颊上泛出了红晕。张无忌心神激荡，情不自禁，伸过手去握住了她手。")
	say("哈哈，好，这把屠龙刀我就传给无忌，等你两个拜堂之后，自然就是你的了。", 13)
	addthing(43)
	bgtalk("赵敏性格刚强，要爱便爱，要恨便恨，并不忸怩作态，可是听了谢逊这句话后，也不禁把头低得更低了。")
	say("既然赵姑娘已经得偿所愿，那倚天屠龙记的书....")
	say("那书在绿柳山庄里，少侠这就陪我去拿吧。", 639)
	dark()
	null(-2, 2)
	addevent(106, 0, 0, 1389, 3)
	light()
end

OEVENTLUA[1389] = function()
	if not hasppl(9) or not hasppl(639) then
		do return end
	end	
	dark()
	null(-2, -2)
	light()
	walkme(32, 42)
	say("敏妹，这些天你总是面现忧虑，可是因为明教和朝廷的关系？", 9)
	say("身份地位，这些我都可以不要，我要求你的第二件事，等此间事了，带我走吧。", 639)
	say("好，我和你一起退隐江湖，不问世事。", 9)
	dark()
	addevent(-2, 21, 0, 0, 0, 2648*2)
	addevent(-2, 22, 0, 0, 0, 3047*2)
	addevent(-2, 23, 0, 0, 0, 3047*2)
	addevent(-2, 19, 0, 0, 0, 3047*2)
	addevent(-2, 20, 0, 0, 0, 3047*2)
	addevent(-2, 18, 0, 0, 0, 3047*2)
	light()
	say("没那么好的事！", 18)
	say("成昆！", 9)
	say("来人，把张无忌拿下！", 18)
	say("你敢！", 639)
	say("哈哈，大小姐，你父王听说了你和明教教主的事，大发雷霆，誓要把那姓张的碎尸万段才罢。你就乖乖跟我们回去见你父王吧。", 18)
	if WarMain(359) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	for i = 18, 23 do null(-2, i) end	
	light()	
	say("成昆伏诛，义父大仇得报，我们走吧。", 9)
	say("等下，我还有第三件事，你可不能言而无信。", 639)
	say("你..你又有什么古灵精怪的事要我做？", 9)
	say("我的眉毛太淡，你给我画一画。这可不违反武林侠义之道吧？", 639)	
	say("从今而后，我天天给你画眉。", 9)
	addthing(155)
	if GetS(113,0,0,0) == 0 then 
	    say("成昆的幻阴指法，他既已伏诛这套功夫就是我的了。",0) 
	    instruct_0();
		if instruct_11(0,188) == true then 
	        QZXS("领悟幻阴指法！")
			say("嗯！原来如此！",0)
	        instruct_0();
	        setLW1(19)
			addthing(94)         --获得幻阴指法  
		else
			say("我已经很厉害了，不屑成昆的武学。",0) 
		end	
	end
	if GetS(111,0,0,0) == 0 then
	    say("想不到成昆还藏有少林九阳功，我也一并收了。",0) 
	    instruct_0();
		if instruct_11(0,188) == true then
	        QZXS("领悟少林九阳功！")
	        instruct_0();
	        say("不错不错",0) 
			instruct_0()
	        SetS(111,0,0,0,187)
			addthing(348)
		else
			say("不是完整的九阳神功，要来何用！",0) 
			instruct_0()
		end	
	end	
end

OEVENTLUA[1390] = function()
	
end

OEVENTLUA[1391] = function()
	for i = 7, 10 do
		null(-2, i)
	end	
	addevent(-2, 1, 0, 0, 0, 4595*2)
	addevent(-2, 2, 0, 0, 0, 3046*2)
	addevent(-2, 5, 0, 0, 0, 3046*2)
	addevent(-2, 6, 0, 0, 0, 3046*2)
	light()
	bgtalk("只见眼前一人是个年轻公子，轻摇折扇，掩不住一副雍容华贵之气。相貌俊美，双目黑白分明，炯炯有神。只见其腰间悬着一柄长剑，剑柄上赫然镂着＂倚天＂两个篆文。")
	say("（这人分明是男扮女装，她身上那把剑难道是灭绝的倚天剑？）")
	say("贵客远道而来，不知有何贵干？", 639)	
	say("在下为了寻找几位掌门追踪一位老者来到此地。请问姑娘腰间的这把宝剑何来？")
	say("少侠猜的没错，那几位掌门正在庄上做客。少侠如不嫌弃，便留下来陪他们吧。", 639)
	if WarMain(362) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end			
	null(-2, 1)
	null(-2, 2)
	null(-2, 5)
	null(-2, 6)
	say("逃得好快，还是四下找找各大门派的人吧。")
	moveme(28, 40, 1)
	addevent(-2, 4, 1, 1392, 1, 2685*2)
	addevent(-2, 11, 1, 1392, 1, 2685*2)
	addevent(-2, 12, 1, 1392, 1, 2685*2)
	addevent(-2, 13, 1, 1392, 1, 2701*2)
	addevent(-2, 14, 1, 1392, 1, 2709*2)
	addevent(-2, 3, 1, 1392, 1, 2677*2)	
	bgtalk("众人齐声：多谢少侠出手相助。")
	say("我们这里有些谢礼，请少侠收下。", 7)
	addthing(89)
	addthing(124)
	addthing(142)
	addthing(348)
	addthing(350)
	bgtalk("众人齐声：少侠后会有期。")
	dark()
	null(-2, 4)
	null(-2, 11)
	null(-2, 12)
	null(-2, 14)
	null(-2, 3)
	addevent(33, 0, 1, 1385, 1, 2699*2)
	addevent(33, 1, 1, 1385, 1, 2699*2)
	addevent(34, 1, 1, 1386, 1, 5404)
	addevent(68, 14, 1, 1387, 1, 5412)
	addevent(68, 0, 1, 1387, 1, 5412)		
	addevent(11, 108, 1, 1393, 1)
	light()
	daode(5)
	if MPPD(0) == 0 and JY.Person[0]["品德"] >= 80 and JY.Person[0]["拳掌功夫"] >= 200 and JY.Person[0]["特殊兵器"] >= 150 and JY.Person[0]["暗器技巧"] >= 150 then 
	    say("崆峒派三位前辈请留步。",0)
		say("少侠还有何事？",8)
        say("晚辈敬仰已久，想加入崆峒派为武林造福，不知三位前辈意下如何？",0)
		say("少侠不仅正直，且对我派有恩，我们三人怎么会拒绝。",168)
	    say("多谢三位前辈",0)
		say("这里有一些崆峒派的武理，你好好参详。",167)
		say("弟子定不会辱没崆峒美名！",0)
	    JoinMP(0,18,3)
		addHZ(1)
		addHZ(4)
		addHZ(148)
	end
	if MPPD(0) == 0 and JY.Person[0]["品德"] >= 80 and JY.Person[0]["御剑能力"] >= 300 and JY.Person[0]["耍刀技巧"] >= 300 then 
	    say("何掌门、何夫人请留步。",0)
		say("少侠还有何事？",7)
        say("晚辈对于昆仑的威名早有耳闻，希望能入昆仑精修武艺",0)
		say("（这小子武功这么好，还想来昆仑？怕不是想持恩图我掌门之位？）",7)
	    say("（太好了，最近何师弟越来越不把我放在眼里，他来正好能敲打敲打这蠢蛋！）",166)
		say("少侠有恩于我派，我本不该拒绝，但是...",7)
		say("没什么但是！我们自诩正派，本不可知恩不图报！",166)
		say("如今我派坐忘峰正无一能人主持峰务，就有劳少侠担任我派坐忘峰主一职吧。",166)
		say("「何师弟」，没问题吧？",166)
		say("...夫人说的是...（咬牙切齿）",7)
		say("晚辈多谢二位了。",0)
	    JoinMP(0,19,2)
		addHZ(8)
		addHZ(9)
		addHZ(22)
		addthing(368,1)
		addthing(369,1)
	end	
end

OEVENTLUA[1392] = function()
	if MPPD(0) == 17 then
		say("芷若？怎么只有你一个人在这里？掌门呢？")
		say("师傅她...走了（眩然欲泣）。临走前*把掌门之位传了给我。", 638)
		say("但我哪有办法担此重任？师叔，你接下掌门的位置吧！", 638)
		say("...你知道师叔身上的担子的，这掌门之位，师叔是真的不适合。")
		say("芷若别怕，以你之能撑起峨眉还是足够的，我也会帮你。")
		say("......（犹豫再三）", 638)
		say("好吧，芷若多谢师叔。", 638)
		teammate(638)
		JoinMP(638, 17, 2)
		if GetS(111,0,0,0) == 0 and (inteam(92) or GX(92)) then
			say("...唉，掌门性子刚烈，想必是自尽而亡了。",0)
			say("......",92)
			say("襄儿...",0)
			say("我没事。所幸如今其他门人皆安康，尤其芷若没事。",92)
			say("是啊，算是不幸中的万幸",0)
				if JY.Person[0]["性别"] == 0 then
					say("大哥，经此一事我忽有一悟，可愿共参？",92)
				else
					say("姐姐，经此一事我忽有一悟，可愿共参？",92)
				end
			instruct_0();
			if instruct_11(0,188) == true then 
				QZXS("领悟临济十二庄精要！",0)
				say("持道入佛...襄儿你真的悟了。",0)
				say("该远去的早已远去，该放下的也该放下了。",92)
				instruct_0();
				SetS(111, 0, 0, 0,153)
				JoinMP(0,17,3)
			else
				say("我道心未稳、佛学不深，却是体会不得了。",0)
				say("无妨，每个人有每个人的缘法。",92) 
			end	
		end
	else
		say("姑娘你是峨嵋派的人？怎么不见灭绝前辈？")
		say("我师父她已经仙逝了，她老人家临终前把掌门之位传了给我。少侠，请让我加入你们，为师父报仇。", 638)
		say("好吧，姑娘怎么称呼？")
		say("我叫周芷若。", 638)
		teammate(638)
		JoinMP(638, 17, 2)
		if GetS(111,0,0,0) == 0 and (inteam(92) or GX(92)) then
			say("早有听闻峨眉掌门性子刚烈，想必是自尽而亡了。",0)
			say("......",92)
			say("襄儿...",0)
			say("我没事。所幸如今其他门人皆安康，尤其芷若没事。",92)
			say("是啊，算是不幸中的万幸",0)
				if JY.Person[0]["性别"] == 0 then
					say("大哥，经此一事我忽有一悟，可愿共参？",92)
				else
					say("姐姐，经此一事我忽有一悟，可愿共参？",92)
				end
			instruct_0();
			if instruct_11(0,188) == true then 
				QZXS("领悟临济十二庄精要！",0)
				say("持道入佛...襄儿你真的悟了。",0)
				say("该远去的早已远去，该放下的也该放下了。",92)
				instruct_0();
				SetS(111, 0, 0, 0,153)
			else
				say("我道心未稳、佛学不深，却是体会不得了。",0)
				say("无妨，每个人有每个人的缘法。",92) 
			end	
		end
	end
end

OEVENTLUA[1393] = function()
	if hasppl(638) then
		say("无忌哥哥....", 638)
		say("周姑娘？", 9)
		say("原来两位认识。")
		say("周姑娘和我从小相识。在下幼时中了玄冥神掌，阴毒入体，周身难以动弹，多亏周姑娘服侍我食饭喝水，帮我劝我，此番恩德，不敢有忘。", 9)
		say("原来两位倒是青梅竹马之交。恭喜两位重逢了。")
	end
	say("少侠那边有消息了么？", 9)
	say("应该是朝廷在背后弄的鬼，我这边势单力薄，无忌，这回可要你出马了。")
	say("自然义不容辞！", 9)
	JY.Person[9]["携带物品1"] = 83
	JY.Person[9]["携带物品数量1"] = 1	
	JY.Person[9]["携带物品2"] = 74
	JY.Person[9]["携带物品数量2"] = 1	
	JY.Person[9]["携带物品3"] = -1
	JY.Person[9]["携带物品数量3"] = 0	
	JY.Person[9]["携带物品4"] = -1
	JY.Person[9]["携带物品数量4"] = 0
    instruct_3(104,46,1,0,948,0,0,7226,7226,7226,-2,-2,-2);   
    if instruct_20(49,0) ==false then   
        instruct_0();  
        instruct_14(); 
        instruct_0();  
		null(-2, 108)	
        instruct_13();  
        instruct_10(9);  
    else
		instruct_1(12,9,0);  
		instruct_0();  
		instruct_14(); 
		instruct_3(70,17,1,0,107,0,0,5284,5284,5284,-2,-2,-2); 
		null(-2, 108)	
		instruct_13();  		
	end   	
	for i = 7, 10 do
		addevent(106, i, 0, 1394, 3)
	end
end

OEVENTLUA[1394] = function()
	if not hasppl(9) then
		do return end
	end
	dark()
	for i = 7, 10 do
		null(-2, i)
	end
	addevent(-2, 1, 0, 0, 0, 2660*2)
	addevent(-2, 2, 0, 0, 0, 3046*2)
	addevent(-2, 5, 0, 0, 0, 3046*2)
	addevent(-2, 6, 0, 0, 0, 3046*2)	
	light()
	say("成昆，又是你！", 9)
	say("姓张的小子，劝你还是乖乖投降吧，否则就让你跟俞三一个下场！", 18)
	say("原来我三伯的伤是你们害的！", 9)
	say("阿大，阿二，阿三，上！", 18)
	if WarMain(363) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end	
	addthing(288)
	say("好小子，大家一起上！", 18)
	if WarMain(359) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	null(-2, 1)
	null(-2, 2)
	null(-2, 5)
	null(-2, 6)
	daode(1)
	say("成昆终于伏诛，我义父的仇也报了。少侠，我准备去冰火岛一趟把义父接回中土。", 9)
	say("好，我跟你一起去。")
	if MPPD(0) == 18 then 
        JoinMP(0,18,4)
    end
	addevent(72, 0, 0, 1395, 3)
	addevent(72, 1, 0, 1395, 3)
end

OEVENTLUA[1395] = function()
	if not hasppl(9) then
		do return end
	end
	dark()
	null(-2, 0)
	null(-2, 1)
	addevent(-2, 2, 0, 0, 0, 2646*2)
	light()
	say("义父，孩儿无忌不孝，没能早日前来相接，累义父受尽辛苦。", 9)
	say("你....你说什么？", 13)
	say("拳学之道在凝神，意在力先方制胜............", 9)
	say("你....你当真便是我那无忌孩儿？", 13)	
	say("好教您老人家得知，无忌现在已经是明教的教主，以后您老人家还要向他行礼呢。")
	say("真的吗？太好了！金毛狮王谢逊参见教主！", 13)
	say("义父不要这样。孩儿有个不情之请，我想与这位少侠在江湖上历练一番，义父可否暂代教主之位？", 9)
	say("好！交给我！这把刀和这本书就给你小子吧。", 13)
	addthing(43)
	addthing(155)
	say("哈哈！真是老天爷开眼，老天爷开眼！", 13)
	if PersonKF(zj(),106) and GetS(111,0,0,0) == 0 then 
	    say("感谢少侠对无忌的大恩，无忌无以为报，这本九阳精要送与少侠了。",9) 
	    instruct_0();
		if DrawStrBoxYesNo(-1, -1, "是否领悟九阳精要？", C_WHITE, 30) == true then 
	        QZXS("领悟九阳精要！")
	        instruct_0();
	        SetS(111, 0, 0, 0,106)
			addHZ(158)  
		else
			say("无忌，我帮你也是有所求，你的好意我心领了。",0) 
			instruct_0()
		end	
	end
	if GetS(111,0,0,0) == 0 and PersonKF(zj(),186) then 
		say("峨眉九阳功虽不及九阳神功神妙，但是却有着独到之处与见解。",0) 
		instruct_0();
		if DrawStrBoxYesNo(-1, -1, "是否领悟？", C_WHITE, 30) == true then 
			QZXS("领悟峨眉九阳功！")
			say("这峨眉绝学真是让人大开眼界!",0) 
			instruct_0();
			SetS(111,0,0,0,186)
		else
			say("还是算了。",0) 
		end	
	end
	dark()
	null(-2, 2)
	light()
end

OEVENTLUA[1396] = function()
if GetS(111,0,0,0) == 0 then
	if MPPD(0) == 18 then
		if JY.Person[0]["性别"] == 0 then
			say("原来是师弟来了",8)
			say("师兄好",0)
			say("师弟想来是无事不登三宝殿",8)
			say("来找师兄有何事？",8)
			say("哈哈，倒是真有一事要麻烦师兄指点",0)
			say("师弟在钻研本门「阴阳磨」武功时",0)
			say("总觉得有意犹未尽之处",0)
			say("所以想来请教师兄原因",0)
			say("...师弟武功进展神速阿",8)
			say("不错，阴阳磨的确尚有部分秘传",8)
			say("但祖师有交代，秘传太过艰难，轻易练之必有性命之危",8)
			say("因此想练阴阳磨秘传者，必须经过考验",8)
			say("师弟你...可是要尝试？",8)
			say("哈，我又有何惧？",0)
			say("好！",8)
				JY.Person[8]["内力"] = 10000
				JY.Person[8]["内力最大值"] = 10000
				JY.Person[8]["受伤程度"] = 0
				JY.Person[8]["攻击力"] = 800
				JY.Person[8]["防御力"] = 800
				JY.Person[8]["轻功"] = 800
				JY.Person[8]["拳掌功夫"] = 600
				JY.Person[8]["武功3"] = 117
				JY.Person[8]["武功等级3"] = 999	
				JY.Person[167]["内力"] = 10000
				JY.Person[167]["内力最大值"] = 10000
				JY.Person[167]["受伤程度"] = 0
				JY.Person[167]["攻击力"] = 800
				JY.Person[167]["防御力"] = 800
				JY.Person[167]["轻功"] = 800
				JY.Person[167]["拳掌功夫"] = 600
				JY.Person[167]["武功3"] = 117
				JY.Person[167]["武功等级3"] = 999	
				JY.Person[168]["内力"] = 10000
				JY.Person[168]["内力最大值"] = 10000
				JY.Person[168]["受伤程度"] = 0
				JY.Person[168]["攻击力"] = 800
				JY.Person[168]["防御力"] = 800
				JY.Person[168]["轻功"] = 800
				JY.Person[168]["拳掌功夫"] = 600
				JY.Person[168]["武功3"] = 117
				JY.Person[168]["武功等级3"] = 999
				JY.Person[168]["技能2"] = 13
				JY.Person[167]["技能2"] = 13
				JY.Person[8]["技能2"] = 13
				if WarMain(148) == false then
					instruct_13()
					say("...我太大意了",0)
					say("看来师弟你与这门武功无缘阿...",8)
				else
					say("这试炼可真难...",0)
					say("哈哈哈，但师弟你可成功了阿",8)
					say("还得多谢师兄给这个机会",0)
					QZXS("领悟阴阳磨秘传！")
					SetS(111,0,0,0,189)
					say("没什么，崆峒威名靠你了。",8)
				end
		else
			say("原来是师妹来了",8)
			say("师兄好",0)
			say("师妹想来是无事不登三宝殿",8)
			say("来找师兄有何事？",8)
			say("哈哈，倒是真有一事要麻烦师兄指点",0)
			say("师妹在钻研本门「阴阳磨」武功时",0)
			say("总觉得有意犹未尽之处",0)
			say("所以想来请教师兄原因",0)
			say("...师妹武功进展神速阿",8)
			say("不错，阴阳磨的确尚有部分秘传",8)
			say("但祖师有交代，秘传太过艰难，轻易练之必有性命之危",8)
			say("因此想练阴阳磨秘传者，必须经过考验",8)
			say("师妹你...可是要尝试？",8)
			say("哈，我又有何惧？",0)
			say("好！",8)
				JY.Person[8]["内力"] = 10000
				JY.Person[8]["内力最大值"] = 10000
				JY.Person[8]["受伤程度"] = 0
				JY.Person[8]["攻击力"] = 800
				JY.Person[8]["防御力"] = 800
				JY.Person[8]["轻功"] = 800
				JY.Person[8]["拳掌功夫"] = 600
				JY.Person[8]["武功3"] = 117
				JY.Person[8]["武功等级3"] = 999	
				JY.Person[167]["内力"] = 10000
				JY.Person[167]["内力最大值"] = 10000
				JY.Person[167]["受伤程度"] = 0
				JY.Person[167]["攻击力"] = 800
				JY.Person[167]["防御力"] = 800
				JY.Person[167]["轻功"] = 800
				JY.Person[167]["拳掌功夫"] = 600
				JY.Person[167]["武功3"] = 117
				JY.Person[167]["武功等级3"] = 999	
				JY.Person[168]["内力"] = 10000
				JY.Person[168]["内力最大值"] = 10000
				JY.Person[168]["受伤程度"] = 0
				JY.Person[168]["攻击力"] = 800
				JY.Person[168]["防御力"] = 800
				JY.Person[168]["轻功"] = 800
				JY.Person[168]["拳掌功夫"] = 600
				JY.Person[168]["武功3"] = 117
				JY.Person[168]["武功等级3"] = 999
				JY.Person[168]["技能2"] = 13
				JY.Person[167]["技能2"] = 13
				JY.Person[8]["技能2"] = 13
				if WarMain(148) == false then
					instruct_13()
					say("...我太大意了",0)
					say("看来师妹你与这门武功无缘阿...",8)
				else
					say("这试炼可真难...",0)
					say("哈哈哈，但师妹你可成功了阿",8)
					say("还得多谢师兄给这个机会",0)
					QZXS("领悟阴阳磨秘传！")
					SetS(111,0,0,0,189)
					say("没什么，崆峒威名靠你了。",8)
				end
		end
	else
		say("是恩人阿！",8)
		say("唐长老好",0)
		say("不敢当不敢当！",8)
		say("恩人想来是无事不登三宝殿",8)
		say("来找在下有何事？",8)
		say("哈哈，倒是真有一事要麻烦唐长老指点",0)
		say("我在钻研「阴阳磨」这门武功时",0)
		say("总觉得有意犹未尽之处",0)
		say("所以想来请教唐长老原因",0)
		say("...这...事关本门秘传...",8)
		say("是么...是在下唐突了，非常抱歉",0)
		say("（咬咬牙）罢了，点水之恩亦当涌泉以报，何况是救命之恩？",8)
		say("但祖师有交代，秘传太过艰难，轻易练之必有性命之危",8)
		say("因此想练阴阳磨秘传者，必须经过考验",8)
		say("恩人你...可是要尝试？",8)
		say("哈，我又有何惧？",0)
		say("好！",8)
			JY.Person[8]["内力"] = 10000
				JY.Person[8]["内力最大值"] = 10000
				JY.Person[8]["受伤程度"] = 0
				JY.Person[8]["攻击力"] = 800
				JY.Person[8]["防御力"] = 800
				JY.Person[8]["轻功"] = 800
				JY.Person[8]["拳掌功夫"] = 600
				JY.Person[8]["武功3"] = 117
				JY.Person[8]["武功等级3"] = 999	
				JY.Person[167]["内力"] = 10000
				JY.Person[167]["内力最大值"] = 10000
				JY.Person[167]["受伤程度"] = 0
				JY.Person[167]["攻击力"] = 800
				JY.Person[167]["防御力"] = 800
				JY.Person[167]["轻功"] = 800
				JY.Person[167]["拳掌功夫"] = 600
				JY.Person[167]["武功3"] = 117
				JY.Person[167]["武功等级3"] = 999	
				JY.Person[168]["内力"] = 10000
				JY.Person[168]["内力最大值"] = 10000
				JY.Person[168]["受伤程度"] = 0
				JY.Person[168]["攻击力"] = 800
				JY.Person[168]["防御力"] = 800
				JY.Person[168]["轻功"] = 800
				JY.Person[168]["拳掌功夫"] = 600
				JY.Person[168]["武功3"] = 117
				JY.Person[168]["武功等级3"] = 999
				JY.Person[168]["技能2"] = 13
				JY.Person[167]["技能2"] = 13
				JY.Person[8]["技能2"] = 13
			if WarMain(148) == false then
				instruct_13()
				say("...我太大意了",0)
				say("看来恩人你与这门武功无缘阿...",8)
			else
				say("这试炼可真难...",0)
				say("哈哈哈，但恩人你可成功了阿",8)
				say("还得多谢唐长老给这个机会",0)
				QZXS("领悟阴阳磨秘传！")
				SetS(111,0,0,0,189)
				say("没什么，能祝恩人一臂之力也是幸事。",8)
			end
	end
	addevent(-2,0,1,-2,5364)	
else
	say("是你阿，所来何事？",8)	
	say("无事，来看看",0)
	say("好，你自便吧",8)	
end	
end

OEVENTLUA[1397] = function()
	
end

OEVENTLUA[1398] = function()
	
end

OEVENTLUA[1399] = function()
	
end

--[[
周线：周+张，狮子吼，神门，绕指，正反两仪，乾坤+九阳+七伤+梯云+透骨针，灭剑+四象+临济，金刚不坏，倚天+屠龙+玄铁
赵线：赵+张，狮子吼，神门，绕指，幻阴，正反两仪，乾坤+九阳+圣火+圣火+透骨针+七伤+四象，倚天+屠龙
正线：张+昭+杨，狮子吼，正反两仪，龙爪，灭剑，乾坤+九阳+梯云纵+七伤，圣火+圣火+阴风刀，倚天+屠龙+圣火
邪线：朱+宋+张，幻阴，正反两仪，七伤，灭剑，棉掌+乾坤+九阳+梯云纵+圣火+阴风刀，倚天+屠龙，10点兵器

倚天六大门派线
	武当 - 宋远桥处得知俞3未回
	荆州 - 小房间里救俞3
	武当 - 宋远桥处得神门，答应去寻张5
    洛阳 - 酒客对话得知张5和殷素素n年前与屠龙刀失踪下落不明
	冰火岛 - 单挑谢逊，可败，胜则得狮子吼，见到张5与殷素素，随队行动，得到蚊须针，进洛阳
    洛阳 - 张无忌中寒毒，群殴玄冥二老，张殷回武当
    武当 - 宋远桥对话得知张5夫妇自尽，无忌下落不明，答应寻找，得绕指柔剑
    峨嵋 - 蝠王抓人，单挑之，赢则灭绝给四象掌，答应帮助6大派打明教
    光明顶 - 和其他门派群殴鹰王+蝠王+左右使+明教弟子，张无忌出现，（物品清零）单挑之，可败
            无忌自亮身份，指认成昆，主角罢斗，武当退出，其余5大派撤退
	昆仑/峨嵋/崆洞 - 得知掌门没有回来
	光明顶 - 告知无忌昆仑+峨嵋+崆峒派失踪
	成昆居 - 分支，选是则群殴成昆+若干小兵，否则得幻阴指
	
周芷若线	
	绿柳山庄 - 救人，群殴玄冥二老+小兵，救4派，得正反两仪+七伤拳，周芷若加入，得灭剑绝剑+临济十二庄+倚天剑+玄铁指环
	光明顶 - 无忌加入，得乾坤+九阳+梯云纵
	绿柳山庄 - 无忌+主角挑阿大+阿二+阿三，得金刚不坏，群殴123+玄冥二老+成昆+小兵
	冰火岛 - 与谢逊对话，得屠龙刀+倚天屠龙记
	
	
赵敏线 
	绿柳山庄 - 队伍有空位触发剧情，单挑阿大，再挑阿二，继续挑阿三，赵敏加入，得倚天剑
	绿柳山庄 - 与手下对话开始n连战
		1）主角挑昆仑夫妇，赵敏第一格洗两仪剑法，得两仪剑法
		2）主角挑高矮长老，赵敏第二格洗反两仪刀法，得反两仪刀
		3）主角挑崆峒3老，赵敏第三格洗七伤拳，得七伤拳
		4）主角挑灭绝，赵敏第四格洗灭剑绝剑，得灭剑绝剑		
	绿柳山庄 - 再与手下对话，张无忌来救人，群殴二大法王+逍遥二仙+张无忌+小兵
	武当 - 玄冥二老+主角挑张三丰+张无忌，可败，赵敏给黑玉断续膏，无忌加入，得九阳+乾坤，一行人出海找屠龙刀
	冰火岛 - 打三使，得圣火令+阴风刀+圣火神功，谢逊送屠龙刀
	绿柳山庄 - 群殴玄冥二老+成昆+123+小兵，得倚天屠龙记
	


何足道支线
	需在触发任何倚天剧情之前
	昆仑山 - 为小妾治病，被恩将仇报，群殴昆仑
	少室山三颗树下左方石头旁 - 有焦尾琴，与之下棋，赢则可挑战之，胜后加入
	

]]

OEVENTLUA[9000] = function() --武斗场
local ZD;
local WP;
ZD=math.random(386)
WP=math.random(342)
say("骚年，你看到我说明你要走运了！！！！", 129)
say("不要开玩笑了，我被那两个老头说要去找什么天书，哪来的好运？我看是厄运吧！", 0)
say("其实我是竹风雨滴安排来帮助你的！！！！", 129)
say("竹风雨滴？不认识！", 0)
say("哈哈哈！其实我也不认识！！！！", 129)
say("那你在小村做什么？", 0)
say("刚才不是说过了，我是来帮助你的！", 129)
say("那你要我怎么帮助我呢？", 0)
say("这里其实是武斗场的入口，我是看门的！", 129)
say("武斗场？不明白。", 0)
say("你可以和你的队友一起进去挑战，然后获得奖品。非要我说得那么直白！！！", 129)
say("<......>看来不错，我就开始战斗了！", 0)
say("战斗、人物是随机的，就看骚年你到底是不是帅哥美女了！嘿嘿嘿！！！", 129)
local money = 5000 
	Cls()
	TalkEx("现在体验需要支付"..money.."两银子，可否愿意？", 129)
	Cls()
	if DrawStrBoxYesNo(-1, -1, "要给钱么？", C_WHITE, 30) == false then	
		TalkEx("是吗？真可惜。", 129)
		do return end
	end
	Cls()
	if JY.GOLD < money then
		say("骚年，你的钱不够！", 129)
		do return end
	end
	Cls()
	say(".........")	
	instruct_2(174, -money)
	Cls()
QZXS("战斗开始")
instruct_0(); -- 0(0)::空语句(清屏)
if instruct_6(ZD,0,0,1) ==false then
instruct_13();
say("骚年，看来你还要再努力一番才是。", 129)
instruct_0();
do return; end
end
instruct_13();   --  13(D):重新显示场景
instruct_0(); -- 0(0)::空语句(清屏)
say("骚年好功夫，这东西你就那去吧！", 129)
instruct_2(WP,1);
instruct_0();   --  0(0)::空语句(清屏)
end

--乱斗场
OEVENTLUA[9001] = function()-----菜单
-----------------------------------------------------------      
	CC.menu = {};
	for i = 1,500 do			--2维数组必须逐个定义
	    CC.menu[i] = {};
	end
	CC.i = 1 --菜单上的人物编

------------------------------------------------------------
--人物 录入函数
local function All_team(pid1,pid2)
	for i = pid1,pid2 do
		CC.menu[CC.i][1] = CC.i..JY.Person[i]["姓名"];
		CC.menu[CC.i][2] = nil;
		CC.menu[CC.i][3] = 1;
		CC.menu[CC.i][4] = i;
		CC.i = CC.i + 1;		
	end
end

----------------------------------------------------------
--全人物录入,新增人物也可以在此添加	
	All_team(0,189);
	All_team(451,454);
	All_team(455,457);
	All_team(458,459);
	All_team(497,577);--小日本
	All_team(592,605);
	All_team(614,617);
	All_team(618,654);
	All_team(657,662); 
	CC.num = CC.i - 1;-- 总人数
	
local function My_Select(menu,num,list) -- 生成菜单选人并传回目标ID的函数
	local nexty = CC.MainSubMenuY + CC.SingleLineHeight;	
	local r = ShowMenu(menu,num,list,CC.MainSubMenuX,nexty,0,0,1,1,CC.DefaultFont,C_ORANGE,C_WHITE);
	if r == 0 then
        return -1;
    end
	return menu[r][4];	
end
	
local function Banner(talk)
DrawStrBox(CC.MainSubMenuX, CC.MainSubMenuY,talk, C_WHITE, CC.DefaultFont)
end

local function Claim(name1,name2)
    Talk(string.format("比武开始!*%s对阵%s---!!! ",name1,name2),50);
    if WarMain(102,1) == true then
        instruct_13();
        DrawStrBoxWaitKey(string.format("本场战斗的胜利者是%s!!!",name1),C_WHITE,CC.DefaultFont);
    else
        instruct_13();
        DrawStrBoxWaitKey(string.format("本场战斗的胜利者是%s!!!",name2),C_WHITE,CC.DefaultFont);
    end
end

local function TZ_tiyan()          
	Cls();
	say("全人物大体验可以让你操作任意人物与你指定的NPC,包括处于NPC 模式下的队友进行单挑!!!", 592);	
    local f = DrawStrBoxYesNo(-1,-1,"想要继续吗(Y/N)? ",C_ORANGE,CC.DefaultFont);
	if f == false then
        return;
    end
	Cls(); 
	Banner("小兄弟想体验谁?");	
	CC.Substituteid = My_Select(CC.menu,CC.num,10);     --体验对象ID	
	if CC.Substituteid == -1 then
        return 0 ;
    end
	Cls();
	Banner("要挑战谁?");
	CC.Substituteid2 = My_Select(CC.menu,CC.num,10);    --挑战对象ID
	if CC.Substituteid2 == -1 then
        return 0 ;
    end
	if CC.Substituteid == CC.Substituteid2 then 
	    Talk ("想自虐？不可能。请选择不同队友之间比武!!", 592);
	    return;
	end
	CC.t = {};
	for i = 1,CC.TeamNum do
		CC.t[i] = JY.Base["队伍"..i];                   --标记原队友ID
	end
	CC.Flag0 = true;                                     --体验模式标记
	Claim(JY.Person[CC.Substituteid]["姓名"],JY.Person[CC.Substituteid2]["姓名"])
    Cls();
    return 1;
end
	
local function TZ_sishen()
    Cls();
	say("你可以选择在队伍中的任意队友与大神单挑!!!", 592);
	local f = DrawStrBoxYesNo(-1,-1,"想要继续吗(Y/N)? ",C_ORANGE,CC.DefaultFont);
	if f == false then
        return;
    end
	Cls();
	local menu2={{"挑战乔峰",nil,2,50},{"神秘小二",nil,1,585},{"挑战张三丰",nil,1,5},{"挑战东方不败",nil,1,27}
			,{"挑战王重阳",nil,1,129},{"挑战无酒不欢",nil,1,455},{"挑战霍山",nil,1,558},{"挑战独孤求败",nil,1,592}
			,{"挑战黄裳",nil,1,599},{"挑战林朝英",nil,1,601},{"挑战段思平",nil,1,602},{"挑战达摩祖师",nil,1,615}
		    ,{"挑战逍遥子",nil,1,618}}
    local num = table.getn(menu2);
        
	Banner("请选择对手");	
	CC.Substituteid2 = My_Select(menu2,num,0) -- 对手ID
    if CC.Substituteid2 == -1 then
        return 0;
    end
	Cls();
	
	Banner("请选择进行单挑的队员");	
	CC.Substituteid = CC.Select() ; --队友ID
	if CC.Substituteid == -1 then
	    return 0;
	end
	CC.Flag1=true;
	
	Claim(JY.Person[CC.Substituteid]["姓名"],JY.Person[CC.Substituteid2]["姓名"]);
	Cls();
    return 1;
end
	
local function TZ_duiyou()
	Cls();
	say("你可以选择在队伍中的任意两位队员进行切磋, 队员都处于非NPC 模式!!!", 592);
	local f = DrawStrBoxYesNo(-1,-1,"想要继续吗(Y/N)? ",C_ORANGE,CC.DefaultFont);
	if f == false then
        return;
    end
	Cls();
	Banner("请选择进行单挑的队员");	
	CC.Substituteid = CC.Select() ;
	if CC.Substituteid == -1 then
		return 0
	end
    Cls();
	Banner("请选择对手");	
	CC.Substituteid2 = CC.Select() ;
	if CC.Substituteid2 == -1 then
		return 0
	end
	if CC.Substituteid == CC.Substituteid2 then 
		Talk ("想自虐？不可能。请选择不同队友之间比武!!",592);
		return;
	end
	CC.Flag2 = true
	Claim(JY.Person[CC.Substituteid]["姓名"],JY.Person[CC.Substituteid2]["姓名"]);
	Cls();
	return 1;
end
--[[
local function TZ_NPC()
    Cls();       
    say("NPC 大对决可以让你选中两位人物进行NPC 模式的单挑, 此战斗不可操作!!!", 592);
	local f = DrawStrBoxYesNo(-1,-1,"想要继续吗(Y/N)? ",C_ORANGE,CC.DefaultFont);
	if f == false then
        return;
    end
	Cls(); 
	Banner("请选择第一位参加战斗的人物");	
	CC.Substituteid = My_Select(CC.menu,CC.num,10); --体验对象ID	
	if CC.Substituteid == -1 then
        return 0 ;
    end
	Cls();
	Banner("要挑战谁?");    
    CC.Substituteid2 = My_Select(CC.menu,CC.num,10); --挑战对象ID
	if CC.Substituteid2 == -1 then
        return 0 ;
    end
	if CC.Substituteid == CC.Substituteid2 then 
	    Talk ("想自虐？不可能。请选择不同队友之间比武!!",592);
	    return;
	end
	CC.t={};
	for i = 1,CC.TeamNum do
		CC.t[i] = JY.Base["队伍"..i];    --标记原队友ID
	end
	CC.Flag3 = true;                     --NPC大对决标记
	Claim(JY.Person[CC.Substituteid]["姓名"],JY.Person[CC.Substituteid2]["姓名"])
	Cls();
    return 1;
end
]]
function CC.Select()           --选择队友并传回ID
	local nexty = CC.MainSubMenuY + CC.SingleLineHeight
	local s= SelectTeamMenu(CC.MainSubMenuX, nexty)	
	if s == 0 then
		return -1;
    end
	local r = JY.Base["队伍" .. s];
	return r;
end

function WarSetPerson()            --设置战斗人物位置
-------------------------------------------------------------------------
if (CC.Flag0 ~=nil) or (CC.Flag1 ~= nil) or (CC.Flag2 ~= nil) or (CC.Flag3 ~= nil)  then
    local id = CC.Substituteid;
	local id2 = CC.Substituteid2;
--------------------------------------------------------------------------------	
	if (CC.Flag0 ~= nil) then
		JY.Base["队伍"..1] = id;
		for i = 2,CC.TeamNum do
			JY.Base["队伍"..i] = -1;     --清空队伍数据
		    CC.Flag0_1 = true;            --标识队伍数据清空
		end
	end
	
	if (CC.Flag3 ~= nil) then		
		for i = 1,CC.TeamNum do
			JY.Base["队伍"..i] = -1;      --清空队伍数据
		CC.Flag0_1 = true;                 --标识队伍数据清空
		end
	end
----------------------------------------------------------------------------------	
	for j = 0,WAR.PersonNum -1 do
		if WAR.Person[j]["人物编号"] == 0 then  
		    WAR.Person[j]["人物编号"] = id; 
		    WAR.Person[j]["贴图"] = WarCalPersonPic(j);
		    lib.PicLoadFile(string.format(CC.FightPicFile[1],JY.Person[id]["头像代号"]),
		    string.format(CC.FightPicFile[2],JY.Person[id]["头像代号"]),
			4 + j);		
	    end
		if WAR.Person[j]["人物编号"] == 43 then  
		    WAR.Person[j]["人物编号"] = id2;
		    WAR.Person[j]["贴图"] = WarCalPersonPic(j);
	        lib.PicLoadFile(string.format(CC.FightPicFile[1],JY.Person[id2]["头像代号"]),
		    string.format(CC.FightPicFile[2],JY.Person[id2]["头像代号"]),
			4 + j); 
		end 
	end
	CC.Flag0=nil;
	CC.Flag1=nil;
	CC.Flag2=nil;
	CC.Flag3=nil
end
----------------------------------------------------------------------------------------------

 	CleanWarMap(2,-1);
 	CleanWarMap(5,-1);
	for i = 0,WAR.PersonNum -1 do
        if WAR.Person[i]["死亡"] == false then
            SetWarMap(WAR.Person[i]["坐标X"],WAR.Person[i]["坐标Y"],2,i);
            SetWarMap(WAR.Person[i]["坐标X"],WAR.Person[i]["坐标Y"],5,WAR.Person[i]["贴图"]);
	        ---------------------------------------修改
	    elseif (CC.Flag0_1 ~= nil) then
	        for i = 1,CC.TeamNum do
	            JY.Base["队伍"..i] = CC.t[i];      --还原队伍数据 
	            CC.Flag0_1 = nil;
            end
            -----------------------------------------
	    end
    end
end
----------------------------------------------------------------------------函数定义结束
        
	say("骚年，欢迎来体验中心！", 592);
	say("这里只有体验，没有奖励！", 592);
	say("也许下个版本会加入奖励，也许......", 592);
	local money = 5000 
	Cls()
	TalkEx("现在体验需要支付"..money.."两银子，可否愿意？", 592)
	Cls()
	if DrawStrBoxYesNo(-1, -1, "要给钱么？", C_WHITE, 30) == false then	
		TalkEx("是吗？真可惜。", 592)
		do return end
	end
	Cls()
	if JY.GOLD < money then
		say("骚年，你的钱不够！", 592)
		do return end
	end
	Cls()
	say("..........")	
	instruct_2(174, -money)
	Cls()
	DrawStrBox(CC.MainSubMenuX, CC.MainSubMenuY,"欢迎来到体验中心,请选择:", C_WHITE, CC.DefaultFont)
    local menu1 = {{"NPC大体验",TZ_tiyan,2},--[[{"NPC大对决(不可操作)",TZ_NPC,1},]]{"队员挑战大神",TZ_sishen,1},{"队友切磋",TZ_duiyou,1}};
    local nexty = CC.MainSubMenuY + CC.SingleLineHeight;
	local num = table.getn(menu1);
	local r = ShowMenu(menu1,num,0,CC.MainSubMenuX,nexty,0,0,1,1,CC.DefaultFont,C_ORANGE,C_WHITE);
    Cls();
end

--小村铁匠铺
OEVENTLUA[9011] = function()
    local money = 20000 
	Cls()
	TalkEx("这位骚年，我们铁匠铺可以帮你锻炼身上的神兵利器，只需要"..money.."两银子，你有兴趣吗？", 338, 0, "铁匠")
	Cls()
	if DrawStrBoxYesNo(-1, -1, "要给钱么？", C_WHITE, 30) == false then	
		TalkEx("是吗？真可惜。", 338, 0, "铁匠")
		do return end
	end
	Cls()
	if JY.GOLD < money then
		say("骚年，你的钱不够！", 338, 0, "铁匠")
		do return end
	end
	Cls()
    local thing = {}
    local thingnum = {}
    for i = 0, CC.MyThingNum - 1 do
        thing[i] = -1
        thingnum[i] = 0
    end
    local num = 0
    for i = 0, CC.MyThingNum - 1 do
        local id = JY.Base["物品" .. i + 1]
        if id >= 0 then
		    if JY.Thing[id]["类型"] == 1 then
		        thing[num] = id
		        thingnum[num] = JY.Base["物品数量" .. i + 1]
		        num = num + 1
		    end
        end 
    end
    local r = 0
	r = SelectThing(thing, thingnum)	
	if r < 1 then
		Cls()
		say("不要就算了！", 338, 0, "铁匠")
		do return end
	end
	
	Cls()
	say("那就有劳了。")	
	instruct_2(174, -money)
	Cls()
	local aa, bb
	aa = math.random(10, 20) 
	bb = aa
	if JY.Thing[r]["使用人"] >= 0 then
		if JY.Thing[r]["装备类型"] == 1 then
			if doublearmor(JY.Thing[r]["使用人"]) then
				aa = aa * 2
			end
		end
		if JY.Thing[r]["装备类型"] == 0 then
			if doubleweapon(JY.Thing[r]["使用人"]) then
				aa = aa * 2
			end		
		end
	end	
	JY.Thing[r]["加攻击力"] = JY.Thing[r]["加攻击力"] + aa
	QZXS(JY.Thing[r]["名称"].."增加攻击力".. bb.."点")
	aa = math.random(2, 5) * 2
	bb = aa
	if JY.Thing[r]["使用人"] >= 0 then
		if JY.Thing[r]["装备类型"] == 1 then
			if doublearmor(JY.Thing[r]["使用人"]) then
				aa = aa * 2
			end
		end
		if JY.Thing[r]["装备类型"] == 0 then
			if doubleweapon(JY.Thing[r]["使用人"]) then
				aa = aa * 2
			end		
		end
	end	
	JY.Thing[r]["加防御力"] = JY.Thing[r]["加防御力"] + aa
	QZXS(JY.Thing[r]["名称"].."增加防御力".. bb.."点")	
	aa = math.random(2, 5) * 2
	bb = aa
	if JY.Thing[r]["使用人"] >= 0 then
		if JY.Thing[r]["装备类型"] == 1 then
			if doublearmor(JY.Thing[r]["使用人"]) then
				aa = aa * 2
			end
		end
		if JY.Thing[r]["装备类型"] == 0 then
			if doubleweapon(JY.Thing[r]["使用人"]) then
				aa = aa * 2
			end		
		end
	end	
	JY.Thing[r]["加轻功"] = JY.Thing[r]["加轻功"] + aa
	QZXS(JY.Thing[r]["名称"].."增加轻功".. bb.."点")
end

--小村店铺
OEVENTLUA[9012] = function()
    CC.NEW1 = {"任务", "挑战","金库", "调内", "遗忘","替换","退出"}
    local r = JYMsgBox(CC.EVB212, CC.EVB213, CC.NEW1, 7, 339)
    if r == 1 then
        local pid, eid = -1
	    local number = math.random(3)
	    say("骚年，有任务要你的队友去做。", 339, 0,"老板娘") 	
	    Cls()
	    if GetS(106, 63, 20, 0) >= math.modf(5 + 5 * tianshu()) then
		    say("最近暂时没有什么任务，过段时间再来吧。", 339, 0,"老板娘") 	
		    do return end
	    end	
	    local event = math.random(#CC.battle)
	    say(CC.battle[event][4], 339, 0,"老板娘") 
	    Cls()
	    if not inteam(CC.battle[event][2]) then
		    do return end
	    end
	    say("你就是那个人？", 339, 0,"老板娘") 	
	    Cls()
	    if DrawStrBoxYesNo(-1, -1, "要接受吗？", C_WHITE, 30) == false then		
		    say("看来你不是。", 339, 0,"老板娘") 	
		    do return end
	    end		
	    SetS(106, 63, 21, 0, CC.battle[event][1])
	    SetS(106, 63, 20, 0, GetS(106, 63, 20, 0) + 1)
	    pid = CC.battle[event][2]
	    eid = CC.battle[event][3]
	    local tmp1 = JY.Person[eid]["攻击力"] 	
	    local tmp2 = JY.Person[eid]["轻功"]
	    local tmp3 = JY.Person[eid]["防御力"]	
	    JY.Person[eid]["攻击力"] = math.modf(JY.Person[pid]["攻击力"] * 0.7) + math.random(100)
	    JY.Person[eid]["轻功"] = math.modf(JY.Person[pid]["轻功"] * 0.6) + 50
	    JY.Person[eid]["防御力"] = math.modf(JY.Person[pid]["防御力"] * 0.7) + math.random(100)
	    if WarMain(291) == false then
		    Cls()
		    JY.Person[eid]["攻击力"] = tmp1
		    JY.Person[eid]["轻功"] = tmp2
		    JY.Person[eid]["防御力"] = tmp3
		    light()
		    say("哎，真菜！", 338, 0,"老板娘") 	
		    for i = 1, number do
			    local str = math.random(7)
			    str = conversion(str)
			    QZXS(changeattrib(pid, str, 2))
		    end
		    do return end
	    end
	        Cls()
	        JY.Person[eid]["攻击力"] = tmp1
	        JY.Person[eid]["轻功"] = tmp2
	        JY.Person[eid]["防御力"] = tmp3	
	        light()
	    for i = 1, number + 1 do
		    local str = math.random(7)
		    str = conversion(str)
		    QZXS(changeattrib(pid, str, 1))
	    end	
	    Cls()
	    say("恭喜恭喜！", 339, 0,"老板娘") 	
    elseif r == 2 then
	    TalkEx("骚年，接受挑战有奖励，输了直接GG，需谨慎！", 339, 0, "老板娘")
		local money = 5000 
	    Cls()
	    TalkEx("现在体验需要支付"..money.."两银子，可否愿意？", 339, 0, "老板娘")
	    Cls()
	    if DrawStrBoxYesNo(-1, -1, "要给钱么？", C_WHITE, 30) == false then	
		    TalkEx("是吗？真可惜。", 339, 0, "老板娘")
		    do return end
	    end
	    Cls()
	    if JY.GOLD < money then
		    say("骚年，你的钱不够！", 339, 0, "老板娘")
		    do return end
	    end
	    Cls()
	    say("..........")	
	    instruct_2(174, -money)
	    Cls()
	    local teamnum = 1
	    local enemy = -1
	    local prot = -1
	    for i = 2, CC.TeamNum do
		    if JY.Base["队伍" .. i] > 0 then
			    teamnum = teamnum + 1
		    end
	    end
	    prot = JY.Base["队伍" .. math.random(teamnum)]
	    SetS(106, 63, 1, 0, prot)
	    while true do
	    enemy = math.random(1, 929)
            if JY.Person[enemy]["排行"] < 7 and not duiyou(enemy) and JY.Person[enemy]["排行"] > 3 and not xiaobin(enemy) then
		        break
	        end
        end
	    SetS(106, 63, 2, 0, enemy)
	    Cls()	
	    say("久闻"..JY.Person[prot]["姓名"].."大名，切磋一番！", enemy)
	    if DrawStrBoxYesNo(-1, -1, "要比武么？", C_WHITE, 30) == false then	
		    say("我的钱感觉被坑了......！")	
		    do return end
	    end
	    JY.Person[enemy]["攻击力"] = JY.Person[enemy]["攻击力"] + 150
	    JY.Person[enemy]["轻功"] = JY.Person[enemy]["轻功"] + 150
	    JY.Person[enemy]["防御力"] = JY.Person[enemy]["防御力"] + 150
	    JY.Person[enemy]["生命最大值"] = JY.Person[enemy]["生命最大值"] + 500	
	    JY.Person[enemy]["生命"] = JY.Person[enemy]["生命最大值"]			
        local exeha = prot
	    if WarMain(288) == true then
	        JY.Person[enemy]["攻击力"] = JY.Person[enemy]["攻击力"] - 150
	        JY.Person[enemy]["轻功"] = JY.Person[enemy]["轻功"] - 150
	        JY.Person[enemy]["防御力"] = JY.Person[enemy]["防御力"] - 150	
	        JY.Person[enemy]["生命最大值"] = JY.Person[enemy]["生命最大值"] - 500	
	        JY.Person[enemy]["生命"] = JY.Person[enemy]["生命最大值"]
            AddPersonAttrib(exeha, "实战", 15)	
            QZXS(JY.Person[exeha]["姓名"].."实战增加15点！")
            AddPersonAttrib(exeha, "攻击力", 20)
	        QZXS(JY.Person[exeha]["姓名"].."攻击力增加20点！")
            AddPersonAttrib(exeha, "防御力", 20)
            Cls()
	        QZXS(JY.Person[exeha]["姓名"].."防御力增加20点！")
            AddPersonAttrib(exeha, "轻功", 20)
            QZXS(JY.Person[exeha]["姓名"].."轻功增加20点！")
            AddPersonAttrib(exeha, "生命最大值", 50)
	        QZXS(JY.Person[prot]["姓名"].."生命最大值增加50点！")
            Cls()
            AddPersonAttrib(exeha, "内力最大值", 150)
	        QZXS(JY.Person[prot]["姓名"].."内力最大值增加150点！")
            AddPersonAttrib(exeha, "御剑能力", 6)
	        QZXS(JY.Person[prot]["姓名"].."御剑能力增加6点！")
            AddPersonAttrib(exeha, "耍刀技巧", 6)
	        QZXS(JY.Person[exeha]["姓名"].."耍刀技巧增加6点！")
            Cls()
            AddPersonAttrib(exeha, "拳掌功夫", 6)
	        QZXS(JY.Person[exeha]["姓名"].."拳掌功夫增加6点！")
            AddPersonAttrib(exeha, "特殊兵器", 6)
	        QZXS(JY.Person[exeha]["姓名"].."特殊兵器增加6点！")
            AddPersonAttrib(exeha, "暗器技巧", 6)
	        QZXS(JY.Person[exeha]["姓名"].."暗器技巧增加6点！")
        else
		    instruct_15(0);   
		    instruct_0();   
        end
	elseif r == 3 then
	    CC.NEW2 = {"存钱", "取钱","退出"}
        local r2 = JYMsgBox("小金库", "多余的银子交给本姑娘替你保管，*万无一失。", CC.NEW2, 3, 339)
	    CC.NEW3 = {"一万", "两万","三万","退出"}
	    if r2 == 1 then
	        local r3 = JYMsgBox("存钱", string.format("携带的银两为%d两    *金库存款为%d两    ",JY.GOLD,GetS(52, 0, 0, 5)*1000), CC.NEW3, 4, 339)
	        local cc = 0
	    if r3 == 1 then
	        if instruct_31(10000) ==false then
	            QZXS("抱歉，您身上没有那么多银子！");
	            return 0
	        end
	        cc = 10
	        instruct_32(174,-10000)
	        QZXS("您已经成功存储了一万两银子！");
	    elseif r3 == 2 then
	        if instruct_31(20000) ==false then
	            QZXS("抱歉，您身上没有那么多银子！");
	            return 0
	        end
	        cc = 20
	        instruct_32(174,-20000)
	        QZXS("您已经成功存储了两万两银子！");
	    elseif r3 == 3 then
	        if instruct_31(30000) ==false then
	            QZXS("抱歉，您身上没有那么多银子！");
	            return 0
	        end
	        cc = 30
	        instruct_32(174,-30000)
	        QZXS("您已经成功存储了三万两银子！");
	    end
	    SetS(52, 0, 0, 5, (cc + GetS(52, 0, 0, 5)))
	    elseif r2 == 2 then
	        local r3 = JYMsgBox("取钱", string.format("当前的银两为%d两    *金库存款为%d两    ",JY.GOLD,GetS(52, 0, 0, 5)*1000), CC.NEW3, 4, 339)
	        local qc = 0
	        local ck = GetS(52, 0, 0, 5)
	        if r3 == 1 then
	            if ck < 10 then
	                QZXS("抱歉，您还没有存款！");
	                return 1
	            end
	            qc = 10
	            instruct_2(174,10000) 
	        elseif r3 == 2 then
	            if ck < 20 then
	                QZXS("抱歉，您没有那么多存款！");
	                return 1
	            end
	            qc = 20
	            instruct_2(174,20000) 
	        elseif r3 == 3 then
	            if ck < 20 then
	               QZXS("抱歉，您没有那么多存款！");
	               return 1
	            end
	            qc = 30
	            instruct_2(174,30000) 
	        end
	        SetS(52, 0, 0, 5, (GetS(52, 0, 0, 5) - qc))
	    end
	elseif r == 4 then	
	    Cls()
		local nexty
		local s
		local pid
		local money = 5000 
	    Cls()
	    TalkEx("现在体验需要支付"..money.."两银子，可否愿意？", 339, 0, "老板娘")
	    Cls()
	    if DrawStrBoxYesNo(-1, -1, "要给钱么？", C_WHITE, 30) == false then	
		    TalkEx("是吗？真可惜。", 339, 0, "老板娘")
		    do return end
	    end
	    Cls()
	    if JY.GOLD < money then
		    say("骚年，你的钱不够！", 339, 0, "老板娘")
		    do return end
	    end
	    Cls()
	    say("..........")	
	    instruct_2(174, -money)
	    Cls()
		DrawStrBox(CC.MainSubMenuX, CC.MainSubMenuY, "谁要调整内力?", C_WHITE, CC.DefaultFont);
		nexty = CC.MainSubMenuY + CC.SingleLineHeight;
		s = SelectTeamMenu(CC.MainSubMenuX, nexty);
		if s == 0 then return end
		pid = JY.Base["队伍"..s];
		local ms = JYMsgBox("调整",
		JY.Person[pid]["姓名"].."需要调整为那种内力?",{"阴内","阳内","调和","取消"},4,66)
		if ms == 1 then JY.Person[pid]["内力性质"] = 0 end
		if ms == 2 then JY.Person[pid]["内力性质"] = 1 end
		if ms == 3 then JY.Person[pid]["内力性质"] = 2 end
	elseif r == 5 then	
	    Cls()
		local f		
	    local kfid	
	    local i = nil
		local nexty
		local s
		local pid
		local money = 5000 
	    Cls()
	    TalkEx("现在体验需要支付"..money.."两银子，可否愿意？", 339, 0, "老板娘")
	    Cls()
		TalkEx("还需要额外支付3000技能点，可否愿意？", 339, 0, "老板娘")
	    Cls()
	    if DrawStrBoxYesNo(-1, -1, "要给钱么？", C_WHITE, 30) == false then	
		    TalkEx("是吗？真可惜。", 339, 0, "老板娘")
		    do return end
	    end
	    Cls()
	    if JY.GOLD < money then
		    say("骚年，你的钱不够！", 339, 0, "老板娘")
		    do return end
		end	
		if CC.SKpoint < 3000 then 
			say("骚年，你的技能点不够！", 339, 0, "老板娘")
            do return end	
	    end
	    Cls()
	    say("..........")	
	    instruct_2(174, -money)
		CC.SKpoint = CC.SKpoint - 3000
	    Cls()
		DrawStrBox(CC.MainSubMenuX, CC.MainSubMenuY, "谁要遗忘技能?", C_WHITE, CC.DefaultFont);
		nexty = CC.MainSubMenuY + CC.SingleLineHeight;
		s = SelectTeamMenu(CC.MainSubMenuX, nexty);
		if s == 0 then return end
		pid = JY.Base["队伍"..s];
		if JY.Person[pid]["武功1"] == 0 then
			QZXS("没技能你遗忘个屁啊？", 339, 0, "老板娘")
			return
		end
		local kfmenu={{nil,nil,0},{nil,nil,0},{nil,nil,0},{nil,nil,0},{nil,nil,0},
					{nil,nil,0},{nil,nil,0},{nil,nil,0},{nil,nil,0},{nil,nil,0}
					,{nil,nil,0},{nil,nil,0}};
		for i = 1,12 do
			kfmenu[i][1] = JY.Wugong[JY.Person[pid]["武功"..i]]["名称"]
			if JY.Person[pid]["武功"..i] ~= 0 then
				kfmenu[i][3] = 1
			end
		end
		Cls();
		local r = ShowMenu(kfmenu,10,0,10,10,0,0,1,1,CC.DefaultFont,C_ORANGE,C_WHITE)
		if r == 0 then return end
		if JY.Person[pid]["武功"..r] == 91 or (JY.Person[pid]["武功"..r] > 108 and 113 > JY.Person[pid]["武功"..r]) then
			QZXS(JY.Wugong[JY.Person[pid]["武功"..r]]["名称"].."不能被遗忘！")
			return
		elseif JY.Person[pid]["武功2"] == 91 and JY.Person[pid]["武功3"] == 0 then
			QZXS("学了风林或者六如后至少要留一个技能，不能遗忘！")
			return
		end
		if DrawStrBoxYesNo(-1,-1,"确定要遗忘"..JY.Wugong[JY.Person[pid]["武功"..r]]["名称"].."吗？",C_WHITE,CC.DefaultFont)==false then
			Cls();
		else
			f = math.modf(JY.Person[pid]["武功等级"..r]/100 + 1)
			QZXS(JY.Wugong[JY.Person[pid]["武功"..r]]["名称"].."已经被遗忘"..f.."级。")
			kfid = JY.Wugong[JY.Person[pid]["武功"..r]]["代号"]
			local i = nil
			for i = 0,JY.ThingNum -1 do
				if JY.Thing[i]["练出武功"] == kfid then
					AddPersonAttrib(pid, "内力最大值", -f * JY.Thing[i]["加内力最大值"])
					AddPersonAttrib(pid, "攻击力", -f * JY.Thing[i]["加攻击力"])
					AddPersonAttrib(pid, "轻功", -f * JY.Thing[i]["加轻功"])
					AddPersonAttrib(pid, "防御力", -f * JY.Thing[i]["加防御力"])
					AddPersonAttrib(pid, "医疗能力", -f * JY.Thing[i]["加医疗能力"])
					AddPersonAttrib(pid, "用毒能力", -f * JY.Thing[i]["加用毒能力"])
					AddPersonAttrib(pid, "解毒能力", -f * JY.Thing[i]["加解毒能力"])
					AddPersonAttrib(pid, "抗毒能力", -f * JY.Thing[i]["加抗毒能力"])
					AddPersonAttrib(pid, "拳掌功夫", -f * JY.Thing[i]["加拳掌功夫"])
					AddPersonAttrib(pid, "御剑能力", -f * JY.Thing[i]["加御剑能力"])
					AddPersonAttrib(pid, "耍刀技巧", -f * JY.Thing[i]["加耍刀技巧"])
					AddPersonAttrib(pid, "特殊兵器", -f * JY.Thing[i]["加特殊兵器"])
					AddPersonAttrib(pid, "暗器技巧", -f * JY.Thing[i]["加暗器技巧"])
					AddPersonAttrib(pid, "武学常识", -f * JY.Thing[i]["加武学常识"])
					AddPersonAttrib(pid, "品德", -f * JY.Thing[i]["加品德"])
					AddPersonAttrib(pid, "攻击带毒", -f * JY.Thing[i]["加攻击带毒"])
				end
			end
			if r > 0 then
				local i = nil
				for i = r,12 do
					if JY.Person[pid]["武功"..i] == 0 then break end
					if JY.Person[pid]["武功2"] == 91 and i == 1 then
						JY.Person[pid]["武功等级1"] = JY.Person[pid]["武功等级3"]
						JY.Person[pid]["武功1"] = JY.Person[pid]["武功3"]
					elseif JY.Person[pid]["武功2"] == 91 and i == 2 then
					elseif i == 12 then
						JY.Person[pid]["武功等级12"] = 0
						JY.Person[pid]["武功12"] = 0
					else
						JY.Person[pid]["武功等级"..i] = JY.Person[pid]["武功等级"..i + 1]
						JY.Person[pid]["武功"..i] = JY.Person[pid]["武功"..i + 1]
					end
				end
			end
		end
		say("我的技能点剩下"..CC.SKpoint)
	elseif r == 6 then
	    local money = 5000
	    TalkEx("现在体验需要支付"..money.."两银子，可否愿意？", 339, 0, "老板娘")
	    Cls()
		TalkEx("还需要额外支付8000技能点，可否愿意？", 339, 0, "老板娘")
	    Cls()
	    if DrawStrBoxYesNo(-1, -1, "要给钱么？", C_WHITE, 30) == false then	
		    TalkEx("是吗？真可惜。", 339, 0, "老板娘")
		    do return end
	    end
	    Cls()
	    if JY.GOLD < money then
		    say("骚年，你的钱不够！", 339, 0, "老板娘")
		    do return end
		end	
		if CC.SKpoint < 8000 then 
			say("骚年，你的技能点不够！", 339, 0, "老板娘")
            do return end	
	    end
	    Cls()
	    say("..........")	
	    instruct_2(174, -money)
		CC.SKpoint = CC.SKpoint - 8000
	    Cls()
        local x1 = CC.MainSubMenuX
        local y1 = CC.MainSubMenuY + CC.SingleLineHeight
        CC.DYRW = -1
        CC.DYRW2 = -1
    	DrawStrBox(x1, y1, "谁要替换天赋？",C_WHITE, CC.DefaultFont);
	    local cc = {}
	    local id = -1
	    for j = 1, CC.TeamNum do
		    cc[j] = {"", nil, 0}
		    id = JY.Base["队伍" .. j]	
		    if id >= 0 and duiyou(id) then
			    cc[j] = { JY.Person[id]["姓名"], nil, 1}
		    end
	    end
	    local numItem = table.getn(cc);
	    local dd = CC.DefaultFont;
	    local r = ShowMenu(cc,numItem,0,x1,y1+40,0,0,1,1,dd,C_ORANGE,C_WHITE);
        if r == 0 then  
		    do return end
		end	
        id = JY.Base["队伍" .. r]
	    CC.DYRW = id
        Cls()
        local aa = 0
        local menu = {}
        for aa = 1, #CC.TFlist do
            menu[aa] = {CC.TFlist[aa][1], nil, 1, aa}
        end
        local bb = ShowMenu3(menu,#menu,10,-2,-2,-2,-2,2,2,22,C_GOLD,C_WHITE,nil, nil,M_DimGray,C_RED)
        Cls()
        aa = menu[bb][4]
        local a = JYMsgBox("老板娘","请选择要替换的天赋",{"１","２","３","４","５"},5,339);
        setTF(id, aa, a)
		say("我的技能点剩下"..CC.SKpoint)
	end
end