--占用[5000-6000]
OEVENTLUA[5009] = function() --欢总移驾刀宗
if XYL(0) then 
say(".....................",455)
say(".....................",0)
say(".....................",455)
say("你为何在我刀宗？",0)
say(".....................",455)
say(".....................",0)
say("无悠让我来的....",455)
say("....那丫头，算了既然她让你来的你就留在这吧，帮我照顾好她。",0)
say("这是自然。",455)
instruct_3(-2,-2,-2,0,5010,0,0,-2,-2,-2,-2,-2,-2);--修改事件定义:当前场景当前场景事件编号
elseif cxzj() == 597 then 
say("不知小公主有何吩咐？",455)
say("无事，来看看。",0)
elseif cxzj() == 929 then 
say("公主殿下吩咐说让你送一份好酒过去。",0)
say("我这就去。",455)
else
say(".....................",455)
say(".....................",0)
say(".....................",455)
say(".....................",0)
say("这年头当个小兵也不容易，少侠别来无恙？",455)
say(".....................",0)
say("少侠何故如此看在下？",455)
say(".....................",0)
say(".....................",455)
say(".....................",0)
say(".....................",455)
say("隐士高人当真是行事不拘一格。",0)
say(".....................",455)
say("龙门一战当真是吓晚辈一跳。",0)
say("在下无心比斗，只愿安心当一个小兵。",455)
say("多谢前辈当日放水，在下感激不尽。",0)
say("我早已没有了争强好胜的心，无需谢我。",455)
say("听当日前辈所言，前辈也是江湖中数一数二的高手，为何隐退在此？",0)
say(".....................",455)
say("晚辈唐突了。",0)
say("无妨，只是有些感慨罢了。",455)
say("当年四兄弟何等意气风发，欲称霸一方。",455)
say("不想却因理念不合各奔东西，多年未曾再见。",455)
say("如非如此，想必如今早已一统天下。",455)
say("不知各位前辈都是何名讳？",0)
say("我大哥改名研究佛理不问世事，名讳我也不方便透露，想来你也没有机会遇见他。",455)
say("二哥独孤，专研武学但求一败，现已改名独孤求败。",455)
say("三哥君宝，如今已开宗立派，江湖人称张真人。",455)
say("张真人的名讳晚辈早有耳闻，想来前辈的其他几位兄长也是高人。",0)
say("而我隐姓埋名，只想安稳度过一生。",455)
say("行走江湖少不得与人打交道，莫要争强好胜。",455)
say("晚辈谨记。",0)
say("少侠有空来看樱花！",455)	
    if GetS(113, 0, 0, 0) == 0 and JY.Person[0]["暗器技巧"] >= 200 then
	    say("少侠留步，这里有一本暗器的炼制方法或许能为你抵挡一下抢书之人。",455) 
		say("霹雳火雷弹！这不是神州三绝的孤本吗？",0)
		say("少侠好眼力，那么我来考考你对暗器认知有多少。",455)  
		say("前辈，请指教！",0) 
	    SetS(106, 63, 1, 0, 0)
        SetS(106, 63, 2, 0, 114)
	    if WarMain(288) == false then
	        instruct_13()  --场景变亮
		    say("少侠行走江湖还是要小心为上！",455) 
	    else
		    say("不错不错，炼制方法就赠予少侠。",455) 
			say("多谢前辈！",0) 
	        QZXS("领悟霹雳火雷弹！")
	        instruct_0();
	        setLW1(175)
			addthing(335)
	    end
    end
	do return end
instruct_3(-2,-2,-2,0,5010,0,0,-2,-2,-2,-2,-2,-2);--修改事件定义:当前场景当前场景事件编号
end
end

OEVENTLUA[5010] = function() --欢总移驾刀宗
if XYL(0) then 
say("无悠那丫头回来让她莫要到处乱跑",0)
say("好的。",455)
else 
say("少侠无事可来看看樱花。",455)
if GetS(99,1,0,0) == 1 and GetS(99,1,1,0) == 0 then 
say("若是惹上了麻烦，可以来此暂避。",455)
SetS(99,1,1,0,1)
end
say("好的。",0)
end
end

OEVENTLUA[5011] = function() --昆仑派门卫
say("掌门已经*率领众弟子前去围剿明教了，现在不接待任何人，速速离去。",192)
end

OEVENTLUA[5012] = function() --昆仑仙境
say("。。居然死了，当真可惜，死者为大，入土为安，不要怪我。")
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
	instruct_3(-2,4,1,0,0,0,0,3348*2,3348*2,3348*2,-2,29,13);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [4]
	instruct_3(-2,5,1,0,0,0,0,3348*2,3348*2,3348*2,-2,27,13);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	instruct_3(-2,6,1,0,0,0,0,3350*2,3350*2,3350*2,-2,29,12);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [4]
	instruct_3(-2,7,1,0,0,0,0,3350*2,3350*2,3350*2,-2,27,12);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	instruct_17(11,1,29,47,0) --  3(3):修改事件定义:场景[明教]:大门开关
    instruct_19(28,14);   --  19(13):主角移动至2D-12
    instruct_40(0);   --  40(28):改变主角站立方向1
	instruct_3(-2,0,1,0,0,0,0,4702*2,4702*2,4702*2,-2,28,13);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
say("嗷！！！！！", 613)
say("什么东西？！！！！！", 0)
	if WarMain(320) == false then
		instruct_15()
		return
	end
	light()
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	addthing(83)
say("这是！！这猴子身上竟有如此神功秘籍！", 0)
say("大难不死必有后福，果然如此。", 0)
end

OEVENTLUA[5013] = function() --昆仑仙境石碑
say("青莲剑仙李白题字。")
end

OEVENTLUA[5014] = function() --明教灭3X
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
say("咦？好像有人说话……", 0)
    instruct_0();   --  0(0)::空语句(清屏)
	instruct_25(29,27,29,15) --场景移动
say("你到底是什么人，怎么进入*我明教的？", 12)
say("你问我成崑怎麽进来的？当*然是大摇大摆走进来的。", 18)	
say("你是混元霹雳手成崑，*谢法王的师父？", 14)
say("没错，*我就是那头笨狮的师父。**拜他的鲁莽所赐，你们和六*大派结下了这麽多梁子。", 18)
say("今天起明教就将化为灰烬，*也了结了我多年来的心愿。", 18)
say("要是我猜的没错，这中间的*一切都是你苦心安排的。", 11)	
say("杨左使倒还蛮聪明的嘛。***没错，激起谢逊的愤怒，*让他到处乱杀人，*留下我的名字好激我现身，*到最后再故意让江湖人知道*其实是明教谢逊所为，引起*江湖各大派与明教间仇杀，*这一切都是我精心计画的。", 18)
say("你为何要如此做？", 14)
say("要问就去问你们前任教主*阳顶天。我原本一桩美好的*姻缘却被他活生生拆散了，*明明是我爱妻，只因他当*上了魔教的大头子，就将我*爱妻霸占了去。*因此我心中便立下重誓：*只要我成崑还有一口气在，*定要让魔教永无宁日。*我立下此誓已有二十余年，*今日方见大功告成。**哈哈！", 18)
say("如今你们明教众高手已经中*了我的暗算，我今日不杀你*们，明日你们就眼看着明教*的覆灭吧，哈哈哈……", 18)
say("哼，我等纵然是死，你不会让你好过！", 11)
say("啊！杨逍，想不到你居然还有后手！", 18)
instruct_30(29,27,29,18);   --  30(1E):主角走动27-49--27-34
instruct_25(29,18,29,29) --场景移动
say("各位当真是好雅兴，可否带上我呢？", 0)
say("谁？！", 18)
say("各位不用紧张，在下所图不过一本书而已，不知谁能给在下解惑呢？", 0)
say("（这小子看起来也不是个善类，或许可以借他之手除掉这几个人）", 18)
say("这....", 11)
say("......", 14)
say("......", 12)
say("这位少侠不知想要何书？", 18)
say("天书。", 0)
say("（天助我也）此事我倒是知道一二。", 18)
say("不知大师可否告知在下？", 0)
say("若是少侠助我除掉明教，我便告知少侠天书下落。", 18)
say("大师此言当真？可莫要诓我。", 0)
say("少侠尽管放心便是。", 18)
say("好，一言为定。", 0)
say("熊熊圣火，焚我身躯，生亦何欢，死亦何苦。", 11)
say("熊熊圣火，焚我身躯，生亦何欢，死亦何苦。", 12)
say("熊熊圣火，焚我身躯，生亦何欢，死亦何苦。", 14)
SetS(11,60,15,0,1)
	if instruct_6(255) ==false then    --光明圣火阵
		instruct_15(0);   --  15(F):战斗失败，死亡
		do return; end
		instruct_0();   --  0(0)::空语句(清屏)
	end
	light()
    instruct_3(-2,90,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [106]
    instruct_3(-2,94,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [107]
    instruct_3(-2,102,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [106]
instruct_37(-2)
say("大师的要求我已经办到了，还请大师不要食言。", 0)
say("汝阳王府有一本少侠所需的天书。", 18)
say("......", 0)
say("少侠不必多疑，我可将少侠引荐给郡主，以少侠的武艺必将受郡主器重。", 18)
say("届时少侠便可趁机取得天书。", 18)
say("听大师所言，想必大师也是那郡主麾下，大师不怕我告诉那郡主？", 0)
say("郡主自会明断是非。", 18)
say("暂且相信大师所言，如若大师骗我，我自会找大师讨个说法。", 0)
say("自然。六大派已在山下，少侠可随我从密道离去，转道去绿柳山庄便可。", 18)
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,103,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [103]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_3(-2,106,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [106]
    instruct_3(-2,107,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [107]
    instruct_3(13,101,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶密道]:场景事件编号 [101]
    instruct_3(13,102,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶密道]:场景事件编号 [102]
    instruct_3(13,0,1,0,5016,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶密道]:场景事件编号 [0]
    instruct_3(13,1,1,0,5016,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶密道]:场景事件编号 [1]
	instruct_3(-2,100,1,0,5015,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [100]
say("（这和尚眼神不对，想来没说实话，先撤再说）", 0)
end

OEVENTLUA[5015] = function() --小昭
say("我叫小昭，是这里的丫鬟。",66)
say("＜哇，怎会有如此美丽的姑*娘！＞",0)
say("欸，公子，你干嘛一直看着*我？",66)
say("姑娘，明教已灭，你一人留在此处怕是有危险，何不跟我一起离去？",0)
say(".......",66)
say("六大派已经攻入光明顶，再不走就来不及了，快跟我走。",0)
say("多谢公子。",66)
instruct_37(2)
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,100,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [100]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
	instruct_3(104,53,1,0,972,0,0,7052,7052,7052,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 
	if instruct_20(4,0) == false then 
	instruct_10(66)
	do return; end
	end
say("你的队伍已满，我就直接去*小村吧。",66)
instruct_3(70,38,1,0,157,0,0,7008,7008,7008,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 
end

OEVENTLUA[5016] = function() --乾坤大挪移
say("莫非这二人竟是阳顶天夫妇*？这里有封信，看看写些什*麽：",0)
say("今余神功第四层初成，*即悉成崑之事，*血气翻涌不克自制，*真力将散，行当大归。*天也命也，复何如耶？**今余命在旦夕，*有负衣教主重托，*实为本教罪人。*盼夫人持余亲笔遗书，*召聚众人，令谢逊暂摄副教*主之位，处份本教重务。。",221,0,"阳顶天") 
say("原来阳教主是在练功时，*因知悉成崑的事后，*不慎走火入魔了。*而阳教主夫人。。。。*这里有把匕首，*看来是因愧疚而自杀了。*这个羊皮卷，大概就是他*当时在练的神功吧。",0)
instruct_2(74)
instruct_0();   --  0(0)::空语句(清屏)
if inteam(66) then 
say("公子，小昭能看看么？",66)
say("嗯？拿去看吧。",0)
say("多谢公子。",66)
instruct_35(66,2,97,0)
instruct_35(0,2,97,0)
tb("小昭学会乾坤大挪移")	
end
instruct_3(11,100,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 100
instruct_3(-2,0,1,0,0,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 100
instruct_3(-2,1,1,0,0,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 100
instruct_3(-2,3,1,0,267,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶密道]:场景事件编号 3
instruct_3(68,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [3]
instruct_3(68,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [13]
instruct_3(68,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [4]
instruct_3(68,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [5]
instruct_3(68,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [6]
instruct_3(68,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [7]
instruct_3(34,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [0]
instruct_3(34,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [1]
instruct_3(34,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [3]
instruct_3(34,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [4]
instruct_3(34,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [5]
instruct_3(34,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [6]
instruct_3(34,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [7]
instruct_3(33,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [2]
instruct_3(33,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [3]
instruct_3(33,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [4]
instruct_3(33,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [5]
instruct_3(33,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [6]
instruct_3(33,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [7]
instruct_3(33,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [8]
instruct_3(33,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [9]
instruct_3(33,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [10]
		for i = 7, 10 do
			addevent(106, i, 0, 5017, 3)
		end
end

OEVENTLUA[5017] = function()
	if instruct_20() then
		do return end
	end
	dark()
	for i = 7, 10 do
		null(-2, i)
	end	
	addevent(-2, 1, 0, 0, 0, 4595*2)
	addevent(-2, 2, 0, 0, 0, 3046*2)
	addevent(-2, 5, 0, 0, 0, 3046*2)
	addevent(-2, 6, 0, 0, 0, 3046*2)
	light()
	bgtalk("只见眼前一人是个年轻公子，轻摇折扇，掩不住一副雍容华贵之气。相貌俊美，双目黑白分明，炯炯有神。只见其腰间悬着一柄长剑，剑柄上赫然镂着“倚天”两个篆文。")
	say("（这人分明是男扮女装，她身上那把剑难道是灭绝的倚天剑？）")
	say("（当真是英雄少年）少侠就是成师傅推荐的人吧，不过这绿柳山庄不收闲杂人物，这就请少侠证明一下自己吧。", 639)
	say("阿三，你就和这位少侠比一下拳脚吧。", 639)
	say("少侠请！", 640)
	if WarMain(351) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	light()
	say("阿二，你上。", 639)
	say("是！", 641)	
	if WarMain(352) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	light()	
	say("阿大，你去试一试少侠的剑法。", 639)
	say("是！", 642)	
	if WarMain(353) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	light()
	addHZ(63)
	say("很好！不愧是成师傅推荐的人才。在下赵敏，刚才多有得罪，向少侠赔不是了。", 639)
	say("赵姑娘客气了，不知姑娘身上的这把剑....")
	say("少侠猜的没错，各大派的人就囚在我这山庄内，少侠不妨随我出去一看。", 639)
	dark()
	null(-2, 1)
	null(-2, 2)
	null(-2, 5)
	null(-2, 6)
	addevent(-2, 15, 1, 5018, 1, 3046*2)
	addevent(-2, 16, 1, 5018, 1, 3046*2)
	addevent(-2, 17, 1, 5018, 1, 3046*2)
	light()
	instruct_10(639)
end

OEVENTLUA[5018] = function()
	if not hasppl(639) then
		say("......", 642)
		do return end
	end
	say("去把几位掌门请出来吧。", 639)
	say("是！", 642)
	dark()
	addevent(-2, 4, 0, 0, 0, 2685*2)
	addevent(-2, 11, 0, 0, 0, 2685*2)
	addevent(-2, 12, 0, 0, 0, 2685*2)
	addevent(-2, 13, 0, 0, 0, 2681*2)
	addevent(-2, 14, 0, 0, 0, 2709*2)
	addevent(-2, 3, 0, 0, 0, 2677*2)
	light()
	say("诸位掌门，这里的规矩你们是知道的了，如果你们能胜得了这位少侠，你们立刻就能走。如若败了，那便留下吧。", 642)
	say("那么少侠请吧。", 639)
	say("（原来她命人逐一与各家掌门相斗，她在旁察看，得以偷学各门各派的精妙招数，当真好计谋）")
    if WarMain(354) then                                              
		AddPersonAttrib(639, "御剑能力", 15)
        QZXS("赵敏御剑能力增加15.")	
		addthing(124)	
	    instruct_37(-1) 
	end			
    if WarMain(355) then
	    AddPersonAttrib(639, "耍刀技巧", 15)
        QZXS("赵敏耍刀技巧增加15.")               
		addthing(142)
		instruct_37(-1)
	end			
	if WarMain(356) then
		AddPersonAttrib(639, "拳掌功夫", 15)
        QZXS("赵敏拳掌功夫增加15.")	
		addthing(89)
		instruct_37(-1)
	end			
	if WarMain(150) then
		AddPersonAttrib(639, "御剑能力", 15)
        QZXS("赵敏御剑能力增加15.")	
		addthing(120)	
	    instruct_37(-1)
	end			
	daode(-4)
	say("（看来此人和六大派并无瓜葛）好了，送他们上路。", 639)
	dark()
	null(-2, 4)
	null(-2, 11)
	null(-2, 12)
	null(-2, 14)
	null(-2, 13)
	null(-2, 3)
	null(-2, 15)
	null(-2, 16)
	null(-2, 17)
	light()
	say("少侠武功果然高强，六大派如今只剩下少林武当，若少侠能帮我平了这两大派，本郡主自有重赏。", 639)
	say("好，一言为定。",0)
    instruct_3(28,100,0,0,0,0,5019,0,0,0,0,39,43);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [10]
	instruct_3(28,101,0,0,0,0,5019,0,0,0,0,39,40);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [10]
	instruct_3(28,102,0,0,0,0,5019,0,0,0,0,39,37);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [10]
	if (JY.Person[0]["御剑能力"] + JY.Person[0]["耍刀技巧"]) >= 600 and (JY.Person[zj()]["资质"] >= 80 or JY.Person[0]["内力最大值"] >= 8192) and GetS(113, 0, 0, 0) == 0 then
	say("下一场是少林啊...那可绝对是场硬战", 0)
	say("我现在的武功还是尚嫌不足，得想个法子才行", 0)
	say("(目光瞥到适才拿到的数本秘笈)对啊...我来找找灵感", 0)
	say("方才打斗时我就有好奇，这两仪剑和反两仪刀，看似大相径庭，事实上却是暗合两仪流转、阴阳相生之道", 0)
	say("但这依然不够...等等，这两仪之道...不就跟南贤那老头藏在书房里的阵图是同一回事嘛！我懂了，我懂了！", 0)
	instruct_0();
	setLW1(60)
	QZXS("领悟两仪微尘阵！")
	say("哈哈哈哈哈，还真是水到渠成呀！",0)
	instruct_0();
	end
end

OEVENTLUA[5019] = function()
if hasthing(147) and hasthing(151) then 
dark()
instruct_19(36,38)
    instruct_3(-2,100,0,0,0,0,0,0,0,0,0,39,43);   --  3(3):修改事件定义:场景[少林]:场景事件编号 
	instruct_3(-2,101,0,0,0,0,0,0,0,0,0,39,40);   --  3(3):修改事件定义:场景[少林]:场景事件编号 
	instruct_3(-2,102,0,0,0,0,0,0,0,0,0,39,37);   --  3(3):修改事件定义:场景[少林]:场景事件编号 
	instruct_3(-2,12,0,0,0,0,0,-2,-2,-2,-2,33,38);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
    instruct_3(-2,103,0,0,0,0,0,5420,5420,5420,-2,32,38);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,104,0,0,0,0,0,5420,5420,5420,-2,32,37);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,105,0,0,0,0,0,5420,5420,5420,-2,32,36);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,106,0,0,0,0,0,5420,5420,5420,-2,32,35);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,107,0,0,0,0,0,5420,5420,5420,-2,32,39);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,108,0,0,0,0,0,5420,5420,5420,-2,32,40);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,109,0,0,0,0,0,5420,5420,5420,-2,32,41);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(93,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(93,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
light()
say("施主来我少林，不知有何见教？",70)
say("在下前来领教少林绝学。",0)
say("我见施主满身杀气，怕是来者不善。",70)
say("那又如何?",0)
say("施主，我佛慈悲，望施主放下屠刀立地成佛。",70)
say("可惜在下不信佛。",0)
say("阿弥陀佛。",70)
say("老和尚，你也不用费口舌了，六大派只剩下少林和武当，带我灭了你少林，下一个便是武当。",0)
say("阿弥陀佛。",70)
say("不说话，那我便不客气了。",0)
dark()
    instruct_3(-2,14,0,0,0,0,0,-2,-2,-2,-2,33,36);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [12]
light()
say("阿弥陀佛。",114)
say("！！（这老和尚来时竟无半点动静！）老和尚你又是谁？。",0)
say("小僧只是一扫地僧。",114)
say("少林果然卧虎藏龙，一个扫地僧居然有如此能耐。",0)
say(".....",70)
say("小僧不愿多生事端，奈何少林已至生死存亡的地步。",114)
    if WarMain(80) == false then
	   instruct_15()
	   do return; end
	end
	instruct_37(-5)
	addHZ(114)
	addthing(168)
	addthing(171)
	addthing(69)
	addthing(273)
	addthing(85)
	addthing(92)
	addthing(276)
	instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
    instruct_3(-2,103,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,104,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,105,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,106,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,107,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,108,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,109,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	light()
say("大师可有遗言交代？",0)
say("咳咳...只望施主不要再造杀孽。",114)
say(".....",0)
say("嗯？什么人？",0) 
dark() 
  instruct_3(-2,109,0,0,0,0,0,4643*2,4643*2,4643*2,-2,33,35);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
light()
say("大哥，跟我走。",455) 
dark() 
  instruct_3(-2,109,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
  instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
light()
say("该死，哪来这么多高手。",0) 
say("本郡主到时小瞧了这少林寺，居然还有如此多的高手。",639) 
say("以防万一，来人，放火给我烧了这少林寺。",639) 
dark() 
instruct_3(-2,109,0,0,0,0,0,3550*2,3550*2,3550*2,-2,33,38);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
light()
say("阿弥陀佛。",615)
say(".......",0) 
say(".......",639)
say("施主，打那来回哪去吧。",615)
say("！！！",0) 
	CC.DYRW = 0
	CC.DYRW2 = 615
	if WarMain(341) then 
	   rewardRW(7)
	   addthing(256) addthing(257) addthing(258) 
	end
instruct_3(-2,109,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
light()
say("这和尚好生厉害。",0)	
say("少林已经覆灭，他一个人翻不起大浪，先撤，上武当。",639)	
say("好。",0)
instruct_3(43,40,0,0,0,0,5020,0,0,0,0,26,28);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(43,41,0,0,0,0,5020,0,0,0,0,26,29);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
end
end

OEVENTLUA[5020] = function() --上武当
dark()
instruct_19(22,28)
instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(-2,42,0,0,0,0,0,4641*2,4641*2,4641*2,-2,16,28);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(-2,43,0,0,0,0,0,3192*2,3192*2,3192*2,-2,16,29);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
--instruct_3(43,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
light()
say("在下见过张真人，哦？大师也在，还有这位。（糟糕，几个高手在一起，此次怕是凶多吉少。）",0)
say("阿弥陀佛。",114)
say("....",455)
say("小友来意，老道已从兄弟这知晓。",5)
say("不过老道还是不明，小友武艺高强，为何替那鞑子屠戮中原？",5)
say("在下所谋不过天书而已，刚好朝廷有一本。",0)
say("小友何不走正道取得那天书？",5)
say("张真人可是想要劝说在下弃暗投明？",0)
say("唉，看小友神态怕是老道说不动小友了。",5)
say("张真人放心，在下也并非滥杀无辜之人，不过为了天书，在下也只能得罪了",0)
say("也罢，今日我兄弟三人怕是要以大欺小了。",5)
dark()
instruct_3(-2,44,0,0,0,0,0,4641*2,4641*2,4641*2,-2,16,30);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
light()
say("哈哈哈……如此大战岂能少得了我。",592)
say("今日我兄弟四人齐聚，又有如此大战，人生无憾。",592)
say("...........",0)
SetS(11,60,15,0,2)
setJX(5)
setJX(114)
setJX(455)
setJX(592)
if GetS(86,10,20,5) == 1 then 
   SetS(86,10,20,5,2)
end
	if instruct_6(255) ==true then    --光明圣火阵
      rewardRW(7)
	end
if GetS(86,10,20,5) == 2 then 
   SetS(86,10,20,5,1)
end
say("咳..咳...",0)
say("小友你败了。",5)
say("...",0)
say("唉，你走吧，望小友能够迷途知返。",5)
say("...谢张真人。",0)
say("如此我兄弟四人又要分道扬镳了。",592)
say("阿弥陀佛，君宝，有缘再见。",114)
dark()
instruct_3(-2,42,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(-2,43,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(-2,44,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(-2,4,1,0,5021,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
		for i = 7, 10 do
			addevent(106, i, 0, 5022, 3)
		end
light()
end

OEVENTLUA[5021] = function() --上武当
if JY.Person[0]["品德"] < 50 then 
say("望小友迷途知返。",5)
else 
say("小友能迷途知返，老道甚是欣慰。",5)
end
end

OEVENTLUA[5022] = function() --绿柳山庄
dark()
	for i = 7, 10 do
		null(-2, i)
	end	
	addevent(-2, 1, 0, 0, 0, 4595*2)
	instruct_21(639)
light()
say("在下未能完成任务，还请郡主责罚。",0)
say("少侠无需介怀，是本郡主失策了。",639)
say("谢郡主（看来天书只能想起他办法了）。",0)
say("好了，你下去休息吧。",639)
say("是。",0)
dark()
instruct_19(32,22)
instruct_3(-2,2,1,0,5023,0,0,-2,-2,-2,-2,13,21);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
null(-2, 1)
light()
say("郡主，汝阳王命郡主立刻回去。",643)
say("我爹？这是为何？",639)
say("郡主此次围剿六大派失利，陛下雷霆大怒，汝阳王收回了郡主的兵权。",643)
say("哼，我不会回去,这次不过是出现了些意外而已。",639)
say("郡主，汝阳王说绑也要绑回去。",643)
say("...........",639)
say("我知道了，待会我就回去。",639)
say("（嗯？好机会，我现在正好可以趁机去调查一番，如果天书当真在这，我也不用再费周折）",0)
end

OEVENTLUA[5023] = function() --绿柳山庄
say("嗯？这是？找到了！不对，假的？上当了！",0)
dark()
instruct_3(-2,1,0,0,0,0,0,4595*2,4595*2,4595*2,-2,12,22);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_40(2)
light()
say("你在做什么！？",639)
say("（糟糕，被发现了）！",0)
say("《倚天屠龙记》？原来少侠是为了此书而来。",639)
say("既然被郡主发现了，在下也不隐瞒了，在下确是为了此书而来，不想竟然是本假书。",0)
say("这本书是成师傅送给本郡主的，早在很早之前，本郡主就命人探查过，得知此乃假的。",639)
say("郡主可是发现成昆的异心了？",0)
say("本郡主从未信任过他。（嗯？何不用他....）",639)
say("（这眼神怎么怪怪的？）喂喂！！你要干嘛？",0)
say("救命啊！！！！",639)
say("...........",0)
dark()
instruct_3(-2,5,0,0,0,0,0,4632*2,4632*2,4632*2,-2,12,24);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
instruct_3(-2,6,0,0,0,0,0,4636*2,4636*2,4636*2,-2,13,24);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
light()
say("小子，赶快放开郡主！",643)
say("...........（喂，你到底要干嘛？）",0)
say("（怎么关键时候这么笨？快带本郡主离开这里。）",639)
say("...........",0)
say("好小子，不说话，你这是找死！",643)
	if WarMain(362) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end	
say("好厉害的臭小子，郡主，等我兄弟俩去搬救兵！",643)
dark()
instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,12,24);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,13,24);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
light()
say("快走吧，再不走来不及了。",639)
say("去哪？",0)
say("去找成昆，你不是在找天书嘛。",639)
say("好！",0)
teammate(639)
dark()
instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
instruct_3(-2,2,1,0,0,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
instruct_3(9,10,0,0,0,0,5024,0,0,0,0,28,25);   --  3(3):修改事件定义:场景[成昆]:场景事件编号 [12]
addevent(9, 2, 0, 0, 0, 2648*2)
light()
end

OEVENTLUA[5024] = function() --成昆
dark()
instruct_3(9,10,0,0,0,0,0,0,0,0,0,28,25);   --  3(3):修改事件定义:场景[成昆]:场景事件编号 [12]
light()
	say("我还以为是谁，原来是少侠你啊。", 18)
	say("成昆，你居然用假天书骗我？")
	say("哼哼，让你小子发现了。", 18)
	say("告诉我真天书在哪！")
	say("哼，告诉你又何妨，天书在我那徒弟谢逊那里。", 18)
	say("当真是好算计。")
	say("不过小子你既然来了，那就留下吧。", 18)
		if WarMain(361) == false then
			instruct_15(0);   
			instruct_0();  
			do return; end			
		end
	say("该死的小子，居然栽在你的手里。", 18)	
	say("受死吧。")
dark()
null(-2,2)
addevent(72, 1, 0, 5025, 3)
addevent(72, 0, 0, 5025, 3)
JY.Scene[72]["进入条件"] = 0
light()
    say("（听闻谢逊好像是在冰火岛，看来必须要去一趟了）")
end

OEVENTLUA[5025] = function() --冰火岛
dark()
null(-2,0)
null(-2,1)
null(-2,4)
addevent(72, 8, 0, 0, 0,3987*2)
light()
    say("谁？？",13)
	say("谢狮王，在下前来索要《倚天屠龙记》这本书。")
	say("不管你是谁，给我去死。",13)
		if WarMain(261) == false then
			instruct_15(0);   
			instruct_0();  
			do return; end			
		end
	null(-2,8)	
	light()	
	addthing(43)
	addthing(155)
	say("何必非要动手。")
	if inteam(639) and hasthing(37) and hasthing(43) then 
	say("喂，你说倚天剑和屠龙刀哪个更锋利？",639)
	say("这我哪知道。")
	say("笨呢，这不是现成的嘛，咱们试试？",639)
	say("好，我拿刀你拿剑，小心点哦，别砍到我。")
	say("本郡主比某人聪明多了。",639)
	say("来吧。")
	bgtalk("只听“咣”的一声，倚天剑和屠龙刀同时从中而断。")
	say(".................")
	say("咦？里面有东西！",639)
	say("什么东西？我看看！《九阴真经》《降龙十八掌》《武穆遗书》")
	say("原来这就是倚天剑和屠龙刀的秘密啊。",639)
	say("想不到里面藏的是神功秘籍和武穆遗书。")
	say("走啦走啦，这洞里阴森森的。",639)
	say("哦哦，这就走。")
	addthing(84)
	addthing(86)
	addthing(37,-1)
	addthing(43,-1)
	end
end

OEVENTLUA[256] = function() --朱府选择
instruct_37(1)
    say("张兄弟，这朱长龄父女不是*好人，他们根本不认识你父*亲，他们骗你，目的就是为*了屠龙刀。")
	say("啊？你是谁？为*什么这么说？姐姐她…*…",9)
	dark()
	null(-2,18)
	null(-2,11)
	null(-2,10)
	addevent(-2, 8, 0, 0, 0,5752)
	addevent(-2, 9, 0, 0, 0,7026)
	light()
	say("无忌，不要听他胡说八道。*你到底是什么人？挑拨我们*之间的关系！",165)
	say("哼，不知道是谁在胡说八道*！你们刚才在那间屋子里说*的话，我全都听见了！")
	say("好小子，留你不得！",165)
	say("啊？难道这是真的？你们…*…",9)
	say("张兄弟，你快跑！！")
	say("快追！",165)
	dark()
	null(-2,3)
	null(-2,8)
	null(-2,9)
	addevent(-2, 5, 0, 0, 0,5752)
	addevent(-2, 6, 0, 0, 0,7026)
	addevent(-2, 7, 0, 0, 0,5284)
	instruct_19(44,19)
	instruct_40(0)
	instruct_25(44,17,44,17)
	light()
	say("无忌，我们一直待你很好，*你姐姐也很喜欢你，快过来*，那边危险……",165)
	say("好弟弟，快过来，姐姐疼你*。",81)
	say("你、你，你骗我？不，不…*…啊……",9)
	say("悬崖！危险！")
	dark()
	null(-2,7)
	light()
	if yesno("要跳下去吗？") then
	say("不行，我得下去救他！")
	instruct_37(2)
	dark()
	JY.Scene[4]["进入条件"] = 0
    My_Enter_SubScene(4,20,15,2)
	null(-2,5) --清除朱九真
	null(-2,6) --清除朱九真她爹
	instruct_3(4,4,1,0,5026,0,0,5284,5284,5284,-2,26,14);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [4]
	null(68,7) --昆仑何太冲
	addevent(4, 1, 1, 5013, 1)
    light()
	instruct_27(-1,3013*2,3018*2) 
	 do return; end
	end
	say("我苦心经营这么久，居然被*你小子破坏了，拿命来。",165)
	say("哼，你这种人渣！")
	if instruct_6(145,4,0,0) == false then 
	   instruct_15(0)
	   do return; end
	end
	null(-2,5)
	null(-2,6)
	addevent(68, 3, 1, 257, 1, 5412)
	addevent(68, 13, 1, 257, 1, 5412)
	addevent(11, 106, 0, 259, 3)
	addevent(11, 107, 0, 259, 3)
	light()
	say("唉，无忌从这悬崖上摔下去*，凶多吉少啊。我去找找吧*。好像崑仑派就在这附近，*不妨去打听打听。")
end

OEVENTLUA[5026] = function() --昆仑仙境
    say("无忌你没事吧？")
	say("大哥，你怎么也下来了？",9)
	say("我下来救你的。")
	dark()
	instruct_3(-2,0,1,0,0,0,0,4702*2,4702*2,4702*2,-2,28,13);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	light()
	say("嗷！！！！！", 613)
    say("什么东西？！！！！！", 0)
			if WarMain(321) == false then
				instruct_15()
				return
			end	
	say("畜生受死！", 0)		
	say("大哥，不要！",9)
	say("无忌你干什么？", 0)
	say("大哥，你看它身上有伤，我给它治疗一下。",9)
	say(".......", 0)
	say("无忌，你真是太善良了。", 0)
	dark()
	instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	light()
	say("大哥，好了。",9)
	say("无忌，你手上什么东西？", 0)
	say("这个啊，是在它身体里拿出来的，好像是一个包裹。",9)
	say("看看是什么东西。", 0)
	say("几本书？",9)
	say("！！《九阳真经》！！", 0)
	say("大哥，这有什么问题吗？",9)
	say("无忌真是好福气，能得到如此神功。", 0)
	say("大哥，送给你吧。",9)
	say("这。。。。", 0)
	say("大哥真心待我，无忌无以为报。",9)
	say("无忌，那我就收下了，不过无忌，你也要练一练，江湖是非多。", 0)
	say("好的大哥，我看这里很安静，我想在这里待一段时间。",9)
	say("嗯，有时间我就来看你。", 0)
	addthing(83)
	instruct_3(-2,4,1,0,5027,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [4]
	for i = 5,10 do 
	   addevent(43, i, 0, 5028, 3)
	end
end

OEVENTLUA[5027] = function() --昆仑仙境
    say("要好好练功，我过段时间来看你。", 0)
    say("好的，大哥。",9)
end

OEVENTLUA[5028] = function() --昆仑仙境
dark()
	for i = 5,10 do 
	   null(-2,i)
	end
light()
    say("晚辈见过张真人。", 0)
    say("小友客气了，不知小友前来所为何事？",5)
	say("事情是这样，晚辈机缘巧合之下遇到了张真人的徒孙张无忌。", 0)
	say("小友说的可是实话？",5)
	say("晚辈绝无半点虚言。", 0)
	say("苍天有眼，我那可怜的无忌孩儿还活着。",5)
	say("（不愧是一代宗师，好强的气势）", 0)
	say("快和我说说无忌现在怎么样了。",5)
	bgtalk("一番叙述之后..........")
	say("不想无忌竟有如此机遇，《九阳真经》是当年觉远大师所学武功，至阳至刚，对阴寒内伤有奇效。",5)
	say("张真人可派人将无忌接回来。", 0)
	say("唉，此事怕是要有劳小友了。",5)
	say("这是为何？", 0)
	say("门中弟子要去汇合其他五大派围攻光明顶了，还请少侠与远桥一起接回无忌。",5)
	say("张真人客气了，晚辈独自前往更快一点，到时候去光明顶与宋大侠汇合。", 0)
	say("有劳小友了。",5)
	for i = 2,10 do 
	   null(33,i)
	end
	null(34,0)
	instruct_3(4,0,0,0,0,0,5029,0,0,0,-2,15,30);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	instruct_3(4,4,0,0,0,0,5029,0,0,0,-2,16,30);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	--instruct_3(4,4,1,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [4]
end

OEVENTLUA[5029] = function() --昆仑仙境
    instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	instruct_3(-2,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
    instruct_30(15,30,15,20);   --  30(1E):主角走动27-49--27-34
	say("无忌～，我来看你了。", 0)
	say("奇怪人呢？", 0)
	say("此处极其隐蔽，正常应该不会被人发现，莫非自己离开了？", 0)
	say("还是先去光明顶汇合，通知宋大侠，也方便寻找无忌。", 0)
	instruct_17(11,1,29,47,0) --  3(3):修改事件定义:场景[明教]:大门开关
	--------------------------------------------------------
	instruct_17(11,1,28,46,2050) --  3(3):修改事件定义:场景[明教]
	instruct_17(11,1,30,46,2054) --  3(3):修改事件定义:场景[明教]
	instruct_17(11,1,30,47,2052) --  3(3):修改事件定义:场景[明教]
	instruct_17(11,1,28,47,2048) --  3(3):修改事件定义:场景[明教]
	addevent(11, 65, 0, 0, 0,5430)
	addevent(11, 66, 0, 0, 0,5436)
	addevent(11, 67, 0, 0, 0,5432)
	addevent(11, 68, 0, 0, 0,5440)
	addevent(11, 69, 0, 0, 0,5444)
	addevent(11, 70, 0, 0, 0,5432)
	addevent(11, 3, 0, 0, 0,5452)
	addevent(11, 6, 0, 0, 0,5334)
	addevent(11, 7, 0, 0, 0,5348)
	addevent(11, 8, 0, 0, 0,5364)
	addevent(11, 9, 0, 0, 0,5378)
	addevent(11, 10, 0, 0, 0,5362)
	for i = 11,18 do 
	addevent(11, i, 0, 0, 0,5412)
	end
	addevent(11, 19, 0, 0, 0,5434)
	for i = 20,27 do 
	addevent(11, i, 0, 0, 0,5404)
	end
	addevent(11, 28, 0, 0, 0,5428)
	for i = 29,35 do 
	addevent(11, i, 0, 0, 0,5182)
	end
	for i = 36,46 do 
	addevent(11, i, 0, 0, 0,5426)
	end
	addevent(11, 37, 0, 0, 0,5426)
	addevent(11, 47, 0, 0, 0,5444)
	for i = 48,56 do 
	addevent(11, i, 0, 0, 0,5402)
	end
	addevent(11, 57, 0, 0, 0,5436)
	for i = 58,64 do 
	addevent(11, i, 0, 0, 0,5392)
	end
	addevent(11, 77, 0, 0, 0,5302)
	addevent(11, 78, 0, 0, 0,5302)
	addevent(11, 79, 0, 0, 0,5308)
	addevent(11, 80, 0, 0, 0,5310)
	addevent(11, 82, 0, 0, 0,5312)
	addevent(11, 81, 0, 0, 0,5302)
	addevent(11, 83, 0, 0, 0,5310)
	addevent(11, 84, 0, 0, 0,5314)
	-------------------------------------
	null(11,103)
	null(11,102)
	null(11,90)
	null(11,94)
	null(11,100)
	addevent(11, 105, 1, 0, 0)
	addevent(11, 0, 0, 5030, 3)
end

OEVENTLUA[5030] = function() --光明顶
dark()
null(-2,0)
light()
instruct_30(29,48,29,38)
say("见过各位掌门。")
say("少侠你来啦，不知无忌在何处？",171)
say("晚辈去的时候，无忌已不再那里，想来是先行离开了。")
say("待当下事情处理完，我等便一同寻找无忌。",171)
say("魔教已然一败涂地，再不投*降，还待怎的？空闻大师，*咱们这便去毁了魔教三十三*代教主的牌位吧！",8)
say("什么投不投降？*魔教之众，*今日不能留下任何活口。*除恶务尽，*否则他日死灰复燃，*又将为害江湖。*魔崽子们！*识时务的快快自我了断，*省得大爷们动手。",7)
say("华山派和崆峒派各位，*请将顶上的魔教余孽一概诛*灭了。*武当派从西往东搜索，峨嵋*派从东往西搜索，别让魔教*有一人漏网。*崑仑派预备火种，焚烧魔教*巢穴。**少林弟子各取法器，诵念往*生经文，替六派殉难英雄，*魔教教众超渡，化除冤孽。",169)
dark()
instruct_3(-2,109,0,0,0,0,0,5284,5284,5284,-2,28,32);
light()
say("大家都别打了，因为*这中间着实有许多误会，*让我好好说给你们听。",9)
say("（那不是无忌么，怎么跑到明教去了？）")
say("你是何人？*还请速速离去，*以免受池鱼之殃。",169)
say("都是成崑那奸贼所计划的，大家都罢手吧。",9)
say("现在年轻人都这麽狂妄吗？*你自以为是武林盟主吗！*要我们听你说。",6)
say("你这小贼，跟魔教勾结，*想要拖延时间，好施什么诡*计么？先杀了你再说。",8)
dark()
light()
bgtalk("一番战斗之后........")
say("现在就看武当派的了。",6)
say("这个……。",171)
say("宋大侠，他就是无忌。")
say("什么！当真？",171)
say("千真万确，只是不清楚无忌为何会出现在明教。")
say("大师伯，别打了。",9)
say("你，你，你真是无忌！你是我*五弟的儿子张无忌！",171)
say("大师伯，是我，太师父他老*人家还好吧？",9)
say("好，好，孩子，你身上的寒*毒好了吗？",171)
say("谢谢大师伯挂怀，我想已经*好了吧。大师伯，六大派和*明教，这其中确有不少误会*，你们不要再打了",9)
say("什么误会？",171)
say("事情的经过是这样的。。。*如此如此。。。。。。。。*这般这般。。。。。。。。*总之，一切的阴谋，*都是成崑那奸贼所计划的。**所以我说呢，你们两方还是*握手言和吧，反正明教杀过*六大派的人，六大派也杀过*明教的人，大家半斤八两，*差不了多少，就都罢手吧。",9)
say("话都是你在说的，*是不是真的，*我们怎麽知道。",8)
say("武当派既认亲，看来这次六*大派围攻光明顶是一败涂地*了，我们走！",6)
say("阿弥陀佛。",169)
say("哼！技不如人，*说这麽多做什麽，*走吧！",7)
dark()
for i = 3,70 do 
null(-2,i)
end
for i = 77,100 do 
null(-2,i)
end
light()
say("无忌，今日*你们救了明教，今后要多所*规劝引导，总要使明教改邪*归正，少做坏事。*少侠我们走吧。",171)
say("为了防止一些宵小之辈，我准备带领明教一起转移到安全的地方",9)
say("那么无忌，保重。")
dark()
null(-2,113)
null(-2,114)
null(-2,109)
light()
instruct_3(109,20,0,0,0,0,5031,0,0,0,-2,42,32);
instruct_3(109,21,0,0,0,0,5031,0,0,0,-2,42,31);
end

OEVENTLUA[5031] = function() --小树林
dark()
null(-2,20)
null(-2,21)
instruct_19(42,31);
light()
instruct_30(42,31,32,31)
say("少侠，今夜就在此露宿一宿吧。",171)
say("好，嗯？什么味？")
say("糟糕！中毒了，全身提不起劲。",171)
say("（九阳神功百毒不侵果然奇效）什么人！！")
say("少侠小心！",171)
dark()
addevent(-2, 5, 0, 0, 0,3390*2)
addevent(-2, 6, 0, 0, 0,3388*2)
addevent(-2, 7, 0, 0, 0,3389*2)
addevent(-2, 8, 0, 0, 0,3387*2)
light()
	if WarMain(362) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
null(-2,5)	
null(-2,6)	
null(-2,7)	
null(-2,8)	
light()
say("宋大侠，我来给你们解毒.")
say("这些是什么人？",171)
say("刚离开明教就遭到袭击，而且明教有无忌在，不太可能是明教干的。")
say("其他各派也有可能遇到同样的事，先回去再说,这本剑法与轻功，少侠拿去参悟吧。",171)
say("多谢宋大侠。")
addthing(271)
addthing(238)
for i = 5,10 do 
addevent(43, i, 0, 5032, 3)
end
end

OEVENTLUA[5032] = function() --武当
for i = 5,10 do 
null(-2,i)
end
	if MPPD(0) == 4 then
		say("师傅。",171)
		say("远桥回来啦，找到无忌了么？",5)
		say("回禀师傅，找到无忌了。",171)
		bgtalk("一番叙述之后........")
		say("无忌没事就好。",5)
		say("对了师傅，在回来的路途中，我们遭到了不明人士的袭击，若非师弟相救，徒儿等人怕是见不到师傅了。",171)
		say("哈哈哈，好好好，都平安就好。",5)
		bgtalk("明教教主到～")
		dark()
			instruct_19(16,28);   --  19(13):主角移动至2D-12
			instruct_40(1);   --  40(28):改变主角站立方向1
		instruct_17(-2,1,19,28,4669*2)
		instruct_17(-2,1,20,27,4633*2)
		instruct_17(-2,1,20,29,4637*2)
		instruct_17(-2,1,21,27,3389*2)
		instruct_17(-2,1,21,28,3389*2)
		instruct_17(-2,1,21,29,3389*2)
		light()
		say("明教教主张无忌拜见张真人。",639)
		say("哦？张教主和老道那无忌孩儿同名？。",5)
		say("张真人不要信她的话，此人并非明教教主。",0)
		say("阁下又是何人？",639)
		say("明教众人我亲眼见过，而且现下明教教主乃是张真人的徒孙，你假冒明教有何居心。",0)
		say("哼，既如此我也不拐弯抹角了。",639)
		say("本郡主想邀请张真人投靠我朝廷。",639)
		say("想来路途中袭击老道徒儿的就是姑娘吧。",5)
		say("不错，如今六大派高手皆以被擒，张真人和不考虑考虑。",639)
		say("老道平生所愿便是驱逐鞑子，姑娘怕是白费心机了。",5)
		say("敬酒不吃吃罚酒，阿三，去陪张真人玩玩。",639)
		say("张真人，请。",640)
		say("区区杂兵何须师父动手，让我来。",0)
		say("徒儿...你...",5)
		say("师父放心，他们我还不放在眼里。",0)
		say("...也罢，那老道先传你我最近所悟，再为你押阵。",5)
		say("谢师父。",0)
		JoinMP(0,4,4)
		instruct_35(0,2,16,999)
		instruct_35(0,3,46,999)
		instruct_35(0,2,16,999)
		instruct_35(0,3,46,999)
		instruct_35(0,4,99,999)
		instruct_35(0,5,182,0)
		if GetS(114,0,0,0) == 0 and JY.Person[0]["品德"] >= 90 then
			say("呵呵，徒儿的悟性依然不让老道失望。",5)
			say("轻身功夫也练的不错，师父再传些心得予你，如何？",5)
			instruct_0();
			if instruct_11(0,188) == true then 
				QZXS("领悟梯云纵精要！")
				say("师父真乃神人也！",0)
				instruct_0();
				setLW2(115)
			else
				say("多谢师父好意，但徒儿恐贪多嚼不烂。",0) 
			end	
		end
		if GetS(111,0,0,0) == 0 then 
			if yesno("要领悟纯阳无极么？") then
				SetS(111,0,0,0,99)
			end
		end
		Cls()
			say("阿三，上!",639)
			if WarMain(351) == false then
				instruct_15(0);   
				instruct_0();  
				do return; end			
			end		
			instruct_37(1)
			light()
			say("阿二，你上。", 639)
			say("是！", 641)	
			if WarMain(352) == false then
				instruct_15(0);   
				instruct_0();  
				do return; end			
			end		
			instruct_37(1)
			light()	
			say("阿大，你去试一试少侠的剑法。", 639)
			say("是！", 642)	
			if WarMain(353) == false then
				instruct_15(0);   
				instruct_0();  
				do return; end			
			end		
			instruct_37(1)
			light()
			say("佐佐木师傅，有劳你了。", 639)
			say("嗨！", 517)
			say("东瀛人？",0)
			SetS(106, 63, 1, 0, 0)
			SetS(106, 63, 2, 0, 517)
			if WarMain(288) == false then
				instruct_0();
				light()
				say("呜......",0)
				say("徒儿退下！",5)
				say("嗯！？", 517)
				say("阁下好功夫，老道张三丰，请招！",5)
				SetS(106, 63, 1, 0, 5)
				SetS(106, 63, 2, 0, 517)
				if WarMain(288) == false then
					instruct_15(0);   
					instruct_0();  
					do return; end
				end	
				say("张真人果然武功惊世骇俗，我们走。", 639)
				say("老道不送！",5)
				dark()
				instruct_17(-2,1,19,28,0)
				instruct_17(-2,1,20,27,0)
				instruct_17(-2,1,20,29,0)
				instruct_17(-2,1,21,27,0)
				instruct_17(-2,1,21,28,0)
				instruct_17(-2,1,21,29,0)
				light()
				say("师父抱歉...",0)
				say("无事，老道也是没想到那位郡主竟能找到东瀛人助拳...",5)
				say("总之，徒儿莫太在意此事了，胜败乃兵家常事",5)
				say("多谢师父。",0)
				say("但如今五大派高手被擒、下落不明，徒儿却还需下山打探",0)
				say("好吧，徒儿务必小心。",5)
				addevent(106, 0, 0, 5033, 3)
				do return; end
			end
			instruct_37(1)
			light()
			addHZ(63)
			say("少侠当真武功了得，我们走。", 639)
			say("想来就来想走就走，给我留下。",0)
			say("玄冥二老，挡下他们！", 639)
			if WarMain(362) == false then
				instruct_15(0);   
				instruct_0();  
				do return; end			
			end	
		instruct_17(-2,1,19,28,0)
		instruct_17(-2,1,20,27,0)
		instruct_17(-2,1,20,29,0)
		instruct_17(-2,1,21,27,0)
		instruct_17(-2,1,21,28,0)
		instruct_17(-2,1,21,29,0)
			light()
		say("又是这两个家伙，果然是她派人袭击我们，可惜让他们跑了。",0)
		say("咦！！这两个家伙掉了东西，看看是什么。",0)
		addthing(91)
		say("玄..冥..神..掌..！",0)
		say("玄冥神掌是百损道人所创的武学。",5)
		say("这种阴毒的武功我毁了他。",0)
		say("徒儿且慢，武功不分好坏，只是在于使用之人。",5)
		say("我明白师父的意思了，武功是用来锄强扶弱的！",0)
			if GetS(113,0,0,0) == 0 then 
				say("瞧瞧这武功。",0) 
				instruct_0();
				if instruct_11(0,188) == true then 
					QZXS("领悟玄冥神掌精要！")
					say("玄冥神掌果然厉害",0)
					instruct_0();
					setLW1(21)
				else
					say("还是算了",0) 
				end	
			end
		say("五大派高手被擒，还需想办法搭救才行。",5)
		say("不知道他们被关押在哪里，我这就去打探一下消息。",0)
		say("徒儿有劳了。",5)
		addthing(343)	
			if GetS(111,0,0,0) == 0 and JY.Person[0]["品德"] >= 90 then
				say("此行凶险，徒儿再看老道演练一遍如何？",5) 
				say("师父，请！",0) 
				if WarMain(379) == false then
					instruct_13()  --场景变亮
					say("徒儿还需努力",5) 
				else
					say("徒儿天资聪颖，老道以你为傲阿",5) 
					say("多谢师父传功",0) 
					QZXS("领悟太极神功！")
					instruct_0();
					SetS(111, 0, 0, 0,182)
				end
			end
	else
		say("师傅。",171)
		say("远桥回来啦，找到无忌了么？",5)
		say("回禀师傅，找到无忌了。",171)
		bgtalk("一番叙述之后........")
		say("无忌没事就好。",5)
		say("对了师傅，在回来的路途中，我们遭到了不明人士的袭击，若非少侠相救，徒儿等人怕是见不到师傅了。",171)
		say("小友，老道感激不尽。",5)
		bgtalk("明教教主到～")
		dark()
			instruct_19(16,28);   --  19(13):主角移动至2D-12
			instruct_40(1);   --  40(28):改变主角站立方向1
		instruct_17(-2,1,19,28,4669*2)
		instruct_17(-2,1,20,27,4633*2)
		instruct_17(-2,1,20,29,4637*2)
		instruct_17(-2,1,21,27,3389*2)
		instruct_17(-2,1,21,28,3389*2)
		instruct_17(-2,1,21,29,3389*2)
		light()
		say("明教教主张无忌拜见张真人。",639)
		say("哦？张教主和老道那无忌孩儿同名？。",5)
		say("张真人不要信她的话，此人并非明教教主。",0)
		say("阁下又是何人？",639)
		say("明教众人我亲眼见过，而且现下明教教主乃是张真人的徒孙，你假冒明教有何居心。",0)
		say("哼，既如此我也不拐弯抹角了。",639)
		say("本郡主想邀请张真人投靠我朝廷。",639)
		say("想来路途中袭击老道徒儿的就是姑娘吧。",5)
		say("不错，如今六大派高手皆以被擒，张真人和不考虑考虑。",639)
		say("老道平生所愿便是驱逐鞑子，姑娘怕是白费心机了。",5)
		say("敬酒不吃吃罚酒，阿三，去陪张真人玩玩。",639)
		say("张真人，请。",640)
		say("区区杂兵何须张真人动手，让我来。",0)
		say("小友...你...",5)
		say("张真人请放心。",0)
		say("如此，小友我便教你几招老道最近所悟武学。",5)
		if GetS(114,0,0,0) == 0 and JY.Person[0]["品德"] >= 90 then
			say("小友轻身功夫不错，老道有些心得可予小友分享，如何？",5)
			instruct_0();
			if instruct_11(0,188) == true then 
				QZXS("领悟梯云纵精要！")
				say("张真人真乃神人也！",0)
				instruct_0();
				setLW2(115)
			else
				say("多谢真人好意，但小子不敢垂涎。",0) 
			end	
		end
		if GetS(111,0,0,0) == 0 then 
			if yesno("要领悟纯阳无极么？") then
				SetS(111,0,0,0,99)
			end
		end
			if WarMain(351) == false then
				instruct_15(0);   
				instruct_0();  
				do return; end			
			end		
			instruct_37(1)
			light()
			say("阿二，你上。", 639)
			say("是！", 641)	
			if WarMain(352) == false then
				instruct_15(0);   
				instruct_0();  
				do return; end			
			end		
			instruct_37(1)
			light()	
			say("阿大，你去试一试少侠的剑法。", 639)
			say("是！", 642)	
			if WarMain(353) == false then
				instruct_15(0);   
				instruct_0();  
				do return; end			
			end		
			instruct_37(1)
			light()
			say("佐佐木师傅，有劳你了。", 639)
			say("嗨！", 517)
			say("东瀛人？",0)
			SetS(106, 63, 1, 0, 0)
			SetS(106, 63, 2, 0, 517)
			if WarMain(288) == false then
				instruct_0();
				light()
				say("呜......",0)
				say("小友请先退下！",5)
				say("嗯！？", 517)
				say("阁下好功夫，老道张三丰，请招！",5)
				SetS(106, 63, 1, 0, 5)
				SetS(106, 63, 2, 0, 517)
				if WarMain(288) == false then
					instruct_15(0);   
					instruct_0();  
					do return; end
				end	
				light()
				say("张真人果然武功惊世骇俗，我们走。", 639)
				say("老道不送！",5)
				dark()
				instruct_17(-2,1,19,28,0)
				instruct_17(-2,1,20,27,0)
				instruct_17(-2,1,20,29,0)
				instruct_17(-2,1,21,27,0)
				instruct_17(-2,1,21,28,0)
				instruct_17(-2,1,21,29,0)
				light()
				say("多谢张真人搭救...",0)
				say("无事，老道也是没想到那位郡主竟能找到东瀛人助拳...",5)
				say("总之，小友莫太在意此事了，胜败乃兵家常事",5)
				say("多谢张真人。",0)
				say("但如今五大派高手被擒、下落不明，我却还需下山打探",0)
				say("好吧，小友务必小心。",5)
				addevent(106, 0, 0, 5033, 3)
				do return; end
			end
			instruct_37(1)
			light()
			addHZ(63)
		say("少侠当真武功了得，我们走。", 639)
		say("想来就来想走就走，给我留下。",0)
		say("玄冥二老。", 639)
			if WarMain(362) == false then
				instruct_15(0);   
				instruct_0();  
				do return; end			
			end	
		instruct_17(-2,1,19,28,0)
		instruct_17(-2,1,20,27,0)
		instruct_17(-2,1,20,29,0)
		instruct_17(-2,1,21,27,0)
		instruct_17(-2,1,21,28,0)
		instruct_17(-2,1,21,29,0)
			light()
		say("又是这两个家伙，果然是她派人袭击我们，可惜让他们跑了。",0)
		say("咦！！这两个家伙掉了东西，看看是什么。",0)
		addthing(91)
		say("玄..冥..神..掌..！",0)
		say("玄冥神掌是百损道人所创的武学。",5)
		say("这种阴毒的武功我毁了他。",0)
		say("小友且慢，武功不分好坏，只是在于使用之人。",5)
		say("我明白张真人的意思了，武功是用来锄强扶弱的！",0)
			if GetS(113,0,0,0) == 0 then 
				say("瞧瞧这武功。",0) 
				instruct_0();
				if instruct_11(0,188) == true then 
					QZXS("领悟玄冥神掌精要！")
					say("玄冥神掌果然厉害",0)
					instruct_0();
					setLW1(21)
				else
					say("还是算了",0) 
				end	
			end
		say("五大派高手被擒，还需想办法搭救才行。",5)
		say("不知道他们被关押在哪里，我这就去打探一下消息。",0)
		say("有劳小友了，这本轻功，小友拿去吧。",5)
		--addthing(238)
		addthing(343)	
		if GetS(111,0,0,0) == 0 and JY.Person[0]["品德"] >= 90 then
			say("此行凶险，小友再看老道演练一遍如何？",5) 
			say("张真人，请！",0) 
			if WarMain(379) == false then
				instruct_13()  --场景变亮
				say("小友还需努力",5) 
			else
				say("小友天资聪颖，真是长江后浪推前浪",5) 
				say("多谢张真人传功",0) 
				QZXS("领悟太极神功！")
				instruct_0();
				SetS(111, 0, 0, 0,182)
			end
		end
	end

addevent(106, 0, 0, 5033, 3)
end

OEVENTLUA[5033] = function() --绿柳山
	if hasthing(152) then
		dark()
		null(-2,0)
			addevent(-2, 15, 0, 0, 0, 3046*2)
			addevent(-2, 16, 0, 0, 0, 3046*2)
			addevent(-2, 17, 0, 0, 0, 3046*2)
			addevent(-2, 4, 0, 0, 0, 2685*2)
			addevent(-2, 11, 0, 0, 0, 2685*2)
			addevent(-2, 12, 0, 0, 0, 2685*2)
			addevent(-2, 13, 0, 0, 0, 2681*2)
			addevent(-2, 14, 0, 0, 0, 2709*2)
			addevent(-2, 3, 0, 0, 0, 2677*2)
			instruct_17(-2,1,28,40,4662*2)
			instruct_17(-2,1,31,38,4530*2)
		light()
			say("诸位掌门，这里的规矩你们是知道的了，如果你们能胜得了郡主，你们立刻就能走。如若败了，便斩断一根手指，囚禁一月，再问你降也不降。", 642)
			say("那么少侠请吧。", 639)
			say("（原来她命人逐一与各家掌门相斗，她在旁察看，得以偷学各门各派的精妙招数，当真好计谋）")
			say("好了，把他们押回万安寺。", 639)
		dark()
		null(-2,15)
		null(-2,16)
		null(-2,17)
		null(-2,4)
		null(-2,11)
		null(-2,12)
		null(-2,13)
		null(-2,14)
		null(-2,3)
			instruct_17(-2,1,28,40,0)
			instruct_17(-2,1,31,38,0)
		light()
		say("（原来她把人关在万安寺，得想办法就他们出来）")
		JY.Scene[8]["名称"] = "万安寺"
		instruct_17(8,1,15,28,2134*2)
		instruct_17(8,1,17,27,2682*2)
		instruct_17(8,1,17,28,2682*2)
		instruct_17(8,1,16,27,2679*2)
		instruct_17(8,1,16,28,4611*2)
		instruct_17(8,1,17,29,2706*2)
		instruct_17(8,1,17,30,2674*2)
		instruct_17(8,1,17,31,4529*2)
		addevent(8, 0, 0, 5034, 3)
		addevent(8, 1, 0, 5034, 3)
		addevent(8, 2, 1, 238, 1, 3046*2)
		addevent(8, 13, 1, 238, 1, 3046*2)
		addevent(8, 14, 1, 238, 1, 3046*2)
		addevent(8, 15, 1, 238, 1, 3046*2)
		addevent(8, 3, 1, 5035, 1, 4662*2)
	end
end

OEVENTLUA[5034] = function() --万安寺
dark()
null(-2,0)
null(-2,1)
instruct_17(-2,1,32,26,2642*2)
light()
say("谁？")
say("啊？大哥是你啊。",9)
say("无忌？你怎么在这？")
say("教中传来消息说六大派被擒，所以我就赶过来救人了。",9)
say("想不到明教消息如此灵通。")
say("是我教中左使潜伏在朝廷多年，不然我们也得不到消息。",9)
say("这万安寺戒备森严，想要救人恐非易事。")
say("各门各派的高手都中了毒，无法运功，这万安寺如此之高....",9)
say("...啊，大哥我有乾坤大挪移",9)
say("可以将六大派的人挪移下来。",9)
say("哦？这样的话由我去吸引兵力，无忌你去救人。")
say("大哥你要小心啊。",9)
say("放心吧无忌。")
dark()
instruct_17(-2,1,32,26,0)
light()
end

OEVENTLUA[5035] = function() --万安寺
say("我就知道你们会来救人。",639)
say("......")
say("给我上，这次你们休想逃掉。",639)
say("郡主不好了，有人劫囚。", 642)
say("什么！！给我放火烧塔。",639)
say("是。", 642)
say("休想得逞！")
SetS(11,60,15,0,1)
	if WarMain(362) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	instruct_37(2)
	instruct_17(-2, 1, 25, 26, 2685*2)
	instruct_17(-2, 1, 25, 27, 2685*2)
	instruct_17(-2, 1, 25, 28, 2685*2)
	instruct_17(-2, 1, 25, 29, 4612*2)
	instruct_17(-2, 1, 25, 30, 2709*2)
	instruct_17(-2, 1, 25, 31, 2677*2)
	instruct_17(-2, 1, 25, 32, 4530*2)
	instruct_17(-2, 1, 24, 28, 2642*2)
	
instruct_17(8,1,15,28,0)
instruct_17(8,1,17,27,0)
instruct_17(8,1,17,28,0)
instruct_17(8,1,16,27,0)
instruct_17(8,1,16,28,0)
instruct_17(8,1,17,29,0)
instruct_17(8,1,17,30,0)
instruct_17(8,1,17,31,0)
light()
say("大哥，人救出来了，快走。",9)
say("撤！")
say("可恶！",639)
dark()
null(-2,2)
null(-2,3)
null(-2,13)
null(-2,14)
null(-2,15)
	instruct_17(-2, 1, 25, 26, 0)
	instruct_17(-2, 1, 25, 27, 0)
	instruct_17(-2, 1, 25, 28, 0)
	instruct_17(-2, 1, 25, 29, 0)
	instruct_17(-2, 1, 25, 30, 0)
	instruct_17(-2, 1, 25, 31, 0)
	instruct_17(-2, 1, 25, 32, 0)
	instruct_17(-2, 1, 24, 28, 0)
My_Enter_SubScene(109,32,31,2)
instruct_17(109,1,30,29,2682*2)
instruct_17(109,1,30,30,2682*2)
instruct_17(109,1,30,31,4609*2)
--instruct_17(8,1,16,28,4611*2)
instruct_17(109,1,30,32,2706*2)
instruct_17(109,1,30,33,2674*2)
instruct_17(109,1,30,34,4529*2)
instruct_17(109,1,32,29,2642*2)
light()
say("怎么不见灭绝师太？")
say("师傅她老人家..仙逝了？",638)
say("姑娘，请节哀。")
say("感谢张教主和少侠的救命之恩。",169)
say("多谢。",8)
say("多谢救命之恩。",8)
say("我等就此别过，这是我等一点心意。",169)
JoinMP(638,17,2)
	if MPPD(0) == 0 and JY.Person[0]["品德"] >= 80 and JY.Person[0]["御剑能力"] >= 300 and JY.Person[0]["耍刀技巧"] >= 300 then 
	    say("何掌门、何夫人请留步。",0)
		say("少侠还有何事？",7)
        say("晚辈对于昆仑的威名早有耳闻，希望能入昆仑精修武艺",0)
		say("（这小子武功这么好，还想来昆仑？怕不是想持恩图我掌门之位？）",7)
	    say("（太好了，最近何师弟越来越不把我放在眼里，他来正好能敲打敲打这蠢蛋！）",166)
		say("少侠有恩于我派，我本不该拒绝，但是...",7)
		say("没什么但是！我们自诩正派，本不可知恩不图报！",166)
		say("如今我派坐忘峰正无一能人主持峰务，就有劳少侠担任我派坐忘峰主一职吧。",166)
		say("「何师弟」，没问题吧？",166)
		say("...夫人说的是...（咬牙切齿）",7)
		say("晚辈多谢二位了。",0)
	    JoinMP(0,19,2)
		addHZ(8)
		addHZ(9)
		addHZ(22)
		addthing(368,1)
		addthing(369,1)
	end	
dark()
instruct_17(109,1,30,29,0)
instruct_17(109,1,30,30,0)
--instruct_17(8,1,16,28,4611*2)
instruct_17(109,1,30,32,0)
instruct_17(109,1,30,33,0)
instruct_17(109,1,30,34,0)
light()
addthing(346)
addthing(288)
addthing(267)
addthing(267)
addthing(142)
addthing(124)
say("无忌，我也要去寻找天书了，在此别过了。")
say("天书？大哥，我知道《倚天屠龙记》的下落。",9)
say("当真？")
say("那本书就在我义父那里。",9)
say("我这就前去。")
say("我也好久没有见过义父了，我陪你去。",9)
say("好，有你同去，想必会顺利不少。")
say("我也去！",638)
say("芷若妹妹，你也要去？",9)
say("我...我...",638)
say("周姑娘想去就一同去吧。（这周姑娘神色怎的如此慌张）")
	if GetS(111,0,0,0) == 0 and (inteam(92) or GX(92)) then
		say("...唉，掌门性子刚烈，想必是自尽而亡了。",0)
		say("......",92)
		say("襄儿...",0)
		say("我没事。所幸如今其他门人皆安康，尤其芷若没事。",92)
		say("是啊，算是不幸中的万幸",0)
			if JY.Person[0]["性别"] == 0 then
				say("大哥，经此一事我忽有一悟，可愿共参？",92)
			else
				say("姐姐，经此一事我忽有一悟，可愿共参？",92)
			end
		instruct_0();
		if instruct_11(0,188) == true then 
			QZXS("领悟临济十二庄精要！",0)
			say("持道入佛...襄儿你真的悟了。",0)
			say("该远去的早已远去，该放下的也该放下了。",92)
			instruct_0();
			SetS(111, 0, 0, 0,153)
			if MPPD(0) == 17 then
			JoinMP(0,17,3)
			end
		else
			say("我道心未稳、佛学不深，却是体会不得了。",0)
			say("无妨，每个人有每个人的缘法。",92) 
		end	
	end
addevent(104, 46, 1, 948, 1, 7226)
dark()
instruct_17(109,1,30,31,0)
instruct_17(109,1,32,29,0)
light()
JY.Person[9]["携带物品3"] = 74
	if instruct_20() then
	addevent(70, 17, 1, 107, 1, 5284)
	else 
	instruct_10(9)
	end
	teammate(638)
	JY.Scene[72]["进入条件"] = 0
	addevent(72,4, 1, 5036, 1)
end

OEVENTLUA[5036] = function() --冰火岛
    if inteam(9) then
	null(-2,4)
    say("这是谢狮王的毛发，人哪去了？",0)
	say("义父双眼失明不可独自离开冰火岛，一定是仇家把他害了*……。",9)
	say("我看不会，冰火岛地处偏远*，你要不告诉我，我也很难*找到。而且岛上并没有打斗*的痕迹，我看多半是谢法王*自己离开了。",0)
	say("我义父双目失明，是不会一*个人走的。",9)
	say("那说不定是一个值得他信任*的人带他走的。",0)
	say("他在外面几乎全是仇家，哪*有什么朋友？",9)
	say("你忘了紫衫龙王么。",0)
	say("对！我们立刻去找她。",9)
	addevent(73,2, 0, 5037, 3)
	end
end

OEVENTLUA[5037] = function() --灵蛇
    if inteam(9) then
	dark()
	null(-2,2)
	null(44,0)
	null(44,1)
	addevent(-2, 0, 0, 0, 0, 5288)
	addevent(-2, 1, 0, 0, 0, 7008)
	addevent(-2, 4, 0, 0, 0, 5294)
	light()
	end
	instruct_25(48,24,26,23)
	say("谢三哥，你还信不过紫杉老*妹子么？",15)
	say("我说过了，除非见到我那无*忌孩儿，否则我是不会把屠*龙刀借给你的。",13)
	say("＜义父，怎么在这里？那金*花婆婆就是紫杉龙王？＞",9)
	say("＜无忌，我们进去相认吧＞",0)
	say("明教圣火令到，护教龙王、*狮王，还不下跪迎接，更待*何时。",174)
	say("＜圣火令？我教圣火令已经*遗失多年，这来的是什么人*？＞",9)
	dark()
	addevent(-2, 5, 0, 0, 0, 5222)
	addevent(-2, 6, 0, 0, 0, 5222)
	addevent(-2, 7, 0, 0, 0, 5222)
	light()
	say("本人早已破门出教，'护教*龙王'四字，再也休提。阁*下尊姓大名？这圣火令是真*是假，从何处得来？",15)
	say("明教源於何土？",174)
	say("源起波斯。",13)
	say("然也，然也！我乃波斯明教*总教流云使，另外两位是妙*风使、辉月使。我等奉总教*主之命，特从波斯来至中土*。",174)
	say("中土明教虽然出自波斯，但*数百年来独立成派，自来不*受波斯总教管辖。",13)
	say("这是中土明教的圣火令，前*任姓石的教主不肖，失落在*外，今由我等取回。自来见*圣火令如见教主。",174)
	say("我已说过，本人早已破门出*教，这圣火令与我何干？",15)
	say("本教教规，入教之后终身不*能叛教。你自称破门出教，*为本教叛徒，需留你不得。",174)
	dark()
	addevent(-2, 9, 0, 0, 0, 5288)
	null(-2,0)
	light()
	say("啊！",66)
	say("＜这三人一招之间就抓住了*紫杉龙王，功夫着实了得！*＞",0)
	say("快救救我妈妈！",66)
	say("大胆胡人，还不快放人。",0)
	if instruct_6(14,3,0,0) == false then 
	   instruct_15(0)
	   do return; end
	end
	instruct_37(1)
	null(-2,5)
	null(-2,6)
	null(-2,7)
	null(-2,9)
	addevent(-2, 0, 0, 0, 0, 5288)
	addevent(-2, 10, 0, 0, 0, 5284)
	instruct_19(26,24)
	instruct_40(0)
	light()
	say("多谢少侠出手相助。",13)
	say("狮王不必客气。",0)
	say("老婆子多谢啦。",15)
	say("龙王不必客气。这三个家伙*的武功真是怪异。咦？这是*什么？",0)
	say("这就是圣火令。",15)
	say("这上面好像有字？",0)
	say("我来看看。哦，这是波斯文*字，我给你译出来。",15)
	dark()
	light()
	addthing(70)
	say("却不知这些人为何要为难婆*婆？",0)
	say("说来话长。我本是波斯明教*的圣女。",15)
	say("啊？",0)
	say("我来到中原，加入明教，本*是寻找乾坤大挪移心法的。*没想到对银叶先生动了真情*，结为夫妻，这是犯了波斯*明教的大忌，按照教规理应*处死。我这么多年隐姓埋名*，没想到还是被找到了。",15)
	say("哦。",0)
	say("看，又来了好多人。",66)
	say("此地不宜久留，我们还是离*开这里吧。",0)
	say("我还要找我的无忌孩儿。",13)
	say("义父，孩儿无忌不孝，没能早日前来相接，累义父受尽辛苦。", 9)
	say("你....你说什么？", 13)
	say("拳学之道在凝神，意在力先方制胜............", 9)
	say("你....你当真便是我那无忌孩儿？", 13)	
	say("好教您老人家得知，无忌现在已经是明教的教主，以后您老人家还要向他行礼呢。")
	say("真的吗？太好了！金毛狮王谢逊参见教主！", 13)
	say("义父不要这样。孩儿有个不情之请，大哥对我有有恩，还请义父将《倚天屠龙记》这本天书送与大哥。", 9)
	say("好！不过，在此之前，少侠需将成昆的人头拿来，我便将天书和屠龙宝刀拱手相送。", 13)
	say("一言为定。",0)
	say("我在冰火岛等你。", 13)
	dark()
	null(-2,0)
	null(-2,10)
	null(-2,1)
	null(-2,4)
	addevent(72,2, 1, 5038, 1, 5294)
	addevent(9, 2, 1, 5039, 1, 2648*2)
	light()
end

OEVENTLUA[5038] = function() --冰火岛
   say("成昆的人头带来了吗？",13) 
end

OEVENTLUA[5039] = function() --成昆
	say("没想到还能有人找到这里，小子，你就是江湖上传闻在找十四天书的那个人吧。", 18)
	say("你是谁？")
	say("我就是混元霹雳手成昆。", 18)
	say("原来你就是成昆，受死吧！")
	say("狂妄的小子", 18)
		if WarMain(361) == false then
			instruct_15(0);   
			instruct_0();  
			do return; end			
		end				
		null(-2, 2)
		null(72, 2)
		light()
		addevent(72,0, 0, 5040, 3)
		addevent(72,1, 0, 5040, 3)
    say("逃得好快！这下麻烦了。")
end

OEVENTLUA[5040] = function() --冰火岛
   dark()
   null(-2,0)
   null(-2,1)
   light()
   say("奇怪，谢狮王去哪了？",0) 
   say("打斗的痕迹？糟糕！！",0) 
   say("赶紧回明教看看，他们消息灵通一点！！",0) 
   addevent(11,110, 1, 5041, 1,2671*2)
   addevent(11,101, 1, 5041, 1,2667*2)
   instruct_3(11,109,1,0,5041,0,0,2663*2,2663*2,2663*2,-2,30,15)
   --addevent(11,109, 1, 5041, 1,2663*2)
end

OEVENTLUA[5041] = function() --冰火岛
   say("大事不好了，刚收到消息，谢狮王被抓，关在了少林！！",11) 
   say("我们去就狮王吧！！",14) 
   say("是啊，狮王树敌太多，怕是危险了！！",10) 
   say("我马上动身去少林救狮王",0) 
   dark()
   null(-2,101)
   null(-2,110)
   null(-2,109)
   instruct_17(28,1,5,44,5294)
   instruct_3(28,100,1,0,5042,0,0,2711*2,2711*2,2711*2,-2,4,47)
   light()
end

OEVENTLUA[5042] = function() --冰火岛
   say("少林后山重地不得擅闯！！",485) 
   if inteam(9) then 
   say("快点让开，否则不客气了！",0) 
   say("多说无益，看阵！！",485) 
   SetS(86,1,2,5,3)
   if WarMain(217) == false then
      instruct_15(0)
      do return; end
   end
   say("少林岂容你放肆。",70)
   say("今日无论如何也要带走谢逊！",0) 
    if WarMain(80) == false then
	   instruct_15()
	   do return; end
	end
	addHZ(114)
   say("谢逊多谢少侠前来相救，但是我谢逊一生作恶多端，我想留在少林，出家为僧！",13) 
   say("........这！",0) 
   say("少侠，你走吧，谢逊感激不尽！",13) 
   say("........！<我天书还没拿到呢~~>",0)
   say("义父！！",9)
   say("无忌孩儿，快走吧，义父要在此赎罪。",13) 
   addevent(-2,100, 1, 5043, 1)
   instruct_3(28,101,1,0,5044,0,0,2648*2,2648*2,2648*2,-2,18,12)
   light()
   end
end

OEVENTLUA[5043] = function() --冰火岛
    say("少林后山重地不得擅闯！！",485)
    if hasthing(219) and inteam(9) then 
        say("谢狮王，成昆已经死了，这是他的人头。",0)
	    dark()
	    light()
	    addthing(219,-1)
	    say("哈哈哈，成昆恶贼，你终于死了，啊啊啊啊！！！。",13)
	    say("少侠，这《倚天屠龙记》就送于少侠了，那屠龙刀却是被少林拿去了,这本狮吼功秘籍少侠拿去吧。",13)
	    say("无妨，有天书即可。",0)
	    if GetS(113,0,0,0) == 0 then 
	        say("少侠！这本崆峒派的七伤拳谱是我早年所得，现在我已遁入空门，这本拳谱就赠予少侠。",13) 
	        instruct_0();
			if instruct_11(0,188) == true then 
	            QZXS("领悟七伤拳精要！")
	            instruct_0();
	            setLW1(23)
				addthing(89)
				addthing(124)
			else
				say("如此，罢了。",13) 
			end	
	    end
		if GetS(113,0,0,0) == 0 and PersonKF(0,185) then 
	        say("无忌见大哥也修习过武当九阳功，早年太师傅传授过我要诀，如若不嫌弃无忌愿分享。",9) 
	        instruct_0();
			if yesno("是否领悟？") then 
	            QZXS("领悟武当九阳功！")
	            say("武当绝学果然厉害!",0) 
	            instruct_0();
	            SetS(111,0,0,0,185)
		    else
			    say("那无忌希望大哥早日达成心愿",9) 
		    end	
	    end
	    say("义父，你当真要在削发为僧么。",9)
	    say("无忌孩儿，这是义父应得的报应，你不要伤心。",13)
	    say("可是......",9)
	    say("不用再劝了，无忌孩儿，明教以后就靠你了。",13)
	    say("义父，以后我再来看你。",9)
	    light()
	    addthing(155)
	    addthing(69)
	    say("危险！！",0)
        if WarMain(128) == false then
            instruct_15(0)
            do return; end
        end
        light()
        addHZ(130)
        say("这些东瀛人也在找天书？",0)
		addevent(51,-2,0,5045,3,-2,41,30)
    end
end

OEVENTLUA[5044] = function() --冰火岛
   say("可恶的小子，居然让你找到这！！",18)
   say("成昆，今日你插翅难逃",0)
   if WarMain(10) == false then
      instruct_15(0)
      do return; end
   end
   null(-2,101)
   light()
   say("这恶贼终于死了，也算了却了狮王的一桩心愿。",0)
   addthing(219)
end

OEVENTLUA[5045] = function() --黄衫女剧情
   if MPPD(0) == 2 and hasthing(147) then
   dark()
   light()
   null(-2,5)
   addevent(51,-2,0,-2,-2,-2,41,30)
   end
   
end

OEVENTLUA[5046] = function() --独孤
if inteam(929) then 
dark()
null(-2,20)
instruct_3(80,19,0,0,0,0,0,4640*2,4640*2,4640*2,-2,25,31) --独孤坐标
instruct_3(80,17,0,0,0,0,0,4643*2,4643*2,4643*2,-2,25,25) --云流坐标
instruct_3(80,16,0,0,-2,0,0,0,0,0,-2,-2,-2) --清除独孤坐标
light()
say("<咦？这后山有人交谈？过去看看>")
instruct_30(49,36,35,36);   --  30(1E):主角走动27-49--27-34
instruct_30(35,36,35,28);   --  30(1E):主角走动27-49--27-34
instruct_40(2);   --  40(28):改变主角站立方向1
say("谢兄，你我每日在此论剑，却是未曾动手切磋，今日何不借此良机在此比试一番如何？",592)
say("哈哈哈，谢某早有此意，独孤兄请。",494,0,"谢云流")
say("如此，谢兄请接招。",592)
instruct_27(19,4715*2,4729*2)  --独孤出招
instruct_3(80,18,0,0,0,0,0,0,0,0,-2,25,26) --特效坐标
say("来的好！",494,0,"谢云流")
instruct_27(18,4745*2,4758*2) 
say("独孤兄果真是剑法通神，这招一力降十会，与那藏剑山庄的山居剑意颇为相似，且看我这招如何。",494,0,"谢云流")
say("好，谢兄请。",592)
instruct_27(17,4730*2,4744*2) --云流出招
instruct_3(80,18,0,0,0,0,0,0,0,0,-2,25,30) --特效坐标
instruct_27(18,4781*2,4796*2) 
say("谢兄这一招天地无极当真是让人防不胜防啊，若只注意其正面攻击，必然会忽视其暗藏的杀机。",592)
say("独孤兄过誉了。",494,0,"谢云流")
say("谢兄再接我一招。",592)
say("独孤兄请。",494,0,"谢云流")
instruct_3(80,18,0,0,0,0,0,0,0,0,-2,25,26) --特效坐标
instruct_27(19,4715*2,4729*2) --独孤出招
say("咦？居然反其道而行。",494,0,"谢云流")
instruct_27(18,4745*2,4758*2)
say("谢兄看我这一招如何？",592)
say("不想独孤兄精通轻重之精髓，举轻若重，谢某佩服。",494,0,"谢云流")
say("来而不往非礼也，接我一招无我无剑。",494,0,"谢云流")
instruct_3(80,18,0,0,0,0,0,0,0,0,-2,25,30) --特效坐标
instruct_27(17,4730*2,4744*2) --云流出招
instruct_27(18,4781*2,4796*2) 
say("谢兄这招专攻人要害，且出招之间剑气与剑意愈发强盛，稍有不慎便会令人身死当场，当真了得。",592)
say("独孤兄你我在此便一招定胜负如何？",494,0,"谢云流")
say("正有此意。",592)
instruct_3(80,18,0,0,0,0,0,0,0,0,-2,25,28) --特效坐标
say("此招乃谢某远赴海外，以恩师所授剑法自创招式，天道剑封破！",494,0,"谢云流")
instruct_27(17,4730*2,4744*2) --云流出招
say("哈哈哈，某战败天下英雄豪杰，但求一败而不得，此便是某所悟剑意，破尽天下！",592)
instruct_27(19,4715*2,4729*2) --独孤出招
instruct_27(18,4759*2,4780*2) 
say("好强的剑气！！这二人想必都是天下一等一的用剑宗师，相隔如此之远还能清晰感受到那凛冽的剑气，如若靠近必定横死当场！")
say("痛快痛快！！哈哈哈！！！",592)
say("哈哈哈，独孤兄果然了得，我这招却是没能赢得了独孤兄。",494,0,"谢云流")
say("谢兄此言差矣，某也未曾赢得谢兄一招半式。",592)
say("哦？来人了。",494,0,"谢云流")
dark()
    addevent(80,19, 0, 0, 0, 4641*2)
	addevent(80,17, 0, 0, 0, 4641*2)
light()
say("晚辈见过两位前辈，晚辈路经此地，听闻动静寻声而来，打扰两位前辈在此切磋，望两位前辈见谅！")
say("无妨，我与谢兄也是一时技痒。",592)
say("弟子拜见师傅，见过前辈！",929)
say("哦？还是谢兄熟人？",592)
say("森九岚，你不在刀宗，来此何干？",494,0,"谢云流")
say("殿下吩咐弟子跟随这位少侠处理东瀛入侵中原一事。",929)
say("哦？那些人按耐不住了？不过我不是说过尔等不准插手此事么，滚回去。",494,0,"谢云流")
say("这.....",929)
say("想必这位便是刀宗谢宗主，恕晚辈斗胆说两句！")
say("你说。",494,0,"谢云流")
say("据晚辈了解谢宗主亦是中原人，如今中原纷争不断，东瀛人欲侵占中原，届时中原必将生灵涂炭！")
say("那又如何？",494,0,"谢云流")
say("谢宗主忍心中原大好河山毁于一旦么？！")
say("这与谢某何干！",494,0,"谢云流")
say("听闻谢宗主早年因故远赴东瀛数十年，谢宗主当下可是在埋怨当年之事？！")
say("中原武林勾心斗角，纷争不断，为一己私欲便可丧尽天良，谢某为何要管？",494,0,"谢云流")
say("天下的苍生百姓却是无辜的，谢宗主既然知晓武林纷争的后果，难道不知天下纷争带来的灾难？")
say(".........",494,0,"谢云流")
say("若是谢宗主当真心无中原，又如何会回这中原武林？")
say("谢某做事又何须他人多言！",494,0,"谢云流")
say("晚辈...冒昧了")
say(".......",929)
say("谢兄当真是口硬心软。",592)
say("独孤兄何出此言？",494,0,"谢云流")
say("哈哈哈，莫要怪某直言。",592)
say("观其剑知其人，某岂会看错人，谢兄怕是心系中原，特意赶回中原之地。",592)
say("......",494,0,"谢云流")
say("森九岚，处理完此事早日回去，休要在外逗留。",494,0,"谢云流")
say("！！！！是，师傅！！",929)
say("晚辈多谢谢宗主！！",0)
    if JY.Person[0]["内力最大值"] >= 8888 then 
	say("小兄弟，某见你容光焕发、神采奕奕，有意传授你几招运剑法门，可愿否？",592)
	say("多谢前辈",0)
	say("独孤兄倒是豁达的很。",494,0,"谢云流")
	say("哈哈哈，来日某要是死了也有人继承某之衣钵。",592)
	say("多谢前辈指点！！",0)
	say("你小子倒是好福气，将来可休要堕了独孤兄的名头。",494,0,"谢云流")
	say("晚辈必将会将前辈武学发扬光大！！",0)
	say("哈哈哈，小子你可听好了。",592)
	say("敌强我以柔",592)
	say("敌柔我以变",592)
	say("敌变我以专",592)
	say("敌专我以强",592)
	say("某之剑法重意不重形，他日若是你能做到某所言之境界，便可剑法大成。",592)
	addthing(116)
		if GetS(113, 0, 0, 0) == 0 then
			say("看好了！！",592) 
			SetS(106, 63, 1, 0, 0)
			SetS(106, 63, 2, 0, 114)
			if WarMain(288) == false then
				instruct_13()  --场景变亮
				say("真是可惜",0) 
			else
				say("此乃运剑法门，小兄弟可愿继承某之衣钵？",592)		
				QZXS("领悟重剑精髓！")
				instruct_0();
				say("多谢前辈",0) 
				SetS(113, 0, 0, 0, 45)
				AddPersonAttrib(0, "内力最大值", 1000)
				QZXS("内力最大值增加1000")
				instruct_35(0,2,45,1)
			end 
		end
	end
	if JY.Person[0]["御剑能力"] >= 350 and JY.Person[0]["品德"] >= 95 then 
	    say("某见小兄弟正直无私，想把独孤九剑传予你，汝可愿否？",592) 
		say("晚辈一定不会让前辈失望！",0) 
	    say("好！先让某看看你对天下间的拳法了解多少？",592)
		if WarMain(371) == false then
			AddPersonAttrib(0, "拳掌功夫", 80)
            QZXS("拳掌功夫增加80")
			instruct_15(0);
			instruct_0();
			do return;end
		end				
		say("不错不错，再让某看看你的剑法造诣",592)
		if WarMain(372) == false then
			AddPersonAttrib(0, "御剑能力", 80)
            QZXS("御剑能力增加80")
		    instruct_15(0);
		    instruct_0();
		    do return;end
		end	
        say("刀法与剑法大不相同，某看看你的刀法见解",592)
		if WarMain(373) == false then
			AddPersonAttrib(0, "耍刀技巧", 80)
            QZXS("耍刀技巧增加80")
			instruct_15(0);
			instruct_0();
			do return;end
		end		
        say("奇门兵器五花八门，某看看你识得几样",592)
		if WarMain(374) == false then
			AddPersonAttrib(0, "特殊兵器", 80)
            QZXS("特殊兵器增加80")
			instruct_15(0);
			instruct_0();
			do return;end
		end	
        say("暗器手法，往往被人视为小道，实则不然，某看看你对此道见解",592)
		if WarMain(375) == false then
			AddPersonAttrib(0, "暗器技巧", 80)
            QZXS("暗器技巧增加80")
			instruct_15(0);
			instruct_0();
			do return;end
		end	
        say("武学的根本，是内功，为武道之基石，让某看看你的内功火候",592)
		if WarMain(376) == false then
			AddPersonAttrib(0, "内力最大值", 1500)
            QZXS("内力最大值增加1500")
			instruct_15(0);
			instruct_0();
			do return;end
		end					
		say("好好好！",592)
	    instruct_0();
		if GetS(113,0,0,0) == 0  then 
			if instruct_11(0,188) == true then 
	            QZXS("领悟九剑精要！")
				say("晚辈感谢前辈传剑",0)
	            instruct_0();
	            setLW1(47)
			else
				say("某亦不强求。",592) 
			end	
		end
		say("独孤兄既如此大方，谢某也传授你几招。",494,0,"谢云流")
		say("谢某所学乃纯阳宫武学，不方便传授与你，我便传你我刀宗武学精要。",494,0,"谢云流")
		say("我刀宗虽以刀命名，实则亦是剑法，一刀流剑术之极意原在简单两字，剑之极致唯有 快 准 集中。",494,0,"谢云流")
		say("晚辈多谢谢宗主指点！！")
		dark()
		light()
		instruct_35(0,2,45,1)
		instruct_35(0,3,47,1)
		instruct_35(0,2,45,1)
		instruct_35(0,3,47,1)
		addthing(114)
		addthing(116)
	end	
say("啊，谢宗主，无悠宗主吩咐在下若是寻到谢宗主，便告知于她！！")	
say(".......独孤兄，谢某怕是要先行告辞了。",494,0,"谢云流") 
say("哈哈哈哈，谢兄也有如此窘况，谢兄请便。",592)
dark()
null(-2,17)
light()
say("啊？这？？")
say("小子，这是谢兄在躲着你口中那位，好了，谢兄离去，某也无兴致逗留在此，告辞了。",592)
say("阿，差点忘了。",592)
say("看你练武之际，还懂得心系家国，倒是值得赞赏",592)
say("这本秘籍就送你吧，此乃某于东海海滨练剑时的心得。",592)
addthing(362)
say("多谢独孤前辈！",0)
	if GetS(111,0,0,0) == 0 and PersonKF(0,45) then
		say("嗯...",592)
		say("前辈尚有何事要交代与我的？",0)
		say("也罢，你小子算合我心意，也学过重剑之道",592)
		say("我这门功法与重剑之道也是相辅相成",592)
		say("我给你个小小试炼吧，通过了，我就给你讲讲这功法",592)
		if DrawStrBoxYesNo(-1, -1, "是否挑战？", C_WHITE, 30) == true then
			JY.Person[58]["武功等级1"] = 999
			JY.Person[58]["武功等级2"] = 999
			JY.Person[58]["武功等级3"] = 999
			JY.Person[58]["武功等级4"] = 999
			JY.Person[58]["生命"] = 2300
			JY.Person[58]["生命最大值"] = 3000
			JY.Person[58]["内力"] = 8000
			JY.Person[58]["内力最大值"] = 10000
			SetS(106, 63, 1, 0, 0)
			SetS(106, 63, 2, 0, 58)
			setJX(58)
			if WarMain(288) == false then
				instruct_13()  --场景变亮
				say("真是可惜",0)
				say("无妨",592)	
			else
				say("哈哈哈，小子表现不错阿！",592)		
				say("侥幸、侥幸！",0) 
				say("哈哈哈，不用过谦了！",592)
				say("来，这门功法的精要在于...",592)
				dark()
				light()
				instruct_0();
				say("多谢前辈",0)
				QZXS("领悟怒海剑涛秘义！！")	
				SetS(111, 0, 0, 0, 203)
			end
			JY.Person[58]["生命"] = 1000
			JY.Person[58]["内力"] = 4000
		else
			say("小子实在没有信心...",0)
			say("也罢",592)
		end
	end		
say("只要你将武功用于正途即可。好了，某真的要告辞了。",592)
dark()
null(-2,19)
instruct_3(80,16,1,0,-2,0,0,9282,9282,9282,-2,-2,-2) --重新显示独孤坐标
addevent(113,1,1,5047,1)
light()
say("我还是去告知谢宗主吧。")
end
end

OEVENTLUA[5047] = function() --刀宗
say("阁下此番前来可是打探到了谢云流的下落？",597)
say("这.....")
say("哼！森九岚你说。",597)
say("回禀殿下，此番出行途中却是遇到了师傅。",929)
say("他现在人在何处？",597)
say("这...师傅有意躲避殿下，已经离去，弟子并不知晓师傅现在何处。",929)
say("哼！居然刻意躲避本宗主，迟早要他好看。",597)
say("（这么凶，话说他们到底是何关系？）")
say("......阁下的想法似乎很恶劣？",597)
say("啊？")
say("罢了，森九岚，这段时间本宗主要离开一趟。",597)
say("不知殿下欲往何处？",929)
say("自是亲自去寻他。",597)
say("可是师傅吩咐.....",929)
say("教他亲自来与我说，否则免谈。",597)
say("是.....",929)
say("谢宗主，在下有一事不明，还请谢宗主解惑。")
say("何事？",597)
say("不知东瀛人抢夺，却是为何？")
say("怕是为了那飘渺的天命吧，不过本宗主却是不信的，若是如此，那天命想来也不过如此。",597)
say("..........")
say("对了，阁下要找的人潜伏在某处森林之中，言尽于此。",597)
say("本宗主还有事要处理，阁下请回吧。",597)
instruct_17(113,1,13,15,4712*2)
null(-2,1)
instruct_27(1,4759*2,4780*2)
dark()
instruct_17(113,1,13,15,0)
light()
say("谢宗主的武功当真是神鬼莫测！！！！")
instruct_3(109,11,1,0,5048,0,0,3638*2,3638*2,3638*2,-2,15,11) --树林加个事件
end

OEVENTLUA[5048] = function() --树林
say("！！！！")
say("........",553)
say("原来藏在这，快把天书还给我！")
setJX(553)
	if WarMain(128) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
		light()
instruct_3(109,11,0,0,0,0,0,0,0,0,-2,30,29) --树林加个事件
addthing(JY.Person[578]["无用13"])
say("跑的好快，可恶！")
SetS(99,1,0,0,0)
end

OEVENTLUA[5059] = function() --衡阳
	if JY.Person[578]["无用14"] ~= 1 then
		dark()
		null(-2,15)
		light()
		say("听闻萧大侠过寿辰，广邀天下英雄豪杰去他府中做客。",220,0,"小二")
		say("<竟有此事？我倒要去瞧瞧这晋阳大侠的风采。>")
		instruct_3(111, 15, 0, 0, 0, 0, 5049, 0, 0, 0, -2, 11, 34) --箫半和
		null(1,19)
		null(109,0)
		null(109,1)
		null(79,0)
		null(79,1)
		SetS(99,0,1,0,1)
	end	
end

OEVENTLUA[5049] = function() --衡阳
dark()
null(-2,15)
--instruct_17(-1,1,8,38,3514*2)
instruct_3(111, 15, 1, 0, 5050, 0, 0, 3514*2, 3514*2, 3514*2, -2, 8, 38) --箫半和
instruct_17(-2,1,12,40,4416*2)
instruct_17(-2,1,12,39,4420*2)
instruct_17(-2,1,12,38,4424*2)
light()
say("今日我叫诸位前来是有要事相商。",189)
say("<咦！好像在讨论大事，那我却是不能冒然进去>")
dark()
light()
say("萧大侠放心，我夫妻二人必将为萧大侠取得此物。",382,0,"林玉龙")
say("萧大侠放心吧。",380,0,"任飞燕")
say("如此，萧某在此谢过各位。",189)
say("我等先告辞了。",382,0,"林玉龙")
dark()
instruct_17(-2,1,12,40,0)
instruct_17(-2,1,12,39,0)
instruct_17(-2,1,12,38,0)
instruct_17(-2,1,11,35,3624*2)
light()
say("啊！",77)
say("啊！姑娘你没事吧？")
say("<糟糕，可不能让爹发现了>我等江湖儿女，岂会在意些许小事，少侠，告辞。",77)
dark()
instruct_17(-2,1,11,35,0)
light()
say("这姑娘怎的说话如此老气横秋？还是先去拜见萧大侠。")
--instruct_3(111, 15, 0, 0, 0, 0, 5049, 0, 0, 0, -2, 11, 34) --箫半和
end

OEVENTLUA[5050] = function() --衡阳
say("晚辈听闻萧大侠过寿，特来祝寿。")
say("哈哈哈，少侠有劳了。",189)
say("不好了老爷，小姐不见了！",220,0,"仆从")
say("什么！这丫头怎的如此不省心，怕是听到谈话偷跑出去了，江湖凶险岂是她一个未行走过江湖的黄毛丫头能应付的。",189)
say("晚辈刚刚进来时遇到了一位急匆匆的姑娘，想来便是令千金了，萧大侠若是不弃，晚辈愿追回令千金。")
say("这...怕是多有不便。",189)
say("萧大侠多虑了，晚辈绝无恶意，晚辈敬仰萧大侠为人，能为萧大侠排忧解难是晚辈的福分。")
say("如此...便有劳少侠了。",189)
say("慧儿从未行走过江湖，怕是会吃亏，烦请少侠尽快找到慧儿。",189)
say("那，晚辈现行告辞了。")
say("少侠请走好。",189)
addevent(-2,15,1,5051,1)
addevent(109,0,0,5052,3)
addevent(109,1,0,5052,3)
end

OEVENTLUA[5051] = function() --衡阳
say("有劳少侠了。",189)
end

OEVENTLUA[5052] = function() --衡阳
dark()
null(-2,0)
null(-2,1)
addevent(-2, 6, 0, 0, 0, 3183*2)
addevent(-2, 5, 0, 0, 0, 3184*2)
addevent(-2, 7, 0, 0, 0, 3186*2)
addevent(-2, 8, 0, 0, 0, 3185*2)
--addevent(-2, 4, 0, 0, 0, 3624*2)
light()
instruct_25(43,31,32,31) --场景移动
bgtalk("呼听得銮铃声响，蹄声得得，一乘马自南而来")
JY.Person[651]["姓名"] = "逍遥子"
JY.Person[652]["姓名"] = "常长风"
JY.Person[653]["姓名"] = "花剑影"
JY.Person[654]["姓名"] = "盖一鸣"
	say("各位兄弟，听这马儿奔跑甚速，倒是一匹骏马。不管怎样，将马儿扣下来再说，便是没什么其他宝物，这匹马也可当做礼物了。", 651)	
	say("大哥料事如神，言之有理，快解腰带，做个绊马索！", 654)	
bgtalk("当下将四根腰带连接起来，正要在两颗大叔之间拉开，马匹马已奔进林来")
dark()
addevent(-2, 11, 0, 0, 0, 3624*2)
light()
	say("你们在干什么？", 77)
	say("安绊马索.....", 654)
	say("安绊马索干嘛？", 77)
	say("绊你的马儿啊！好，你既已知道，这马索也不用了。你乖乖下马，将马儿留下，你好好去吧。咱们太岳四侠绝不能欺侮单身女子，自坏名头。", 654)
	say("你们要我的马儿，还不是欺侮我吗？", 77)
	say("这个嘛...自有道理。", 654)
	say("我们不欺侮你，只欺侮你的坐骑。一头畜生而已，算得什么？", 651)	
	say("不错，我们太岳四侠，是江湖上铁铮铮的好汉，决不能为难妇孺之辈。你只需要留下坐骑，我们不碰你一根毫毛。想我八步赶蝉,赛专诸,踏雪无痕.....", 654)
	say("别说，别说。你们不知道我是谁，我也不知道你们是谁，是不是？？", 77)
	say("是啊不知道那便如何？", 654)
	say("咱们既然互不相识，若有得罪，爹爹便不能怪我。哼，好大胆的毛贼，四个儿一起上吧！", 77)
	instruct_25(32,31,43,31) --场景移动
	say("<那不是萧大侠的千金么，我岂能坐视不管>")
	instruct_30(43,31,35,31) --场景移动
    say("兀那毛贼，光天化日之下岂容尔等放肆！")
	if WarMain(345) == false then
		instruct_15()
		do return end		
	end
	null(-2,7)
	null(-2,8)
	addevent(-2, 9, 0, 0, 0, 3183*2)
	addevent(-2, 10, 0, 0, 0, 3183*2)
	addevent(-2, 11, 0, 0, 0, 3183*2)
	addevent(-2, 5, 0, 0, 0, 3505*2)
	light()
	say("喂，大个子，你拿着的是什么玩意儿？", 77)
	say("这是常二侠的奇门冰兵刃，不在武林十八般武器之内，招数奇妙，哎哟...哎哟！", 652)
	bgtalk("却原来那少女反转长刀，以刀背在他手腕上一敲。常长风吃痛，奇门兵刃脱手，无巧不巧，又砸上先前砸的肿起了的脚趾")
	say("痨病鬼，你点的是什么穴？", 77)
	say("这是”中渎穴“，点之腿膝麻痹，四肢软瘫，还不给我束手就缚？", 651)
	say("中渎穴不在这里，偏左了两寸。", 77)
	say("偏左了，不会吧？", 651)
	bgtalk("伸出烟管，又待来点。那少女一刀砍下，将他烟管打落，随机双刀交于右手，左手一把抓住他的衣领，足尖在马腹上轻轻一点，那马一声长嘶，直蹿出林。逍遥子给她拿住了后颈，全身麻痹，四肢软瘫，只有束手就缚")
	say("风紧，扯呼！", 654)
	say("你抓住我的风池穴，那是足少阳和阴维脉之会，我自然是无法动弹，那也不足为奇，非战之罪，虽败犹荣。", 651)
	say("你自身的穴道倒是说的对！你对姑娘无礼，不能不杀！", 77)
	say("好吧！不过你最好从我天柱穴中下刀，一刀绝气，免得多受痛苦！", 651)
	bgtalk("那少女忍不住好笑，心想这痨病鬼临死还在研究穴道，我再吓他一吓，瞧是如何，于是将刀抵在他头颈“天柱”和“风池”两穴之间")
	say("便是这里了。", 77)
	say("不不不，姑娘错了，还要上去一寸二分....", 651)
	say("姑娘连我们三一起杀了....", 652)
	say("干什么自己来送死？", 77)
	say("我太岳四侠义结金兰，不求同年同月同日生，但愿同年同月同日死。姑娘杀我大哥，我兄弟三人不愿独生，便请姑娘一齐杀了。有谁皱一皱眉头，不算是好汉！", 654)
	bgtalk("那少女举刀半空，作势砍落，盖一鸣咧嘴一笑，毫不闪避")
	say("好！你们四人武艺平平，义气却重，算的是好汉子，我饶了你们吧。", 77)
	say("请问姑娘尊姓大名，我们太岳四侠定当牢牢记在心里，日后以报不杀之恩。", 654)
	say("我的姓名你们不用问了。我倒是要问你们，干嘛要抢我坐骑？", 77)
	say("今年三月初十，是晋阳大侠萧半和的五十诞辰.....", 654)
	say("你们认识萧老英雄吗？", 77)
	say("我们不识萧老英雄，只是素来仰慕他老人家的英名，算得上是神交已久，要趁他五十诞辰前去拜寿。说来惭愧，我们四兄弟少了一份贺礼，上不得门，因此...便...所...这个.....", 654)
	say("（抢萧大侠的千金身上来了，这四人当真是活宝，不过萧姑娘倒也有些大家风范）")
	say("原来你们要抢我坐骑去送礼。嗯，这个容易。这支金钗给了你们，钗上这颗明珠很值钱，你们拿去作为贺礼，萧老英雄一定喜欢。", 77)
	say("姑娘慷慨豪爽，倒是我辈中人。", 651)
	say("大哥料事如神，言之有理。", 654)
	say("（....这萧姑娘当真不知若是萧大侠识得此珠，这四人怕是吃不了兜着走）")
	say("我兄弟四人告辞。", 651)
	dark()
	null(-2,6)
	null(-2,9)
	null(-2,10)
	null(-2,11)
	light()
	say("方才多谢少侠仗义相助。", 77)
	say("萧姑娘别来无奈。")
	say("你认识本姑娘？", 77)
	say("萧姑娘说笑了，早先在萧大侠府上遇见过萧姑娘。")
	say("原来是你呀，倒是本姑娘失礼了。", 77)
	say("在下受萧大侠所托，寻萧姑娘回去，萧大侠很是担心萧姑娘。")
	say("爹爹让你来寻我？", 77)
	say("正是。")
	say("即便如此，本姑娘也是不能回去的，若是就此回去，岂不是让本姑娘颜面无存。", 77)
	say("不知萧姑娘有何目的，在下也许能帮衬一二。")
	say("无需你帮忙，本姑娘自会解决，有缘再见。", 77)
	bgtalk("说着一提马缰，那骏马四蹄翻飞，远远去了")
	dark()
	null(-2,5)
	light()
	say("这萧姑娘倒是任性，不知下次何处方能寻你。")
	instruct_3(40,101,0,0,0,0,5053,0,0,0,-2,12,40)
end

OEVENTLUA[5053] = function() --衡阳
dark()
null(-2,101)
instruct_17(-2,1,11,37,3624*2)
instruct_17(-2,1,12,37,1265*2)
instruct_17(-2,1,13,37,1266*2)
instruct_17(-2,1,13,38,1267*2)
instruct_17(-2,1,12,38,1268*2)
light()
bgtalk("那少女坐在客店的一间小客房里,桌上放着一把小小酒壶，壶里装着是天下驰名的汾酒。可是她只喝了一口，嘴里便辣辣的又麻又痛")
say("爹爹常说：“女孩子不许喝酒。”，这酒实在不好喝，为什么爹爹却这么喜欢？", 77)
bgtalk("在家中得听爹爹的话，这次一个人偷偷出来，这汾酒非得好好喝上一壶不可，她又喝了一大口，自觉脸上有些发热，伸手一摸，竟有些发烫")
say("萧姑娘别来无恙。")
say("你一路跟随至此么？", 77)
say("姑娘宝马甚速，在下想追也是心有余力不足，在此遇见萧姑娘，想来是缘分。")
bgtalk("此时瞧见那少女脸色微红，不禁微微失神")
say("啐，谁和你有缘。", 77)
say("是在下失礼了。")
say("不如喝一杯如何？", 77)
say("佳人相邀，在下岂能拒绝。")
dark()
instruct_19(12,39);   --  19(13):主角移动至2D-12
light()
say("好酒！这甘宁镇的汾酒果然名不虚传。")
say("（我怎的感觉不出这酒有何好的，难道你们都不怕辣么）", 77)
say("伙计，再来三斤！",393,0,"镖师")
say("张兄弟，这道上还是把细些的好，少喝几杯！江湖上有言道：“手稳口也稳，到处好藏身。”待到了北京，咱们再痛痛快快的大醉一场。",392,0,"周总镖头")
say("总镖头，我瞧你也是稳得太过。那四个点子胡吹一轮什么太岳四侠，就把你吓得...嘿，嘿...伙计，快打酒来！",393,0,"张镖师")
say("那太岳四侠当真有趣，想来这批镖师也跟太岳四侠交过手啦。", 77)
say("那四个活宝倒也是极品。")
say("我怕什么了？你那知道我身上挑的千斤重担啊。这十万两盐镖，也没放在我姓周的心上。哼，这事也不便跟你细说，到了北京，你自会知道..",392,0,"周总镖头")
say("不错，不错！我不知道，我不知道。嘿嘿，鸳鸯刀啊鸳鸯刀！",393,0,"张镖师")
say("鸳鸯刀！", 77)
say("原来萧姑娘所图便是那鸳鸯刀啊。")
say(".......", 77)
say("若是在下助萧姑娘取得那鸳鸯刀，萧姑娘便回家如何？")
say("若是取得那鸳鸯刀，本姑娘自会回去。", 77)
say("你怎知道，是谁泄露了风声？张兄弟这件事可不是闹着玩的。",392,0,"周总镖头")
say("这里的兄弟谁人不知，哪个不晓？单就你自己，才当是个什么了不起的大秘密。",393,0,"张镖师")
say("谁说的？",392,0,"周总镖头")
say("哈哈，还能有谁？是你自己。",393,0,"张镖师")
say("我几时说过了？张兄弟，今日你不说个明明白白，咱哥们可不能算完。我姓周的平日带你不薄啊...",392,0,"周总镖头")
say("总镖头，你别急，张大哥的话没错，是你自己说的。",282,0,"镖头")
say("我？我？我怎么会？",392,0,"周总镖头")
say("咱们镖车一离西安，每天晚上你睡着了，便尽说梦话，翻来覆去总是说：“鸳鸯刀，鸳鸯刀！这一次送去北京，可不能出半点岔子，得了鸳鸯刀，无敌于天下....”。",282,0,"镖头")
say("各位千万不可再提“鸳鸯刀”三个字，我今晚起，我用布包着嘴巴睡觉。",392,0,"周总镖头")
say("踏破铁鞋无觅处，得来全不费工夫，这一对鸳鸯刀竟然在这镖师身上，我盗了回去，瞧爹爹怎么说。", 77)
say("萧姑娘倒也是一片孝心。")
dark()
instruct_17(-2,1,18,35,4414*2)
instruct_17(-2,1,18,37,4419*2)
light()
bgtalk("突然之间，对面房中传出当的一声响")
say("当真动手么？",382,0,"林玉龙")
say("那还跟你客气？",380,0,"任飞燕")
bgtalk("但听得乒乒乓乓之声不绝，打的甚是激烈，还夹杂一个婴儿的大声哭叫。对面房中窗格上显出两个黑影，一男一女，两人各执一柄单刀，纵横挥霍，拼命砍杀")
say("大伙别出去，各人戒备，守住镖车，小心歹人的调虎离山之计。",392,0,"周总镖头")
say("这么不要命拼斗，哪里是调虎离山的假打？可惜他不出来瞧瞧，否则倒真是盗刀的良机。", 77)
say("这二人的刀法当真凌厉。")
bgtalk("再瞧那两个黑影时，女的显已力乏，不住倒退，那男的步步紧逼，毫不放松")
say("这恶贼好生无礼，夤夜抢入女子房中，横施强暴，这抱不平岂可不打？", 77)
say("你可莫要冲动，你一出手，不免露了行藏，若是教那些镖师瞧见了，再下手盗刀便不容易。")
say("这....", 77)
say("还是先耐心等待片刻再说，当下不如寻思如何劫那宝刀。")
say("这镖队的人可不少，你我二人怎对付的了？本该连夜赶回晋阳，去跟爹爹谁知，让他调兵遣将。可是倘若我用计将刀盗来，双手捧给爹爹，岂不是更妙？", 77)
say("若是那刀当真宝贵，想来路途中劫刀之人怕是不少，你我可见机行事。")
say("当下也只能如此了。", 77)
bgtalk("或许是因喝了些酒，又或许是因夜深了，少女不知不觉打起了盹，过不多时却是睡着了")
say("当真是初入江湖，阅历太浅，竟如此毫无防范。")
say("今日各位兄弟早些歇息，明日一早便启程。",392,0,"周总镖头")
dark()
instruct_17(-2,1,18,35,0)
instruct_17(-2,1,18,37,0)
light()
bgtalk("静夜之中，忽听得笃，笃，笃，一声一声自远而近的响声，有人以铁杖敲击街上的石板。一路行来，显然是个盲人。")
bgtalk("敲击的声音响到客店之前，曳然而止，接着铁杖便在店门上突.突.突的响了起来，跟着是店小二开门声，呵斥声，一个苍老的声音哀求着要一间店房。")
bgtalk("店小二要他先给钱，老瞎子给了钱，可是还差两吊。于是推拒声祈求声，店小二骂人的污言秽语，一句一句传来。")
dark()
instruct_17(-2,1,24,39,3134*2)
instruct_17(-2,1,22,41,3624*2)
instruct_17(-2,1,11,37,0)
light()
say("喂，小二哥，这钱我给垫了，接着。", 77)
bgtalk("店小二一抬头，只见白光一闪，一块碎银飞了过来，忙伸手去接。他这双手银子是接惯了的，可说百不失一，这般空中飞过来的银子，可是生平头一遭遇上，不免少了习练，噗的一声，那块银子已经打中他的胸口，虽说是银子，打在身上毕竟也有些疼痛，忍不住“啊哟”一声叫了出来。")
say("多谢姑娘好心，但不知恩公高姓大名，我瞎子记在心中，日后也好感恩戴德。", 650)
say("区区小事，何足挂齿。", 77)
dark()
instruct_17(-2,1,24,39,0)
instruct_17(-2,1,22,41,0)
instruct_17(-2,1,11,37,3624*2)
light()
bgtalk("次日清晨")
say("萧姑娘，镖队已经触发，你我需小心跟上才是。")
say("这本姑娘自然知晓，走吧。", 77)
dark()
instruct_17(-2,1,11,37,0)
light()
JY.Person[77]["携带物品1"] = 162
JY.Person[77]["携带物品数量1"] = 1
if instruct_20() then 
say("你的队伍已满，我就回小村等你吧。", 77)
addevent(70,39,1,169,1)
else
instruct_10(77)
end
addHZ(89)
addevent(104,64,1,978,1)
addevent(109,0,0,5054,3)
addevent(109,1,0,5054,3)
end

OEVENTLUA[5054] = function() --衡阳
if inteam(77) then 
dark()
null(-2,0)
null(-2,1)
addevent(-2,4,0,0,0,3618*2)
--addevent(-2,9,0,0,0,3572*2)
--addevent(-2,6,0,0,0,4123*2)
--addevent(-2,10,0,0,0,4123*2)
--addevent(-2,11,0,0,0,4123*2)
addevent(-2,12,0,0,0,4416*2)
addevent(-2,13,0,0,0,4420*2)
light()
instruct_25(43,31,32,31) --场景移动
say("什么人，乱放暗青子？",382,0,"林玉龙")
say("你有暗青子，我便没有么？",380,0,"任飞燕")
dark()
null(-2,12)
null(-2,13)
instruct_17(-2,1,32,32,4415*2)
instruct_17(-2,1,32,30,4418*2)
light()
bgtalk("两人一左一右同时抢上，双刀齐落，架在总镖头颈中")
say("你是什么人？",382,0,"林玉龙")
say("干嘛乱放暗青子？",380,0,"任飞燕")
say("你住口，让我来问他。",382,0,"林玉龙")
say("干嘛要我住口？你闭嘴，我来问。",380,0,"任飞燕")
say("两位不用心急，先放我起来，再慢慢说不迟。",392,0,"周总镖头")
say("干嘛要放你？",382,0,"林玉龙")
say("那是什么？",380,0,"任飞燕")
say("鸳鸯刀！",392,0,"周总镖头")
bgtalk("周威信自从在总督大人手中接过这对鸳鸯刀之后，心中片刻也没有忘记过“鸳鸯刀”三个字，不自禁冲口而出，两人一听，吃了一惊，两只左手齐落，同时往他背上的包袱抓去。")
say("好机会，我们上！", 77)
dark()
instruct_25(32,31,43,31) --场景移动
instruct_17(-2,1,31,31,3624*2)
    instruct_19(31,32);   --  19(13):主角移动至2D-12
    instruct_40(1);   --  40(28):改变主角站立方向1
light()
addthing(217)
say("拿到了，快走！", 77)
dark()
instruct_17(-2,1,30,31,3132*2)
instruct_40(2);
light()
say("啊！", 77)
say("糟了，萧姑娘！")
bgtalk("林任夫妇二人拔刀扑上，那瞎子提鸳鸯刀砍断林任夫妇手中双刀，两人呆了一呆，便被点中大穴，再也动弹不得。")
say("弟子周威信拜见卓师伯！",392,0,"周总镖头")
say("皇上明见万里，早料到这对刀上京时会出乱子。你一离西安，我便跟在镖队后面了。", 650)
say("喂，姓卓的，乖乖的便解开我穴道，咱们好好来斗一场！",382,0,"林玉龙")
say("你趁人不备，出手点穴，算哪一门子的英雄好汉？",380,0,"任飞燕")
say("不论你有多少匪徒，来一个，擒一个，来两个，捉一双，小姑娘，你也随我进京走一遭，去瞧瞧京城的花花世界吧。", 650)
say("快放了我，你再不放，我叫你后悔莫及！", 77)
say("这么说，我更加不能放你，小子，你也乖乖束手就擒吧，将另一把鸳鸯刀交出来。", 650)
say("你若放了他们，我便将这刀交给你！")
say("小子，你若不乖乖的把刀交出来，休怪我不客气了。", 650)
say("（此人武功高强，怕是拼不过，得想个办法才行）姓卓的，我和你拼了！")
say("小子你找死。", 650)
	if WarMain(343) == false then
		instruct_15()
		do return end		
	end
say("师傅，快救我！")	
say("什么！？", 650)
say("快走！")
say("上当了！！", 650)
dark()
instruct_17(109,1,30,31,0)
instruct_17(109,1,32,32,0)
instruct_17(109,1,32,30,0)
instruct_17(109,1,31,31,0)
null(109,4)
instruct_17(63,1,17,17,4414*2)
instruct_17(63,1,18,17,4418*2)
instruct_17(63,1,17,18,3624*2)
My_Enter_SubScene(63,18,19,2)
instruct_40(0);
light()
say("都是你这臭婆娘，咱们若是练成了夫妻刀法，二人合力，又何必怕这老瞎子？",382,0,"林玉龙")
say("练不成夫妻刀法，到底是你不好，还是我不好？那老和尚明明要你就着我点儿，怎地你一练起来便只顾自己？",380,0,"任飞燕")
say("咱们几个眼前是大祸临头，只要那老瞎子一追过来，谁都活不成，你俩还吵什么，到底那夫妻刀法是怎么回事！")
dark()
light()
say("原来如此，萧姑娘，我有一句不知进退的话，原不该说，只是事在危急，此处人人有性命之忧.....")
say("我知道啦，你要我和你学这夫妻....", 77)
bgtalk("说到这里，满脸通红")
say("嗯，在下绝不敢有意冒犯，实是..实是..")
say("大嫂，请你指点与我，若是我和他..都学会了，抵挡得了那老瞎子，便可救得众人性命。", 77)
say("这刀法学起来很难，可非一朝一夕之功。",380,0,"任飞燕")
say("学得多少便是多少，总胜于白白在这里等死。", 77)
say("好，我便教你。",380,0,"任飞燕")
dark()
instruct_35(77,2,62,999)
SetS(99,0,1,0,2)
AddPersonAttrib(0, "耍刀技巧", 50)
if zj() == 0 and putong() == 3 then 
instruct_35(0,2,62,999)
AddPersonAttrib(0, "耍刀技巧", 50)
end
instruct_17(-2,1,20,26,3134*2)
light()
addthing(140)
say("贼小子，你躲到哪去了？", 650)
say("萧姑娘，你快逃走，我来缠住他。")
say("不，咱们合力斗他。", 77)
say("你听我话，快走！若是我今日逃得性命，再和萧姑娘相见。")
say("不成啊...", 77)
	if WarMain(343) == false then
		instruct_15()
		do return end		
	end
	instruct_17(-2,1,20,26,0)
light()
bgtalk("二人灵犀暗通，想起这路夫妻刀法每一招都有个风光旖旎的名字，不自禁的又惊又喜，夫妻刀法的配合更加紧了，使到第九招“碧箫声里双凤鸣”是，双刀便如凤舞鸾翔，灵动翻飞，卓天雄哪里招架的住？")
bgtalk("“啊”的一声，肩头中刀，鲜血并流，他自知难敌，再打下去定要将这条老命送在这里，铁棒急封，纵身出墙而逃。二人脉脉相对，情愫暗生，一时不知说什么好")
say("妙极，妙极！女貌郎才珠万斛！",382,0,"林玉龙")
say("啊！",77)
bgtalk("满面通红的跑了出去")
say("萧姑娘！")
dark()
instruct_17(63,1,17,18,0)
light()
instruct_21(77)
say("鸳鸯刀！",382,0,"林玉龙")
say("两位且慢！")
say("小子，虽说你们败退了姓卓的，但是鸳鸯刀我夫妇二人势在必得！",382,0,"林玉龙")
say("小子，不想死便让开！",380,0,"任飞燕")
say("两位稍安勿躁，如果在下猜的不差，想必二位劫刀，是为了萧大侠吧！")
say("你如何知晓！",380,0,"任飞燕")
say("前些时日，在下正巧便在萧大侠府上，二位可知那位姑娘是谁？")
say("自然不晓得！",382,0,"林玉龙")
say("她便是萧大侠的千金。")
say("当真没有骗我们？",380,0,"任飞燕")
say("萧姑娘拿到鸳鸯刀，自会回去，二位可去萧大侠府上一问便知。")
say("小子，你可莫要骗我夫妇！",382,0,"林玉龙")
say("在下不敢有半点虚言。")
say("如此，我们夫妇先告辞了，日后有缘再见！",382,0,"林玉龙")
dark()
instruct_17(63,1,17,17,0)
instruct_17(63,1,18,17,0)
light()
instruct_3(111, 16, 0, 0, 0, 0, 5055, 0, 0, 0, -2, 11, 34) --箫半和
instruct_3(111, 17, 0, 0, 0, 0, 0, 3624*2, 3624*2, 3624*2, -2, 8, 39) --箫半和
end
end

OEVENTLUA[5055] = function() --衡阳
null(-2,16)
instruct_30(11,34,11,38)
instruct_40(2)
say("晚辈拜见萧大侠。")
say("哈哈哈，少侠客气了，我这女儿*一定给你添了不少麻烦吧？。",189)
say("什么添麻烦，是我帮了他的*大忙才对！",77)
say("是是是，令嫒天资聪颖，身*手不凡，的确帮了我不少忙*。")
say("哈哈哈，少侠就不用如此夸她，我女儿我岂能不知？",189)
say("爹爹，哪有你这么说女儿的？",77)
say("我这女儿这些时日，茶不思饭不想，对少侠很是挂念啊。",189)
say("啊！爹爹，休要胡说，女儿哪有。",77)
say("能得萧姑娘的挂念，是晚辈的福分。")
say("哼，就你会说话。",77)
say("不知少侠可婚配？",189)
say("未曾。")
say("那好，慧儿此番回来对你念念不忘，我若将我女儿许配给你，你可愿意？",189)
say("啊！！")
say("怎么，少侠可是看不上我女儿？",189)
say("晚辈自是欣喜万分，只是不知萧姑..萧妹如何作想？")
say("全..全凭爹爹做主。",77)
say("哈哈哈，如此我便寻个良辰吉日为你们操办婚事。",189)
say("多谢萧大侠。")
say("这时候还叫萧大侠么？",189)
say("多谢岳丈大人。")
say("哈哈哈，好好好，慧儿还不带你心上人去逛逛？",189)
say("爹爹，讨厌。",77)
    if GetS(113,0,0,0) == 0 then 
	    say("贤婿！这套夫妻刀法你要好好参详。",189) 
	    instruct_0();
		if instruct_11(0,188) == true then 
	        QZXS("领悟夫妻刀法！")
	        instruct_0();
	        setLW1(62)
		else
			say("如此，罢了。",189) 
		end	
	end
dark()
null(-2,17)
teammate(77)
setJX(77)
JY.Person[77]["耍刀技巧"] = JY.Person[77]["耍刀技巧"] + 200
light()
addevent(-2,15,1,5056,1)
instruct_3(111, 16, 0, 0, 0, 0, 5057, 0, 0, 0, -2, 12, 16) --箫半和
instruct_3(111, 19, 0, 0, 0, 0, 5057, 0, 0, 0, -2, 13, 16) --箫半和
end

OEVENTLUA[5056] = function() --衡阳
say("贤婿可莫要欺负我那宝贝女儿。",189)
say("定不辜负萧妹。")
end

OEVENTLUA[5057] = function() --衡阳
if inteam(77) then 
dark()
null(-2,16)
null(-2,19)
instruct_3(111, 20, 0, 0, 0, 0, 0, 3133*2, 3133*2, 3133*2, -2, 12, 15) --箫半和
light()
say("贼小子，这次看你往哪跑。", 650)
say("姓卓的，你还敢来，萧妹，清风引佩下瑶台。")
say("贼小子，这次老瞎子可不是一人前来。", 650)
	if WarMain(344) == false then
		instruct_15()
		do return end		
	end
null(-2,20)	
light()
say("又让他跑了，没想到这把鸯刀是假的，定是让他掉包了。")
say("我们先回去吧。",77)
say("嗯，通知岳丈大人，以防万一。")
addevent(-2,15,1,5058,1)
end
end

OEVENTLUA[5058] = function() --衡阳
say("岳丈大人，那卓天雄带人埋伏我和萧妹，已被我俩打退。")
say("可惜了这把鸯刀却是假的。",77)
say("鸳鸯刀乃是我故人之物，我本想寻回此物，以祭奠故人在天之灵，如今怕是不成了。",189)
say("太岳四侠拜见萧老英雄。",651)
dark()
instruct_17(-2,1,12,37,3186*2)
instruct_17(-2,1,12,38,3186*2)
instruct_17(-2,1,12,39,3186*2)
instruct_17(-2,1,12,40,3186*2)
instruct_17(-2,1,11,38,2577*2)
instruct_3(111, 17, 0, 0, 0, 0, 0, 3624*2, 3624*2, 3624*2, -2, 8, 39) --箫半和
instruct_40(1)
light()
say("太岳四侠，你们抬得是什么宝贝啊。",77)
say("少侠，萧姑娘，咱四兄弟到那污泥河中去捉碧血金蝉，想给两位送一份大礼。哪只金蝉还没抓到，一个人闯将过来，这人腿上受了伤，口中哼哼唧唧，行路一跛一拐。太岳四侠一瞧，嘿，这不是卓天雄么？咱们悄悄的给他兜头渔网一罩，将他老人家给拿了来了。",654)
bgtalk("伸手从卓天雄腰间一摸，抽出一把短刀来，精光耀眼，污泥不染，自是真的鸯刀")
say("满清皇帝听说这双刃中，有一个能无敌于天下的大秘密，这果然不错，可是他便知道了这个秘密，又能如何？",189)
bgtalk("只见鸳刀的刀刃上刻着“仁者”，鸯刀的刀刃上刻着“无敌”两字")
say("唉，如今我如愿以偿，贤婿，这本书就送与你了。",189)
say("多谢岳丈大人。")
say("太岳四侠先行告辞。",651)
dark()
instruct_17(-2,1,12,37,0)
instruct_17(-2,1,12,38,0)
instruct_17(-2,1,12,39,0)
instruct_17(-2,1,12,40,0)
instruct_17(-2,1,11,38,0)
light()
addthing(218)
addthing(157)
addthing(250,2)
say("岳丈大人，我也要继续去寻找天书了。")
say("我陪你一起去。",77)
say("哈哈哈，你们年轻人的事，自己决定吧。",189)
dark()
null(-2,17)
null(-2,15)
light()
end

--5059用了

OEVENTLUA[6001] = function()
    My_Enter_SubScene(114,14,33,1)
end

OEVENTLUA[6002] = function() --不老长春谷
    instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2); 
	instruct_3(-2,114,0,0,0,0,0,0,0,0,-2,-2,-2); 
end

OEVENTLUA[6003] = function() --不老长春谷
    My_Enter_SubScene(41,15,30,1)
end

OEVENTLUA[6004] = function() --不老长春谷
instruct_3(-2,-2,1,0,0,0,0,5132,5132,5132,-2,-2,-2)  --修改场景事件
instruct_2(8, 1)  --得到或失去天王保命丹
instruct_2(13, 1)  --得到或失去玉灵散
say("前辈您好！晚辈有礼了！", 0) 
say("嗯，好好好！", 618)
say("敢问前辈，这是何处？", 0)
say("哈哈哈哈，小娃娃运气不错啊，不老长春谷不是谁都进得来的！", 618)
say("不老长春谷？我听南贤北丑提及过。", 0)
say("小娃娃好自大，南贤北丑这样的武林圣人不是谁都能见的？", 618)
say("不敢欺瞒前辈，晚辈自小就是两人老人养大的。", 0, 0)  
say("原来你就是当年襁褓中的小婴孩，都那么大了！", 618) 
say("怎么样？南贤北丑两位还好吗？", 618) 
say("前辈有心了，两位老人吃得好、睡得好。", 0)
say("哈哈哈哈！", 618)
say("既然你我今天能在这里相见也是缘分，作为长辈我考考你的武功。", 618) 
say("请前辈赐教！", 0) 
say("这次我就不出手了，我那几个不成材的徒弟到可以来考考你！", 618)
say("谢前辈提点！", 0)  --对话
    if WarMain(377, 0) == false then  --战斗开始
	   --instruct_3(-2,-2,1,0,0,0,0,2608,2608,2608,0,-2,-2)  --修改场景事件
	   instruct_13()  --场景变亮
	   say("小娃娃还需磨练磨练。", 618) 
	   say("多谢前辈承让。", 0) 
	   say("小娃娃不要气馁，先送你点小东西。", 618)
	   addthing(256)
	   addthing(257)
	   addthing(258)
	    if GetS(111, 0, 0, 0) == 0 then  
	        say("这西毒的蛤蟆功你拿去，日后行走江湖方便些！",618)		
	        instruct_0();
	        if instruct_11(0,188) == true then 
	            QZXS("领悟蛤蟆功！")
		        instruct_0();
	            say("多谢老前辈",0)
	            SetS(111, 0, 0, 0,95)
		        addthing(73)
	        else
	            say("有志气！这本东邪黄药师的碧海潮生曲，拿去吧！",618) 
	            addthing(107)
	        end	
	    end
say("多谢前辈，晚辈还不知前辈姓谁名谁？", 0)
say("名讳就不用提及了，如果你遇上丁春秋就顺手把他除掉吧，为武林除一害", 618)
say("晚辈明白", 0)	
say("好好好，问两位老人好！", 618)
say("前辈保重！", 0)
	do return end  --无条件结束事件
    else
	   instruct_13()  --场景变亮
	    say("不错！不错！",618)   --对话
	    say("这几本秘籍你就拿去吧！",618)   --对话
		    addthing(69)
		    addthing(81)
		    addthing(82)
	    say("哇！狮子吼、逆运真经、龙象般若功，多谢老前辈！",0)
        if GetS(111, 0, 0, 0) == 0 then  
	          say("小娃娃接下来得看好了！",618)		
	            instruct_0();
	        if instruct_11(0,188) == true then 
	            QZXS("领悟小无相功！")
		        instruct_0();
				addthing(75)
	            say("多谢前辈",0)
	            SetS(111, 0, 0, 0,98)
		        instruct_35(0,2,98,0)
                instruct_35(0,2,98,0)
				addthing(75)
	        else
		        say("有志气！再传你点拳脚功夫！",618) 
	            for i=1, CC.TeamNum do
	                if JY.Base["队伍"..i] >= 0 then
	                   AddPersonAttrib(JY.Base["队伍"..i], "拳掌功夫", 20)
	                   AddPersonAttrib(JY.Base["队伍"..i], "御剑能力", 20)
	                   AddPersonAttrib(JY.Base["队伍"..i], "耍刀技巧", 20)
	                   AddPersonAttrib(JY.Base["队伍"..i], "特殊兵器", 20)
	                   AddPersonAttrib(JY.Base["队伍"..i], "暗器技巧", 20)
				end
            end
		    QZXS("全体队友五系兵器值增加20点");
	    end	
    end
	if GetS(113,0,0,0) == 0 then 
	    say("在传授你些透骨打穴的手法，以后方便行走江湖。",618) 
	    instruct_0();
	    if instruct_11(0,188) == true then 
	        QZXS("领悟生死符！")
			say("多谢前辈",0)
	        instruct_0();
	        setLW1(176)
			addthing(336)
		else
			say("哈哈哈哈！",618) 
	end	
end
say("多谢前辈，晚辈还不知前辈姓谁名谁？", 0)
say("名讳就不用提及了，如果你遇上丁春秋就顺手把他除掉吧，为武林除一害", 618)
say("晚辈明白", 0)
say("好好好，问两位老人好！", 618) 
say("前辈保重！", 0)  --对话
	end	
end

OEVENTLUA[6005] = function() --天龙寺
say("请少侠相救段氏子孙！", 470)
say("段公子已被鸠摩智抓走，但是那蕃僧武功高强段公子恐难救出。", 0)
say("少侠只需要帮忙传信，自会有人相救。", 470)
say("好的。", 0)
say("少侠请把这封书信送到不老长春谷，交给高僧他自会搭救。", 470)
addthing(342,1)
say("大师，不老长春谷在何处？", 0)
say("无量山附近。", 470)
say("知道了，大师放心，书信一定会交到高僧手中。", 0)
say("有劳少侠！", 470)
instruct_3(114,0,1,0,0,6006,0,6152,6152,6152,-2,-2,-2)	
end

OEVENTLUA[6006] = function() --不老长春谷
	addthing(342,-1)
	if hasthing(147) then
		say("大师就是段公子口中的段氏高人？", 0)
		say("老衲不敢当。但感谢少侠相助段氏子弟！", 602)
		say("也感谢少侠先前未因此事而来迫使老衲干涉红尘", 602)
		say("为报少侠之恩，老衲就将此书赠与少侠吧", 602)
		if DrawStrBoxYesNo(-1, -1, "是否收下秘籍？", C_WHITE, 30) == true then
			say("这是「龙行虎步」？但却与段公子给我的不甚相像...？", 0)
			say("此乃老衲加以修补过的身法，想来对少侠是有助益的", 602)
			QZXS("领悟龙行虎步身法！")
			setLW2(199)
			addthing(359)
			say("多谢大师！", 0)
			say("阿弥陀佛！", 602)
		else
			say("段公子脱困也非我一人之功", 0)
			say("在下就「无功不受禄」了", 0)
			say("也罢！缘分未至，不得强求", 602)
		end	
	else
		say("辛苦少侠送信！", 602)
		say("大师，信已送到请赶快相救段公子！", 0)
		say("老僧已是方外之人，红尘之事不在过问。", 602)
		say("但是段公子被鸠摩智擒去并扬言要在慕容博坟前火花，大师若不出手相救，恐怕！！！", 0)
		say("这样吧，老僧传你一些拳脚功夫，这样你就能抵挡鸠摩智了。", 602)
		say("大师我还没说要救人呢。", 0)
		say("少侠宅心仁厚，不会见死不救的！", 602)
		say("这.........", 0)
		say("少侠看好了！", 602)
		if WarMain(378, 0) == false then  --战斗开始
			instruct_13()  --场景变亮
			say("多谢前辈指点。", 0) 
			if GetS(113,0,0,0) == 0 then 
				instruct_0();
				if instruct_11(0,188) == true then 
					QZXS("领悟一阳指！")
					instruct_0();
					setLW1(17)
					addthing(96)
				else
					say("阿弥陀佛",602) 
				end	
			end
				do return end  --无条件结束事件
		else
			instruct_13()  --场景变亮
			if GetS(111, 0, 0, 0) == 0 then  
				say("少侠短时间就学会这套功夫，真是天赋异禀！",602)		
				instruct_0();
				if instruct_11(0,188) == true then 
					QZXS("领悟天南易阳诀！")
					instruct_0();
					say("多谢前辈",0)
					SetS(111, 0, 0, 0,152)
					addthing(289)
				else
					say("阿弥陀佛！",602) 
				end	
			end
			if GetS(113,0,0,0) == 0 then 
				say("这套功夫你也一并传你，方便对付鸠摩智！",602) 
				instruct_0();
				if instruct_11(0,188) == true then 
					QZXS("领悟六脉神剑！")
					say("多谢前辈",0)
					instruct_0();
					setLW1(49)
					addthing(113)         --获得六脉神剑剑谱   
				else
					say("阿弥陀佛！",602) 
				end	
			end
		end	
		say("誉儿就有劳少侠了！",602)
		say("晚辈一定救出段公子的！",0)
	end	
end

OEVENTLUA[1005] = function()
	instruct_3(-2,-2,1,0,0,0,0,2606,2606,2606,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	--   instruct_2(341, 1)  --得到或失去物品
	Cls()  --清屏
	if MPPD(0) == 4 then
		do return end
	else
		say("这是...玄...武...真...功！", 0)
		say("十强武者托老朽保管的书居然被小友找到了。", 5) 
		say("三哥，既然被找到了说不定他就是有缘之人。", 455)
		say("大概吧。", 5) 
		say("不如我们兄弟俩试他一试看看他是否真的有缘，如若胜利就把书拿走。", 455) 
		say("好，试小友一试。", 5)  
		say("老夫也来凑个热闹。", 599)  
		say("原来是黄先生，一起吧。", 455) 
		say("我也来活动活动筋骨。", 599)  
		say("哈哈哈哈，乔某也想来凑一凑这个热闹，几位可愿意？", 50)
		say("原来是乔大侠！", 455)
		say("呵呵，我和黄先生一样也来凑个热闹", 50)
		say("无妨，无妨！", 455)
		say("那就一起吧，小友可要小心了", 5)
		say(".....<作者那小子肯定是故意的！>", 0)
		if WarMain(365, 0) == false then  --战斗开始
			instruct_3(-2,-2,1,0,0,0,0,2608,2608,2608,0,-2,-2)  --修改场景事件
			say("小友乃无缘之人，回去吧。", 5)
			say("......................", 0)
			--instruct_2(341, -1)  --得到或失去物品
			do return end  --无条件结束事件
		else
			instruct_13()  --场景变亮
			say("不错不错，小友与这套武学总算是有点缘分。", 5) 
			addthing(341)
			addHZ(35) 	
			say("老朽在送你点东西。", 5)
			addthing(8, 10)
			addthing(256)
			addthing(257)
			addthing(258)
			say("既然三哥如此大方，我也不吝啬。", 455)
			addthing(345)
			addHZ(88)
			say("这部九阴真经拿去吧，今后你行走江湖会对你有帮助。", 599)
			addthing(84)
			say("这套擒龙功和降龙掌法虽没有玄武真功精妙，拿去后自会有用。", 50)
			addthing(86)
			addthing(338)
			say("多谢各位前辈。", 0)
			say("小兄弟切莫高兴，此书年份已经久远 ，精要部分已残缺。", 455)
			say("多谢前辈提醒。<作者小子你给我记住了！>", 0)
			say("传音入密：<其实，是我故意撕掉的，呵呵！>", 455)
			say("传音入密：<四弟，不厚道啊！！！>", 5)
			say("传音入密：<我同意无酒兄弟的做法。>", 50)
			say("传音入密：<我也同意。>", 599)
			say("传音入密：<既然二位有此想法，老朽也作罢。>", 5)
			say("传音入密：<嘿嘿！>", 455)
			if GetS(113,0,0,0) == 0 and MPPD(0) == 0 and PersonKFJ(0, 1) and PersonKFJ(0, 27) and PersonKFJ(0, 50) and PersonKFJ(0, 68) then 
				Cls()  --清屏
				instruct_13()  --场景变亮
				say("我这一路行来，既无精深武学傍身，亦无师门护佑",0) 
				say("竟以弱胜强，击败这等顶尖高手，实属不易，是否应该将所学武学为根基，走出自己的路？",0)
				instruct_0();
				if instruct_11(0,188) == true then 
					QZXS("领悟草头百姓！")
					setLW1(996)
				else
					say("也罢，再另寻其他机缘吧",0) 
				end	
			end	
			do return end
		end
	end
end

OEVENTLUA[716] = function()
	instruct_3(-2,-2,1,0,0,0,0,2610,2610,2610,-2,-2,-2)  --修改场景事件
	--instruct_2(85, 1)  --得到或失去物品
	if MPPD(0) == 5 then
		say("身为少林弟子，竟还想著要偷本门的东西么？", 114)
		say("（这老僧是谁？气息渊停岳滞，比空闻师父还深不可测...）", 0)
		say("这位...师伯抱歉了，天书使命沉重，我不得已...", 0)
		say("唉...但内中毕竟是本门宝物，不能随意给你。", 114)
		say("这样吧，这宝箱内的东西不能动，但贫僧与你过两招，指点与你，如何？", 114)
		say("...多谢师伯！", 0)
		setJX(114)
		SetS(106, 63, 1, 0, 0)
		SetS(106, 63, 2, 0, 114)
		if WarMain(288) == false then
			light()
			say("阿弥陀佛！", 114)
			say("（好可怕的武功造诣...），多谢师伯指点！", 0)
			QZXS("武学常识上升！")
			QZXS("全系数上升！")
			AddPersonAttrib(zj(), "武学常识", 30)
			AddPersonAttrib(zj(), "拳掌功夫", 150)
			AddPersonAttrib(zj(), "御剑能力", 150)
			AddPersonAttrib(zj(), "耍刀技巧", 150)
			AddPersonAttrib(zj(), "特殊兵器", 150)
			AddPersonAttrib(zj(), "暗器技巧", 150)
			say("善哉！那么贫僧就先告辞了，这些宝物也得另寻他处存放", 114)
			dark()
			null(-2,17)
			setJX(114,-2)
			light()
			say("唉...真是可惜！", 0)
			do return end
		else
			light()
			say("小村传人好功夫！", 114)
			say("师伯莫要这么说，弟子更是蒙少林教导不少！", 0)
			say("也罢。该是履行承诺了", 114)
			say("我派神功不少，但若论镇派的内功，你可知为何？", 114)
			say("自是易筋、洗髓二功！", 0)
			say("哈，不错。贫僧今日就与你说说这「洗髓经」", 114)
			dark()
			light()
			QZXS("领悟洗髓经！")
			SetS(111,0,0,0,183)
			say("多谢师伯！", 0)
			say("善哉！这些宝物，贫僧也需另寻他处存放，但其中这本秘籍也与你防身吧", 114)
			addthing(171)
			say("希望你接下来行走江湖，莫忘慈悲本心", 114)
			say("是，多谢师伯！", 0)
			dark()
			null(-2,17)
			setJX(114,-2)
			light()
			do return end
		end
	else
		say("阿弥陀佛！", 70)
		say("什么人？", 0)
		say("施主，那些东西属于少林寺，老衲有权利保护少林的东西。", 70) 
		say("对不起了方丈！", 0) 
		say("阿弥陀佛", 114)
		say("大和尚，这里不是你来的地方，劝你走开！", 0)
		say("方丈刚才说了这是少林的东西，劝施主还是放弃吧！", 114) 
		say("既然如此我只有得罪了！", 0)  
		say("阿弥陀佛。", 615)
		say("如果施主能挡住我们几人，东西你就全部拿去吧。", 615) 
		say("一切都听师祖的。", 70) 
		say("得罪了。", 0, 0)
		if WarMain(223, 0) == false then  --战斗开始
			instruct_3(-2,-2,1,0,0,0,0,2612,2612,2612,0,-2,-2)  --修改场景事件
			instruct_13()  --场景变亮
			say("施主打了来回哪去吧。", 114)  --对话
			say("......................", 0)  --对话
			--instruct_2(85, -1)  --得到或失去物品
			do return end  --无条件结束事件
		else
			instruct_13()  --场景变亮
			say("少侠好功夫。", 114, 0) 
			say("不亏是小村传人，这些东西你就拿去吧，希望你能用它们造福武林！", 615, 0)
			addthing(69)
			addthing(72)
			addthing(92)
			addthing(90)
			addthing(137)
			addthing(171)
			addthing(168)
			addthing(273)
			addthing(276)
			addthing(280)
			addthing(288)
			addthing(62)
			addthing(13, 10)
			addHZ(114)
			TalkEx("多谢各位神僧！", 0, 0)  --对话
			if PersonKF(0, 183) and GetS(111,0,0,0) == 0 and JY.Person[0]["品德"] >= 90 then
				say("少侠虽已习得洗髓经，但未完全掌握，老和尚指导一番如何？",615) 
				say("达摩祖师，请！",0) 
				QZXS("领悟洗髓经！")
				instruct_0();
				SetS(111, 0, 0, 0, 183)
			end	
			do return end
		end
	end
end

OEVENTLUA[212] = function()
instruct_3(-2,-2,1,0,0,0,0,7048,7048,7048,-2,-2,-2)  --修改场景事件
Cls()  --清屏
say("这就是当年剑魔独孤求败打遍天下无敌手所留下来的玄铁重剑！！", 0)
say("嘎~~~嘎~~~嘎~~~", 607)
say("雕兄要我拿起这把剑吗？", 0)
instruct_2(36, 1)  --得到玄铁剑
say("终於让我拿起来了！！", 0)
say("嘎~~~嘎~~~嘎~~~", 607)
say("雕兄，这柄剑感觉除了沉重之外也没有什么特别之处！", 0)
instruct_0();
if GetS(111, 0, 0, 0) == 0 then
	say("这是！幻象？？？",0) 
	SetS(106, 63, 1, 0, 0)
    SetS(106, 63, 2, 0, 592)
	if WarMain(288) == false then
	    instruct_13()  --场景变亮
		say("真是可惜",0) 
	else
		say("有幸见识到独孤前辈的武学真是人生一大快事！",0) 
	    QZXS("领悟独孤真传！")
	    instruct_0();
	    SetS(111, 0, 0, 0, 592)
	end
end
instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,-2,-2)  --修改场景事件
--instruct_2(116,1)  --得到玄铁剑法
	do return end
end

OEVENTLUA[6007] = function() --剑冢
    My_Enter_SubScene(115,53,36,1)
end

OEVENTLUA[6008] = function() --剑冢
    instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2); 
	instruct_3(-2,115,0,0,0,0,0,0,0,0,-2,-2,-2); 
end

OEVENTLUA[6009] = function() --剑冢
    My_Enter_SubScene(7,30,8,1)
end

OEVENTLUA[6010] = function() --剑冢
instruct_3(-2,-2,1,0,0,0,0,9282,9282,9282,-2,-2,-2)  --修改场景事件
Cls()  --清屏
say("剑魔独孤求败既无敌于天下，乃埋剑于斯！", 592)
say("呜呼！群雄束手，长剑空利，不亦悲夫！", 592)
say("年轻人，后面的每把剑代表剑魔的一段故事！！！", 592)
say("好好参悟吧！", 592)
say("............我什么都还没说呢。", 0)
say("那么你就是独孤求败前辈吗？", 0)
say("不是，我只是剑魔当初留下的精神体。", 592)
say("............不懂。", 0)
say("剑魔已经飘然远去，这里只留下他的传说和故事。", 592)
say("说不定有宝藏，嘿嘿！", 0)
say("年轻人，小心点。", 592)
say(".............？？？？？", 0)
say("稍后你就知道了。", 592)
end

OEVENTLUA[6011] = function() --利剑
instruct_3(-2,-2,1,0,0,0,0,7048,7048,7048,-2,-2,-2)  --修改场景事件
Cls()  --清屏
say("凌厉刚猛，无坚不摧，弱冠前以之与河朔群雄争锋。", 0)
instruct_0();
	if WarMain(380) == false then
	    instruct_13()  --场景变亮
		say("真是可惜。",0) 
	else
		say("凌厉刚猛，无坚不摧，原来指的是这样！",0) 
		addthing(8,10)
		addthing(256,3)
	    addthing(257,3)
	    addthing(258,3)
		AddPersonAttrib(0, "攻击力", 200)
        QZXS("攻击力增加200")
		AddPersonAttrib(0, "内力最大值", 2000)
        QZXS("内力最大值增加2000")
	end
	do return end
end

OEVENTLUA[6012] = function() --软剑
instruct_3(-2,-2,1,0,0,0,0,7048,7048,7048,-2,-2,-2)  --修改场景事件
Cls()  --清屏
say("紫薇软剑，三十岁前所用，误伤义士不祥，乃弃之深谷。", 0)
instruct_0();
	if WarMain(381) == false then
	    instruct_13()  --场景变亮
		say("真是可惜。",0) 
	else
		say("软剑之境果然是另一番天地！",0) 
		AddPersonAttrib(0, "御剑能力", 200)
        QZXS("御剑能力增加200")
		addthing(25, 10)
	    addHZ(2)
		addHZ(7)
		addHZ(16)
		addHZ(31)
		addHZ(38)
		addHZ(40)
		addHZ(52)
		addHZ(105)
		addHZ(106)
	end
	do return end
end

OEVENTLUA[6013] = function() --重剑
instruct_3(-2,-2,1,0,0,0,0,7048,7048,7048,-2,-2,-2)  --修改场景事件
Cls()  --清屏
say("重剑无锋，大巧不工。四十岁前恃之横行天下。", 0)
instruct_0();
if GetS(113, 0, 0, 0) == 0 then
	if WarMain(382) == false then
	    instruct_13()  --场景变亮
		say("真是可惜",0) 
	else
		say("这就是重剑无锋，大巧不工的奥义！",0) 
	    QZXS("领悟玄铁剑法！")
	    instruct_0();
	    SetS(113, 0, 0, 0, 45)
		instruct_2(116,1)  --得到玄铁剑法
	end
end
	do return end
end

OEVENTLUA[6014] = function() --木剑
instruct_3(-2,-2,1,0,0,0,0,7048,7048,7048,-2,-2,-2)  --修改场景事件
Cls()  --清屏
say("四十岁後，不滞於物，草木竹石均可为剑。", 0)
instruct_0();
if GetS(111, 0, 0, 0) == 0 then
	if WarMain(383) == false then
	    instruct_13()  --场景变亮
		say("真是可惜",0) 
	else
		say("这就是飞花摘叶，皆可伤敌的奥义！",0) 
	    QZXS("领悟怒海剑涛！")
	    instruct_0();
	    SetS(111, 0, 0, 0, 203)
		instruct_2(362,1)  --得到怒海剑涛
	end
end
	do return end
end

OEVENTLUA[6015] = function()
instruct_3(-2,-2,1,0,0,0,0,7048,7048,7048,-2,-2,-2)  --修改场景事件
Cls()  --清屏
say("自此精修，渐进於无剑胜有剑之境。", 0)
instruct_0();
if GetS(111, 0, 0, 0) == 0 then
	if WarMain(384) == false then
	    instruct_13()  --场景变亮
		say("真是可惜",0) 
	else
		say("无剑之境果然博大精深！",0) 
	    QZXS("领悟独孤真传！")
	    instruct_0();
	    SetS(111, 0, 0, 0, 592)
		AddPersonAttrib(0, "御剑能力", 300)
        QZXS("御剑能力增加300")
		instruct_2(114,1)  --得到独孤九剑
	end
end
	do return end
end

OEVENTLUA[6016] = function()
instruct_2(77,-1)
instruct_2(84,-1)
say("这位前辈，请把东西还给我。", 0)
say("能来到这里，看来你就是那个有缘人。", 599)
say("前辈怎么知道？难道您就是......？", 0)
say("既然你有缘来到这里，让我来考考你。", 599)
say("请前辈指点。", 0)
instruct_0();
if GetS(111, 0, 0, 0) == 0 then
	if WarMain(385) == false then
	    instruct_13()  --场景变亮
		say("还需要历练。", 599)
		say(".......",0) 
		instruct_2(77,1)
	else
		say("宝典内容如此博大精深，多谢前辈！",0) 
		say("去吧，好好善用宝典！",599) 
	    QZXS("领悟九阴真经！")
	    instruct_0();
	    SetS(111, 0, 0, 0, 107)
		instruct_2(77,1)
        instruct_2(84,1)
	end
end
	do return end
end

OEVENTLUA[6017] = function() --不老长春谷欢总
instruct_3(-2,-2,1,0,0,0,0,9284,9284,9284,-2,-2,-2)  --修改场景事件
Cls()  --清屏
say("少年，你想到山顶就必须接受考验。", 455)
say("明白了，前辈请进招。", 0)
say("好，小心了！", 455)
if WarMain(385) == false then
	instruct_13()  --场景变亮
	say("回去吧！",455) 
	say("..........",0) 
else
    say("多谢前辈手下留情。",0) 
	say("不错不错，接下来就看你是否有能力通过三哥考验了。",455) 
	say("前辈您这是？？？",0) 
	say("我来帮你打通经脉，这些丹药是给你的。",455) 
	say("再次感谢前辈。",0) 
	instruct_0();
	AddPersonAttrib(0, "拳掌功夫", 999)
	AddPersonAttrib(0, "御剑能力", 999)
	AddPersonAttrib(0, "耍刀技巧", 999)
	AddPersonAttrib(0, "特殊兵器", 999)
	AddPersonAttrib(0, "暗器技巧", 999)
    QZXS("全系能力增加999")
	instruct_2(8,20)  --天王保命丹
	instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,-2,-2)  --修改场景事件
end
end

OEVENTLUA[6018] = function() --不老长春谷山顶
    My_Enter_SubScene(116,54,25,1)
end

OEVENTLUA[6019] = function() --不老长春谷山顶
    instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2); 
	instruct_3(-2,116,0,0,0,0,0,0,0,0,-2,-2,-2); 
end

OEVENTLUA[6020] = function() --不老长春谷山顶
    My_Enter_SubScene(114,49,14,1)
end

OEVENTLUA[6021] = function() --不老长春谷山顶
instruct_3(-2,-2,1,0,0,0,0,5380,5380,5380,-2,-2,-2)  --修改场景事件
Cls()  --清屏
say("小友，你终于来了！", 5)
say("张真人知道晚辈要来？？？", 0)
say("呵呵，小友既然有能力来到这里，我们就在考考你。", 5)
say("我们？？？？？？", 0)
say("少侠，你忘了老和尚了吗？", 615)
say("达摩祖师！", 0)
say("哈哈！少侠小心了", 615)
say("能得到两位前辈的考验，这是我的荣誉。", 0)
if WarMain(386) == false then
	instruct_13()  --场景变亮
	say("还差点火候，小友下次努力吧。",5) 
	say("多谢两位前辈的指点",0) 
else
    say("多谢两位前辈手下留情。",0) 
	say("我们老了，哈哈哈！",615) 
	say("小友，不错不错！",0) 
	instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,-2,-2)  --修改场景事件
end
end

OEVENTLUA[6022] = function() --不老长春谷山顶
instruct_3(-2,-2,1,0,0,0,0,5118,5118,5118,-2,-2,-2)  --修改场景事件
Cls()  --清屏
say("能走到这里，辛苦了。", 585)
say("你是？", 0)
say("很显然，我是一名店小二。", 585)
say("所以呢？", 0)
say(".........我能帮你合成一次内功。", 585)
say(".........你用的着那么直白吗？", 0)
say("时间紧迫，长话短说而已", 585)
say("那么，肯定有代价！", 0)
say("聪明！", 585)
say("我打赢你就帮我合成是吗？", 0)
say("不不不！", 585)
say("..........", 0)
say("少年你想得太简单了。", 585)
say("要怎么打？直接说。", 0)
say("你听过神州三绝吗？", 585)
say("没有", 0)
say(".........", 585)
say("哎呀，不管怎么样，我来到这里了就不能空手而回。", 0)
say("那么，骚年你小心了！", 585)
say("来呀，谁怕谁！", 0)
say("好，让你看看我们新旧三绝！", 585)
if WarMain(387) == false then
	instruct_13()  --场景变亮
	say("骚年，看来你还是空手而回了",585) 
	say("..........",0) 
else
    say("我还是挺厉害的。",0) 
	say("不错不错，骚年看好了！",585) 
	instruct_0();
    local menu
	local WGid
	Cls();
	DrawStrBox(CC.MainSubMenuX, CC.MainSubMenuY,"选择融合功体", C_WHITE, CC.DefaultFont);
	menu = {};
	for i = 1, HHH_GAME_SETTING["WG_COUNT_MAX"] do
		WGid = JY.Person[0]["武功"..i];
		if yongnei(WGid, 0) and WGid ~= 91 then	---显示内功
		   menu[#menu + 1] = {JY.Wugong[WGid]["名称"],nil,1,WGid};
		end
	end
	local r = ShowMenu(menu,#menu,0,CC.MainSubMenuX,CC.MainSubMenuY+CC.SingleLineHeight,0,0,1,1,CC.DefaultFont,C_ORANGE,C_WHITE);
	if r <= 0 then
		return 0
	end	

	JY.Thing[224]["加攻击力"] = menu[r][4] --设置功体
	local a = 0
	for i = 1,HHH_GAME_SETTING["WG_COUNT_MAX"] do 
	   if JY.Person[0]["武功"..i] == JY.Thing[224]["加攻击力"] then 
	     -- JY.Person[0]["武功"..i] = JY.Person[0]["武功"..i+1]
		 a=i
	   end
	end
		Cls()
		DrawStrBox(CC.MainSubMenuX, CC.MainSubMenuY,"选择融合功体", C_WHITE, CC.DefaultFont);
		menu = {};
		for i = 1, HHH_GAME_SETTING["WG_COUNT_MAX"] do
			WGid = JY.Person[0]["武功"..i];
			if yongnei(WGid, 0) and WGid ~= 91 and WGid ~= JY.Thing[224]["加攻击力"] then	---显示内功
			   menu[#menu + 1] = {JY.Wugong[WGid]["名称"],nil,1,WGid};
			end
		end	
		local r = ShowMenu(menu,#menu,0,CC.MainSubMenuX,CC.MainSubMenuY+CC.SingleLineHeight,0,0,1,1,CC.DefaultFont,C_ORANGE,C_WHITE);
		if r <= 0 then
			return 0
		end	
    
	JY.Thing[224]["加防御力"] = menu[r][4] --设置功体
	JY.Person[0]["武功"..a] = 9999
	JY.Person[0]["武功等级"..a] = 999
	local a = 0
	for i = 1,HHH_GAME_SETTING["WG_COUNT_MAX"] do 
	   if JY.Person[0]["武功"..i] == JY.Thing[224]["加防御力"] then 
	     -- JY.Person[0]["武功"..i] = JY.Person[0]["武功"..i+1]
		 a=i
	   end
	end
    for i = a,HHH_GAME_SETTING["WG_COUNT_MAX"] do 
	      JY.Person[0]["武功"..i] = JY.Person[0]["武功"..i+1]
		  JY.Person[0]["武功等级"..i] = JY.Person[0]["武功等级"..i+1] 
	end
		JY.Person[0]["武功"..HHH_GAME_SETTING["WG_COUNT_MAX"]] = 0
		JY.Person[0]["武功等级"..HHH_GAME_SETTING["WG_COUNT_MAX"]] = 0
		
	JY.Thing[224]["名称2"] = "";
	while JY.Thing[224]["名称2"] == "" do
		JY.Thing[224]["名称2"] = Shurufa(32, CC.ScreenH - 6 * CC.Fontbig)
		if JY.Thing[224]["名称2"] == "" then
			DrawStrBoxWaitKey("请给你的武功命名", C_WHITE, 30)
		end
	end
	JY.Wugong[9999]["名称"] = JY.Thing[224]["名称2"]
	say("哈哈哈哈！")
end
end