--无酒：已用事件编号3501-3563
--雪山飞狐：3503-3511
--神雕侠侣：3512-3563

function My_Enter_SubScene2(sceneid,x,y,direct)
	if JY.Status == GAME_SMAP then
	  JY.Base["无用"] = JY.SubScene
	else
	  JY.Base["无用"] = -1
	end
	SBLDATAS(11)
	
	JY.SubScene = sceneid;
	local flag = 1;   --是否自定义的xy坐标, 0是，1否
	if x == -1 and y == -1 then
		JY.Base["人X1"]=JY.Scene[sceneid]["入口X"];
  	JY.Base["人Y1"]=JY.Scene[sceneid]["入口Y"];
  else
  	JY.Base["人X1"] = x;
  	JY.Base["人Y1"] = y;
  	flag = 0;
	end
	
	if direct > -1 then
		JY.Base["人方向"] = direct;
	end
 			
	
	if JY.Status == GAME_MMAP then
		CleanMemory();
		lib.PicInit()--
		lib.UnloadMMap();
	end
  lib.PicInit();
  lib.ShowSlow(20,1)

	JY.Status = GAME_SMAP;  --改变状态
  JY.MmapMusic=-1;

	JY.Base["乘船"]=0;
  JY.MyPic=GetMyPic(); 
  
  --外景入口是个难点，有些子场景是通过跳转的方式进入的，需要判断
  --由于目前最多只能有一个子场景跳转，所以不需要进行循环判断
  local sid = JY.Scene[sceneid]["跳转场景"];
  
  if sid < 0 or (JY.Scene[sid]["外景入口X1"] <= 0 and JY.Scene[sid]["外景入口Y1"] <= 0) then
  	JY.Base["人X"] = JY.Scene[sceneid]["外景入口X1"];  --改变出子场景后的XY坐标
		JY.Base["人Y"] = JY.Scene[sceneid]["外景入口Y1"];
	else
		JY.Base["人X"] = JY.Scene[sid]["外景入口X1"];  --改变出子场景后的XY坐标
		JY.Base["人Y"] = JY.Scene[sid]["外景入口Y1"];
	end


  Init_SMap(flag);  --重新初始化地图
  
  --[[if flag == 0 then    --如果是自定义位置，先传送到那个位置，再显示场景名称
  	DrawStrBox(-1,10,JY.Scene[JY.SubScene]["名称"],C_WHITE,CC.DefaultFont);
		ShowScreen();
		WaitKey();
  end]]
  
  Cls();
	
end

OEVENTLUA[3501] = function() -- 舞帮忙送信事件
	if DrawStrBoxYesNo(-1, -1, "要我去帮忙送介绍信吗？", C_WHITE, 30) == true then
		instruct_32(234,-1)
		instruct_0()
		say("回来了！", 104, 1,"舞");
		instruct_2(112,1) -- 罗汉拳
		instruct_2(134,1) -- 松风
		instruct_2(166,1) -- 柴刀
		instruct_2(186,1) -- 杨枪
		instruct_0()
		--开启地图
		for i = 0, 3 do
			instruct_39(i)
		end
		instruct_39(6)
		JY.Scene[7]["名称"] = "独孤剑冢"
		for i = 8, 9 do
			instruct_39(i)
		end
		for i = 11, 12 do
			instruct_39(i)
		end
		for i = 16, 24 do
			instruct_39(i)
		end
		for i = 26, 66 do
			instruct_39(i)
		end
		for i = 68, 71 do
			instruct_39(i)
		end
		for i = 73, 80 do
			instruct_39(i)
		end
		for i = 92, 103 do
			instruct_39(i)
		end
		for i = 105, 112 do
			instruct_39(i)
		end
		instruct_39(104) -- 开启钓鱼岛
		--关闭四派送信剧情
		addevent(101, 1, 1, 738)
		addevent(36, 4, 1, 730)
		addevent(28, 12, 1, 702)
		addevent(19, 0, 1, 723)
		addevent(70, 3, 1, 692)
		addevent(70, -2, 1, 3502)
		--测试用
		say("为了方便测试，这些也给你吧！", 104, 1,"舞");
		JY.Person[0]["实战"]=500
		JY.Person[0]["攻击力"]=999
		JY.Person[0]["防御力"]=999
		JY.Person[0]["轻功"]=999 
		JY.Person[0]["生命最大值"] = 1500
	    JY.Person[0]["生命"] = 1500
        JY.Person[0]["内力最大值"] = 10000
	    JY.Person[0]["内力"] = 10000	
		JY.Person[0]["武功1"] = 112
		JY.Person[0]["武功等级1"] = 999
		JY.Person[0]["武功2"] = 107
		JY.Person[0]["武功等级2"] = 999
		JY.Person[0]["武功3"] = 106
		JY.Person[0]["武功等级3"] = 999
		JY.Person[0]["武功4"] = 119
		JY.Person[0]["武功等级4"] = 999
		JY.Person[0]["武功5"] = 108
		JY.Person[0]["武功等级5"] = 999
		JY.Person[0]["武功6"] = 103
		JY.Person[0]["武功等级6"] = 999
		JY.Person[0]["武功7"] = 101
		JY.Person[0]["武功等级7"] = 999
		addHZ(12) -- 获得无我无剑
		addHZ(90) -- 获得奇经八脉
		addHZ(134) -- 获得明镜非台
		addHZ(141) -- 获得九州一剑
		addHZ(143) -- 获得心如止水
	end
end

OEVENTLUA[3502] = function() -- 全队血内加满
	say("鸡年大吉！", 104, 1,"舞");
	--加生命
	for i=1, CC.TeamNum do
    	if JY.Base["队伍"..i] >= 0 then
	 	   AddPersonAttrib(JY.Base["队伍"..i], "生命最大值", 1500)
    	end
	end
	--加内力
	for i=1, CC.TeamNum do
    	if JY.Base["队伍"..i] >= 0 then
	    	AddPersonAttrib(JY.Base["队伍"..i], "内力最大值", 10000)
    	end
	end
end

OEVENTLUA[3503] = function() -- 雪山飞狐玉笔山庄剧情1
	dark()
	addevent(-2, 52, 0, 0, 0, 2584*2, 11, 22)
	addevent(-2, 53, 0, 0, 0, 3049*2, 15, 21)
	addevent(-2, 54, 0, 0, 0, 3049*2, 15, 22)
	addevent(-2, 55, 0, 0, 0, 3049*2, 15, 23)
	light()
	say("和尚，你以武力相逼，强迫我们大伙到这山庄来，究竟有何目的？", 177, 1,"陶百岁");
	say("诸位稍安勿躁，我今天请诸位来这里，是要讲一个故事。", 4, 1,"宝树");
	say("这个故事要从这把刀说起……", 4, 1,"宝树");
	say("宝树谈起宝刀的来历，继而，分别由宝树、金面佛大侠苗人凤之女苗若兰、平阿四及陶百岁之口讲述了与此相关的一段武林往事。", 928, 2);
	dark()
	light()
	say("如此这般，苗范田三家子孙，世世代代与胡家为仇，冤冤相报，无一代能得善终。", 4, 1,"宝树");
	say("而这铁盒中的宝刀，便是闯王李自成的遗物。", 4, 1,"宝树");
	dark()
	addevent(-2, 56, 0, 0, 0, 2583*2, 12, 20)
	light()
	say("阁下是何人？", 4, 1,"宝树");
	say("雪山飞狐。", 1, 1,"胡斐");
	say("＜好一个俊朗的青年＞", 571, 1,"苗若兰");
	say("＜听闻雪山飞狐与这山庄庄主有约，在此决斗。我还是暂避其锋的好。＞", 4, 1,"宝树");
	say("诸位长途跋涉，想必也都累了，何不到内室稍作休息？", 4, 1,"宝树");
	dark()
	null(3, 17) ---关闭常规邪线
	null(0, 4)  ---关闭常规正线
	addevent(3, 2, 1, 666, 1) --关闭飞雪前代线
	addevent(3, 3, 1, 666, 1) --关闭飞雪前代线
	for i = 50, 56 do
		null(108,i)
	end
	instruct_3(108, 57, 0, -1, -1, -1, 3504, -2, -2, -2, -2, 9, 15) -- 开启雪山飞狐玉笔山庄剧情2
	light()
end

OEVENTLUA[3504] = function() -- 雪山飞狐玉笔山庄剧情2
	dark()
	addevent(-2, 58, 0, 0, 0, 2584*2, 9, 10)
	addevent(-2, 59, 0, 0, 0, 3048*2, 9, 13)
	addevent(-2, 60, 0, 0, 0, 3048*2, 10, 13)
	addevent(-2, 61, 0, 0, 0, 3048*2, 11, 13)
	addevent(-2, 62, 0, 0, 0, 4370*2, 12, 13)
	addevent(-2, 63, 0, 0, 0, 4477*2, 12, 10)
	light()
	say("哼，原来这便是闯王军刀的秘密，看来那宝藏就在峰后了。", 4, 1,"宝树");
	say("＜这小妮子是苗人凤之女，又与那雪山飞狐眉来眼去，带她去怕是要坏我大事。＞", 4, 1,"宝树");
	say("宝树上前两步，已在苗若兰颈口“天突”与背心“神通”两穴上各点了一指。苗若兰全身酸软，瘫在椅上，心里又羞又急，却说不出话。", 928, 2);
	say("苗家妹子，坐在这里可不好看，我扶你到厢房休息吧。", 456, 1,"田青文");
	dark()
	null(108,62)
	null(108,63)
	light()
	say("我们走。", 4, 1,"宝树");
	dark()
	for i = 57, 61 do
		null(108,i)
	end
	light()
	say("宝藏？莫非是天书？这可不能错过。不过我还是先去看看苗姑娘怎么样了。", 0, 1);
	instruct_3(108, 64, 0, -1, -1, -1, 3505, -2, -2, -2, -2, 15, 11) -- 开启雪山飞狐玉笔山庄正邪分支
	instruct_3(108, 65, 0, -1, -1, -1, 3505, -2, -2, -2, -2, 16, 11)
end

OEVENTLUA[3505] = function() -- 雪山飞狐玉笔山庄正邪分支
	dark()
	light()
	say("这被中竟睡著一个女子？难道是苗姑娘？", 0, 1);
	say("只见苗若兰向外而卧，脸蛋儿羞得与海棠花一般，烛光映过珠罗纱帐照射进来，更显得眼前枕上，这张脸蛋娇美艳丽，难描难画。", 928, 2);
	say("这……四下无人，苗姑娘被点了穴道，我……", 0, 1);
	if DrawStrBoxYesNo(-1, -1, "要碰苗若兰吗？", C_WHITE, 30) == true then
		say("这大好的机会，此时不上，更待何时？", 0, 1);
		say("公子……", 571, 1,"苗若兰");
		dark()
		addevent(-2, 66, 0, 0, 0, 4692*2, 17, 10)
		light()
		say("苗姑娘！", 1, 1,"胡斐");
		say("小子，你想做什么？", 1, 1,"胡斐");
		dark()
		addevent(-2, 67, 0, 0, 0, 4686*2, 18, 13)
		light()
		say("放开我女儿！", 3, 1,"苗人凤");
		say("看来是跑不掉了，那就开打吧！", 0, 1);
		if WarMain(312) == false then
			instruct_15(0);   
			instruct_0();  
			do return; end			
		end
		say("苗大侠，这淫贼有两下子，你带着令千金先撤，我来断后。", 1, 1,"胡斐");
		dark()
		null(108,66)
		null(108,67)
		null(108,64)
		null(108,65)
		light()
		say("美人没碰着，还差点送了命。我还是去找找宝藏吧。", 0, 1);
		instruct_39(5) -- 开启闯王宝藏洞
		instruct_3(5,8,0,0,0,0,0,0,0,0,0,0,0);   --  开启闯王宝藏铁门
    	instruct_17(5,1,21,21,0);   --  17(11):修改场景贴图:当前场景层1坐标15-15
    	instruct_17(5,1,20,20,3694);   --  17(11):修改场景贴图:当前场景层1坐标14-14
    	instruct_17(5,1,20,21,4064);  --  17(11):修改场景贴图:当前场景层1坐标14-15
		--删除雪人
		for i = 0, 6 do
		null(5,i)
		end
		null(5,14)
		null(5,15)
		instruct_3(5, 20, 0, -1, -1, -1, 3506, -2, -2, -2, -2, 21, 21) -- 开启雪山飞狐邪线闯王宝藏洞剧情
		addevent(5, 21, 0, 0, 0, 2584*2, 18, 16)
		addevent(5, 22, 0, 0, 0, 4369*2, 20, 15)
	else
		say("＜罪过罪过，差点就把持不住。＞", 0, 1);
		say("咦？那边好像有动静，苗姑娘莫慌，我等下便来救你。", 0, 1);
		if JY.Base["人X1"] == 15 then			--两个触发地方的移动方式不一样
			instruct_30(-3,0,0,0);
			instruct_30(0,-3,0,0);
			instruct_30(9,-1,0,0);
		else
			instruct_30(-2,0,0,0);
			instruct_30(0,-3,0,0);
			instruct_30(9,-1,0,0);
		end
		dark()
		addevent(-2, 69, 0, 0, 0, 2983*2, 8, 20)
		addevent(-2, 70, 0, 0, 0, 3049*2, 9, 20)
		light()
		say("嘿嘿，什么金面佛，雪山飞狐，这次我杜希孟要让他们有来无回！", 179, 1,"杜希孟");
		dark()
		null(108,69)
		null(108,70)
		light()
		say("原来他就是玉笔山庄的庄主杜希孟，想不到他已经串通官府，要害胡苗二位大侠，我得尽快通报他们。", 0, 1);
		instruct_30(0,1,0,0);
		instruct_30(-6,0,0,0);
		dark()
		addevent(-2, 68, 0, 0, 0, 2583*2, 17, 10)
		addevent(-2, 67, 0, 0, 0, 4686*2, 18, 13)
		addevent(108, 71, 1, 3507, 1, 4368*2, 14, 11) -- 雪山飞狐正线雪山决斗
		light()
		say("放开我女儿！", 3, 1,"苗人凤");
		say("爹，他是……", 571, 1,"苗若兰");
		say("苗大侠快住手，事情并非你所想的那样。", 0, 1);
		say("兰儿你留在这儿，我和这人有几句话说。", 3, 1,"苗人凤");
		say("兰妹，你爹既这般说，我就过去一会儿，你在这里等著。这个包裹你先替我保管。", 1, 1,"胡斐");
		dark()
		null(108,67)
		null(108,68)
		light()
		null(108,64)
		null(108,65)
	end
end

OEVENTLUA[3506] = function() -- 雪山飞狐邪线闯王宝藏洞剧情
	dark()
	addevent(-2, 23, 0, 0, 0, 3387*2, 20, 23)
	addevent(-2, 24, 0, 0, 0, 3387*2, 21, 23)
	addevent(-2, 25, 0, 0, 0, 3387*2, 22, 23)
	addevent(-2, 26, 0, 0, 0, 3387*2, 23, 23)
	addevent(-2, 27, 0, 0, 0, 2611*2, 20, 25)
	addevent(-2, 28, 0, 0, 0, 2611*2, 21, 25)
	addevent(-2, 29, 0, 0, 0, 2611*2, 22, 25)
	addevent(-2, 30, 0, 0, 0, 2611*2, 23, 25)
	light()
	say("你小子也想分一杯羹？大伙一起上！先干掉他。", 4, 1,"宝树");
	if WarMain(306) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	for i = 23, 30 do
		null(5,i)
	end
	say("少侠武艺高强，小人万万不是对手，这宝藏理应归少侠所有。", 4, 1,"宝树");
	say("少侠武功盖世，小女愿意跟随您。", 456, 1,"田青文");
	say("你们倒是会见风使舵，以后就跟着我吧。", 0, 1);
	JY.Person[72]["姓名"] = "田青文"
	JY.Person[72]["性别"] = 1
	JY.Person[72]["半身像"] = 456
	null(5,21)
	--阎基入队
	teammate(4)
	instruct_3(104,57,1,0,947,0,0,2584*2,2584*2,2584*2,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [84]
	null(5,22)
	--田归农入队
    teammate(72)
	instruct_3(104,84,1,0,973,0,0,7012,7012,7012,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [84]
	null(5,20)
end

OEVENTLUA[3507] = function() -- 雪山飞狐正线雪山决斗
	say("苗若兰缓缓打开包裹，里面是是几件婴儿衣衫，一双婴儿鞋子，还有一块黄布包袱，包上绣著“打遍天下无敌手”七个黑字。", 928, 2);
	say("这……少侠，爹嫉恶如仇，胡大哥又不善言辞。我担心他们发生什么误会，我们快跟去看看吧。", 571, 1,"苗若兰");
	say("还是苗姑娘考虑的周全，我们这就走。", 0, 1);
	say("他们刚刚似乎是往那边的山峰上去了。", 0, 1);
	null(108,71)
	for i = 0, 2 do
		null(2,i)
	end
	null(2,3) -- 删除血刀老祖
	addevent(2,50,1,3509,1,4692*2,27,29); --添加胡斐
	addevent(2,51,1,3508,1,4686*2,27,32); --添加苗人凤
	--删除落花流水
	instruct_17(2,1,24,31,0);   --  17(11):修改场景贴图:当前场景层1坐标15-15
	instruct_17(2,1,25,29,0);   --  17(11):修改场景贴图:当前场景层1坐标15-15
    instruct_17(2,1,27,27,0);   --  17(11):修改场景贴图:当前场景层1坐标14-14
    instruct_17(2,1,30,34,0);  --  17(11):修改场景贴图:当前场景层1坐标14-15
	transferme(2, 27, 47, 0)
	say("一路上山，转了几个弯，但觉山道愈来愈险，一个失足便会摔得粉身碎骨。奔到后来，山壁间全是凝冰积雪，滑溜异常，竟难有下足之处。", 928, 2);
	instruct_25(27,47,27,30); --镜头移动
    say("且住！你可识得胡一刀么？", 3, 1,"苗人凤");
	say("胡大侠乃前辈英雄，不幸为奸人所害。我若有福气能得他教诲几句，立时死了，也所甘心。", 1, 1,"胡斐");
	say("＜他这几句话说得甚好，单凭这几句话，我就交了他这个朋友。但他却欺辱兰儿，我又怎能留他？＞", 3, 1,"苗人凤");
	say("接招！", 3, 1,"苗人凤");
	--自定义战斗
	SetS(106, 63, 1, 0, 1)
   	SetS(106, 63, 2, 0, 3)
	JY.Person[1]["实战"]=500
	JY.Person[1]["攻击力"]=999
	JY.Person[1]["防御力"]=999
	JY.Person[1]["轻功"]=999 
	JY.Person[1]["生命最大值"] = 2000
	JY.Person[1]["生命"] = 2000
    JY.Person[1]["内力最大值"] = 10000
	JY.Person[1]["内力"] = 10000
	JY.Person[1]["武功1"] = 67
	JY.Person[1]["武功等级1"] = 999
	if WarMain(288) == false then
    	instruct_0();   --  0(0)::空语句(清屏)
	else
		addHZ(3)
    	instruct_0();   --  0(0)::空语句(清屏)
	end
	say("苗人凤就要使出一招“提撩剑白鹤舒翅”。这招剑掌齐施，要逼得对方非跌下岩去不可，只是他自幼习惯使然，出招之前不禁背脊微微一耸。", 928, 2);
	say("其时月明如洗，长空一碧，月光将山壁映得一片光亮。那山壁上全是晶光的凝冰，犹似镜子一般，将苗人凤背心反照出来。", 928, 2);
	say("＜平四叔曾说，父亲当年与他比武时，母亲在他背后咳嗽示意，已知他下一步非出“提撩剑白鹤舒翅”不可，我若用一招“八方藏刀式”，便可抢了先著，将他劈下岩去。＞", 1, 1,"胡斐");
	say("＜但我曾答应过兰儿，决不能伤她父亲。然而若不劈他，容他将一招使全了，我便非死不可。＞", 1, 1,"胡斐");
	say("霎时之间，胡斐心中转过了千百个念头。", 928, 2);
	if DrawStrBoxYesNo(-1, -1, "这一刀到底劈下去还是不劈？", C_WHITE, 30) == true then
		if hasthing (298) then
			say(JY.Person[zj()]["姓名"].."掷出两根绣花针。针如闪电般划过长空，竟同时击落了胡斐与苗人凤手中的武器。", 928, 2);
			instruct_25(27,30,27,47);
			instruct_30(0,13,0,0);
			say("且慢！", 0, 1);
			say("爹！胡大哥！", 571, 1,"苗若兰");
			say("苗若兰将事情原委向两人诉说。", 928, 2);
			addevent(24,8,1,3510,1,2608*2);
			transferme(24, 18, 23, 2)
			null(2,50)
			null(2,51)
		else
			say("八方藏刀式！你是胡斐贤侄！", 3, 1,"苗人凤");
			say("然而已经太迟了……", 928, 2);
			dark()
			null(2,51)
			light()
			instruct_25(27,30,27,47);
		end
	else
		if hasthing (298) then
			say(JY.Person[zj()]["姓名"].."掷出两根绣花针。针如闪电般划过长空，竟同时击落了胡斐与苗人凤手中的武器。", 928, 2);
			instruct_25(27,30,27,47);
			instruct_30(0,13,0,0);
			say("且慢！", 0, 1);
			say("爹！胡大哥！", 571, 1,"苗若兰");
			say("苗若兰将事情原委向两人诉说。", 928, 2);
			addevent(24,8,1,3510,1,2608*2);
			transferme(24, 18, 23, 2)
			null(2,50)
			null(2,51)
		else
			say("啊！", 1, 1,"胡斐");
			dark()
			null(2,50)
			light()
			instruct_25(27,30,27,47);
		end
	end
end

OEVENTLUA[3508] = function() -- 胡斐挂
	say("爹……", 571, 1,"苗若兰");
	say("我一生嫉恶如仇，却不想铸下如此大错。现在纵使一死，又有何脸面去面对泉下的胡兄？", 3, 1,"苗人凤");
	dark()
	null(2,51)
	light()
	say("哎，世事难尽如人意。我还是继续寻找天书吧。", 0, 1);
	instruct_39(5) -- 开启闯王宝藏洞
	instruct_3(5,8,0,0,0,0,0,0,0,0,0,0,0);   --  开启闯王宝藏铁门
    instruct_17(5,1,21,21,0);   --  17(11):修改场景贴图:当前场景层1坐标15-15
    instruct_17(5,1,20,20,3694);   --  17(11):修改场景贴图:当前场景层1坐标14-14
    instruct_17(5,1,20,21,4064);  --  17(11):修改场景贴图:当前场景层1坐标14-15
	--删除雪人
	for i = 0, 6 do
	null(5,i)
	end
	null(5,14)
	null(5,15)
	instruct_3(5, 20, 0, -1, -1, -1, 3511, -2, -2, -2, -2, 21, 21) -- 开启雪山飞狐正线闯王宝藏洞最终战
end

OEVENTLUA[3509] = function() -- 苗人凤挂
	say("胡大哥……", 571, 1,"苗若兰");
	say("若兰，我言而无信，不配再见你，从此天地间再没有胡斐这个人。", 1, 1,"胡斐");
	dark()
	null(2,50)
	light()
	say("哎，世事难尽如人意。我还是继续寻找天书吧。", 0, 1);
	instruct_39(5) -- 开启闯王宝藏洞
	instruct_3(5,8,0,0,0,0,0,0,0,0,0,0,0);   --  开启闯王宝藏铁门
    instruct_17(5,1,21,21,0);   --  17(11):修改场景贴图:当前场景层1坐标15-15
    instruct_17(5,1,20,20,3694);   --  17(11):修改场景贴图:当前场景层1坐标14-14
    instruct_17(5,1,20,21,4064);  --  17(11):修改场景贴图:当前场景层1坐标14-15
	--删除雪人
	for i = 0, 6 do
	null(5,i)
	end
	null(5,14)
	null(5,15)
	instruct_3(5, 20, 0, -1, -1, -1, 3511, -2, -2, -2, -2, 21, 21) -- 开启雪山飞狐正线闯王宝藏洞最终战
end

OEVENTLUA[3510] = function() -- 和解
	say("想不到雪山飞狐便是故人之子。贤侄英武不下胡兄当年，胡兄泉下有知，也当感欣慰了。", 3, 1,"苗人凤");
	say("这些年来我一直深感愧对胡兄，今次多亏了这位小兄弟相助，才没有铸成大错，也解开了我多年的心结。", 3, 1,"苗人凤");
	say("苗大侠客气了，这是我辈中人应尽之事。", 0, 1);
	say("贤侄，兰儿，听说小兄弟在寻找天书，你们去帮帮他吧。", 3, 1,"苗人凤");
	JY.Person[1]["携带物品1"] = -1 --取消胡斐自带的闯王军刀
	JY.Person[1]["携带物品数量1"] = 0
	teammate(1)
	instruct_3(104,40,1,0,945,0,0,7222,7222,7222,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [84]
	null(24,8)
	instruct_39(5) -- 开启闯王宝藏洞
	instruct_3(5,8,0,0,0,0,0,0,0,0,0,0,0);   --  开启闯王宝藏铁门
    instruct_17(5,1,21,21,0);   --  17(11):修改场景贴图:当前场景层1坐标15-15
    instruct_17(5,1,20,20,3694);   --  17(11):修改场景贴图:当前场景层1坐标14-14
    instruct_17(5,1,20,21,4064);  --  17(11):修改场景贴图:当前场景层1坐标14-15
	--删除雪人
	for i = 0, 6 do
	null(5,i)
	end
	null(5,14)
	null(5,15)
	instruct_3(5, 20, 0, -1, -1, -1, 3511, -2, -2, -2, -2, 21, 21) -- 开启雪山飞狐正线闯王宝藏洞最终战
end

OEVENTLUA[3511] = function() -- 雪山飞狐正线最终战
	dark()
	addevent(5, 21, 0, 0, 0, 2584*2, 18, 16)
	addevent(5, 22, 0, 0, 0, 3627*2, 20, 16)
	light()
	say("大人请看，这里就是昔年闯王李自成留下的宝藏了。", 4, 1,"宝树");
	say("……", 454, 1,"真田幸村");
	say("宝树！想不到你居然通敌卖国！", 0, 1);
	say("！！！", 454, 1,"真田幸村");
	if WarMain(128) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	null(5,20)
	null(5,21)
	null(5,22)
end

OEVENTLUA[3512] = function() -- 神雕线，初遇杨过
	null(22,0) -- 删除断肠草
	JY.Person[58]["携带物品1"] = -1 --初始化杨过
	JY.Person[58]["携带物品数量1"] = 0
	JY.Person[58]["携带物品2"] = -1
	JY.Person[58]["携带物品数量2"] = 0
	JY.Person[58]["携带物品3"] = -1
	JY.Person[58]["携带物品数量3"] = 0
	JY.Person[58]["武功1"] = -1
    JY.Person[58]["武功等级1"] = 0
	JY.Person[58]["武功2"] = -1
    JY.Person[58]["武功等级2"] = 0
	JY.Person[58]["武功3"] = -1
    JY.Person[58]["武功等级3"] = 0
	JY.Person[58]["武功4"] = -1
    JY.Person[58]["武功等级4"] = 0
	JY.Person[58]["半身像"] = 41
	JY.Person[58]["资质"] = 90
	JY.Person[58]["拳掌功夫"] = 30
	JY.Person[58]["御剑能力"] = 30
	JY.Person[58]["耍刀技巧"] = 30
	JY.Person[58]["特殊兵器"] = 30
	JY.Person[58]["暗器技巧"] = 30
	JY.Person[58]["等级"] = 5
	JY.Person[58]["实战"] = 0
	JY.Person[58]["攻击力"]=30
    JY.Person[58]["防御力"]=30
	JY.Person[58]["轻功"]=30
	JoinMP(58, 0, 0)
	say("面前这名少年衣衫褴褛，左手提著一只公鸡，口中唱著俚曲，脸上贼忒嘻嘻。", 928, 2);
	say("大美人和小美人都走了。大美人留下的这些银针倒是有趣。", 41, 1,"？？");
	say("这名少年俯身拾起一枚银针，去拨弄了几下地上的蚂蚁，那几只蚂蚁兜了几个圈子，便即翻身僵毙，连试几只小虫都是如此。", 928, 2);
	say("不好，针上有毒！", 41, 1,"？？");
	dark()
	null(32,30)
	addevent(32, 31, 0, 0, 0, 3552*2, 31, 29)
	addevent(32, 32, 0, 0, 0, 4624*2, 32, 30)
	light()
	say("小娃娃，知道厉害了罢？", 60, 1,"欧阳锋");
	say("你……你是谁？", 41, 1,"？？");
	say("我……我是谁？我知道我是谁就好啦。", 60, 1,"欧阳锋");
	say("求老公公救我性命。你本事这么大，一定可以救我。", 41, 1,"？？");
	say("好，救你不难，但你须得答应我一件事。", 60, 1,"欧阳锋");
	say("＜那人不就是西毒欧阳锋吗？他看起来有些不正常，不知道他要让这孩子做什么？＞", 0, 1);
	if DrawStrBoxYesNo(-1, -1, "是否出手干预？", C_WHITE, 30) == true then
		say("住手！", 0, 1);
		SetS(106, 63, 1, 0, 0)
   		SetS(106, 63, 2, 0, 60)
		if WarMain(288) == false then
			instruct_15(0);   
			instruct_0();  
			do return; end			
		end
		addHZ(34)
		null(32,31)
		say("小兄弟，毒我帮你解，那个人不是好人。", 0, 1);
		say("空中忽然几声雕唳，两头大雕在半空飞掠而过。柳树林后转出一男一女，来到近前，双雕分别停在二人肩头。", 928, 2);
		dark()
		null(32, 32)
		addevent(32, 33, 0, 0, 0, 4001*2, 31, 29)	
		addevent(32, 34, 0, 0, 0, 4002*2, 33, 29)
		addevent(32, 35, 0, 0, 0, 4625*2, 32, 30)
		light()
		say("你们是谁？", 41, 1,"？？");
		say("你姓杨名过，你妈妈姓穆，是不是？", 56, 1,"黄蓉");
		say("那少年正是姓杨名过，突然被黄蓉说了出来，不由得惊骇无比，胸间气血上涌，手上毒气突然回冲，脑中一阵胡涂，登时晕了过去。", 928, 2);
		say("他……他原来是杨康兄弟的孩子。", 55, 1,"郭靖");
		say("咱们先投客店，到城里配几味药，再带他回桃花岛。", 56, 1,"黄蓉");
		dark()
		null(32, 33)
		null(32, 34)
		null(32, 35)
		light()
		say("桃花岛……我改天有时间过去看看杨过小兄弟吧。", 0, 1);
		null(7,6) -- 取消神雕洞杨过
		null(75,30) -- 取消桃花岛老顽童
		addevent(75, 60, 1, 3513, 1, 3044*2, 25, 12) -- 桃花岛增加郭靖
		addevent(75, 61, 1, 3514, 1, 3045*2, 27, 12) -- 桃花岛增加黄蓉
		addevent(75, 62, 1, 3517, 1, 3588*2, 18, 27) -- 桃花岛增加大武
		addevent(75, 63, 1, 3518, 1, 3589*2, 18, 26) -- 桃花岛增加小武
		addevent(75, 64, 1, 3516, 1, 4627*2, 19, 24) -- 桃花岛增加郭芙
		addevent(75, 65, 1, 3525, 1, 4624*2, 21, 26) -- 桃花岛增加杨过
		addevent(75, 66, 1, 3519, 1, 4106*2, 31, 22) -- 桃花岛增加柯镇恶
	else
		say("＜各人自有各人的因缘，我还是不要插手了。＞", 0, 1);
		say("公公，我答应你，你不论说什么，我都听你的。", 41, 1,"？？");
		say("你别叫我公公，要叫爸爸！", 60, 1,"欧阳锋");
		say("＜我自出生就没有爸爸，现在妈妈也死了。这人虽然举止怪异，疯疯癫癫，但他若真肯救我，叫他声爸爸又有何妨？＞", 41, 1,"？？");
		say("爸爸！", 41, 1,"？？");
		say("乖儿子，来，爸爸这就教你解毒之法。", 60, 1,"欧阳锋");
		JY.Person[58]["武功1"] = 95
		JY.Person[58]["武功等级1"] = 999
		JY.Person[58]["声望"] = 95
		QZXS("？？学会蛤蟆功！")
		say("空中忽然几声雕唳，两头大雕在半空飞掠而过。欧阳锋向双雕呆望，以手击额，皱眉苦苦思索，突然间似乎想起了什么，登时脸色大变。", 928, 2);
		say("不……我不要见他们。", 60, 1,"欧阳锋");
		dark()
		null(32, 31)
		null(32, 32)
		addevent(32, 33, 0, 0, 0, 4001*2, 31, 29)	
		addevent(32, 34, 0, 0, 0, 4002*2, 33, 29)
		addevent(32, 35, 0, 0, 0, 4625*2, 32, 30)
		light()
		say("爸爸，你去哪儿？", 41, 1,"？？");
		say("你姓杨名过，你妈妈姓穆，是不是？", 56, 1,"黄蓉");
		say("那少年正是姓杨名过，突然被黄蓉说了出来，不由得惊骇无比，胸间气血上涌，手上毒气突然回冲，脑中一阵胡涂，登时晕了过去。", 928, 2);
		say("他……他原来是杨康兄弟的孩子。", 55, 1,"郭靖");
		say("咱们先投客店，到城里配几味药，再带他回桃花岛。", 56, 1,"黄蓉");
		dark()
		null(32, 33)
		null(32, 34)
		null(32, 35)
		light()
		say("桃花岛……我改天有时间过去看看杨过小兄弟吧。", 0, 1);
		null(7,6) -- 取消神雕洞杨过
		null(75,30) -- 取消桃花岛老顽童
		addevent(75, 60, 1, 3513, 1, 3044*2, 25, 12) -- 桃花岛增加郭靖
		addevent(75, 61, 1, 3514, 1, 3045*2, 27, 12) -- 桃花岛增加黄蓉
		addevent(75, 62, 1, 3517, 1, 3588*2, 18, 27) -- 桃花岛增加大武
		addevent(75, 63, 1, 3518, 1, 3589*2, 18, 26) -- 桃花岛增加小武
		addevent(75, 64, 1, 3524, 1, 4627*2, 19, 24) -- 桃花岛增加郭芙
		addevent(75, 65, 1, 3515, 1, 4624*2, 21, 26) -- 桃花岛增加杨过
		addevent(75, 66, 1, 3519, 1, 4106*2, 31, 22) -- 桃花岛增加柯镇恶
	end
end

OEVENTLUA[3513] = function() -- 神雕线，桃花岛郭靖
	say("郭大侠好。", 0, 1);
	say("少侠是来看望过儿的？他就在外面。", 55, 1,"郭靖");
end

OEVENTLUA[3514] = function() -- 神雕线，桃花岛黄蓉
	say("黄女侠好。", 0, 1);
	say("少侠是来看望过儿的？他就在外面。", 56, 1,"黄蓉");
end

OEVENTLUA[3515] = function() -- 神雕线，桃花岛杨过，会蛤蟆功
	say("小兄弟，你在这里还习惯吗？", 0, 1);
	say("他们都当我是外人，都欺负我，我要去找爸爸。", 41, 1,"杨过");
end

OEVENTLUA[3517] = function() -- 神雕线，桃花岛大武
	say("我叫武敦儒。", 700, 1,"武敦儒");
end

OEVENTLUA[3518] = function() -- 神雕线，桃花岛小武
	say("我叫武修文。", 700, 1,"武修文");
end

OEVENTLUA[3519] = function() -- 神雕线，桃花岛柯镇恶
	say("……", 130, 1,"柯镇恶");
end

OEVENTLUA[3516] = function() -- 神雕线，杨过不会蛤蟆功，挨打事件
	say("大武小武，打他！用力打！", 569, 1,"郭芙");
	say("武氏兄弟武功本有根柢，杨过先前就已抵敌不过，再加上郭靖这几个月来的教导，他如何再是敌手？厮打片刻，头脸腰背已连中七八下拳脚。", 928, 2);
	dark()
	null(75,65)
	addevent(75, 66, 1, 0, 1, 2577*2, 21, 26)
	light()
	say("住手！", 0, 1);
	dark()
	null(75,60)
	null(75,61)
	addevent(75, 67, 1, 0, 1, 4001*2, 18, 22)
	addevent(75, 68, 1, 0, 1, 4002*2, 20, 22)
	addevent(75, 69, 1, 0, 1, 3993*2, 19, 29)
	light()
	say("怎么回事？", 55, 1,"郭靖");
	say("芙儿？你伤到没有？", 56, 1,"黄蓉");
	say("以后不可再动手。", 55, 1,"郭靖");
	dark()
	null(75,62)
	null(75,63)
	null(75,64)
	null(75,67)
	null(75,68)
	null(75,69)
	null(75,66)
	addevent(75, 70, 1, 3520, 1, 4623*2, 21, 26)
	light()
end

OEVENTLUA[3520] = function() -- 神雕线，杨过不会蛤蟆功，挨打事件2
	say("小兄弟，你怎么不还手？", 0, 1);
	say("黄伯母只教我读书，《论语》读完又教《孟子》，却从不教我武功。", 41, 1,"杨过");
	say("哪有这样的道理？也罢，我便传你两招，以后起码可做防身之用。", 0, 1);
	JY.Person[58]["武功1"] = 90
	JY.Person[58]["武功等级1"] = 999
	JY.Person[58]["声望"] = 90
	QZXS("杨过学会混元功！")
	say("谢谢大哥。", 41, 1,"杨过");
	dark()
	null(75,70)
	light()
	say("郭小姐刁蛮任性，这位杨过小兄弟住在这，免不了遭欺负。我过段时间再来看他吧。", 0, 1);
	addevent(75, 70, 0, 3521, 3, 0, 28, 56)
end

OEVENTLUA[3521] = function() -- 神雕线，杨过不会蛤蟆功，挨打事件3
	addevent(75, 71, 1, 3522, 1, 3044*2, 25, 12) -- 桃花岛增加郭靖
	addevent(75, 72, 1, 3523, 1, 3045*2, 27, 12) -- 桃花岛增加黄蓉
end

OEVENTLUA[3522] = function() -- 神雕线，桃花岛郭靖
	say("郭大侠好。", 0, 1);
	say("少侠是来看望过儿的？他已经去终南山重阳宫学艺了。", 55, 1,"郭靖");
	say("＜重阳宫？过儿生性顽皮，重阳宫那等清修之所，他能适应吗？＞", 0, 1);
	dark()
	null(75,71)
	null(75,72)
	addevent(19, 50, 0, 3528, 3, 0, 32, 49)
	light()
end

OEVENTLUA[3523] = function() -- 神雕线，桃花岛黄蓉
	say("黄女侠好。", 0, 1);
	say("少侠是来看望过儿的？他已经去终南山重阳宫学艺了。", 56, 1,"黄蓉");
	say("＜重阳宫？过儿生性顽皮，重阳宫那等清修之所，他能适应吗？＞", 0, 1);
	dark()
	null(75,71)
	null(75,72)
	addevent(19, 50, 0, 3528, 3, 0, 32, 49)
	light()
end

OEVENTLUA[3524] = function() -- 神雕线，杨过会蛤蟆功，反击事件
	say("大武小武，打他！用力打！", 569, 1,"郭芙");
	say("武氏兄弟武功本有根柢，杨过先前就已抵敌不过，再加上郭靖这几个月来的教导，他如何再是敌手？厮打片刻，头脸腰背已连中七八下拳脚。", 928, 2);
	say("武敦儒双手按住他头，问道：“你服了没有？”杨过怒道：“谁服你这疯狗？”武敦儒大怒，将他脸孔向沙地上直按下去。", 928, 2);
	say("杨过眼睛口鼻中全是沙粒，登时无法呼吸，又过片刻，全身如欲爆裂。武敦儒双手用力按住他头，武修文骑在他头颈之中，杨过始终挣扎不脱。", 928, 2);
	say("窒闷难当之际，这些日子来所练欧阳锋传授的内力突然崩涌，只觉丹田中一股热气激升而上，不知不觉间便使出了蛤蟆功，击向武氏兄弟。", 928, 2);
	dark()
	null(75,62)
	null(75,63)
	addevent(75, 73, 1, 0, 1, 2577*2, 18, 26)
	addevent(75, 74, 1, 0, 1, 2577*2, 18, 27)
	null(75,60)
	null(75,61)
	addevent(75, 67, 1, 0, 1, 4001*2, 18, 22)
	addevent(75, 68, 1, 0, 1, 4002*2, 20, 22)
	addevent(75, 69, 1, 0, 1, 3993*2, 19, 29)
	light()
	say("怎么回事？", 55, 1,"郭靖");
	say("欧阳锋呢？他在哪里？", 56, 1,"黄蓉");
	say("快说！欧阳锋在哪里？", 56, 1,"黄蓉");
	say("欧阳锋这奸贼在哪里？你不说，一杖就打死了你！", 130, 1,"柯镇恶");
	say("他不是奸贼！他是好人。你有种就打死我，我怕你这老瞎子吗？", 41, 1,"杨过");
	say("郭靖纵身上前，重重打了杨过一个耳光。", 928, 2);
	say("你胆敢对师祖爷爷无礼！", 55, 1,"郭靖");
	say("你们也不用动手，要我性命，我自己死好了！", 41, 1,"杨过");
	dark()
	null(75,73)
	null(75,74)
	null(75,64)
	null(75,67)
	null(75,68)
	null(75,69)
	null(75,66)
	null(75,65)
	light()
	say("想不到事情竟发展成如此局面，我过段时间再来看看吧。", 0, 1);
	addevent(75, 70, 0, 3526, 3, 0, 28, 56)
end

OEVENTLUA[3525] = function() -- 神雕线，桃花岛杨过，不会蛤蟆功
	say("小兄弟，你在这里还习惯吗？", 0, 1);
	say("他们都当我是外人，都欺负我。", 41, 1,"杨过");
end

OEVENTLUA[3526] = function() --神雕线，杨过会蛤蟆功，反击事件2
	addevent(75, 71, 1, 0, 1, 3044*2, 25, 12) -- 桃花岛增加郭靖
	addevent(75, 72, 1, 0, 1, 3045*2, 27, 12) -- 桃花岛增加黄蓉
	addevent(75, 75, 1, 0, 1, 4625*2, 25, 14) -- 桃花岛增加杨过
	addevent(75, 76, 0, 3527, 3, 0, 26, 20) -- 
	addevent(75, 77, 0, 3527, 3, 0, 28, 20) -- 
end

OEVENTLUA[3527] = function() --神雕线，杨过会蛤蟆功，反击事件3
	say("过儿，过去的事，大家也不提了。你对师祖爷爷无礼，不能再在我的门下，以后你只叫我郭伯伯便是。", 55, 1,"郭靖");
	say("你郭伯伯不善教诲，只怕反耽误了你。过几天我送你去终南山重阳宫，求全真教长春子丘真人收你入门。全真派武功是武学正宗，你好好在重阳宫中用功，修心养性，盼你日后做个正人君子。", 55, 1,"郭靖");
	say("是，郭伯伯。", 41, 1,"杨过");
	dark()
	null(75,70)
	null(75,71)
	null(75,72)
	null(75,75)
	null(75,76)
	null(75,77)
	light()
	say("＜重阳宫？过儿生性顽皮，重阳宫那等清修之所，他能适应吗？＞", 0, 1);
	addevent(19, 50, 0, 3528, 3, 0, 32, 49)
end

OEVENTLUA[3528] = function() --神雕线，杨过逃出重阳宫
	dark()
	addevent(19, 51, 0, 0, 0, 4551*2, 25, 34)--鹿清笃
	addevent(19, 52, 0, 0, 0, 4625*2, 25, 39)--杨过
	addevent(19, 53, 0, 0, 0, 3053*2, 22, 33)--观众
	addevent(19, 54, 0, 0, 0, 3053*2, 22, 34)--
	addevent(19, 55, 0, 0, 0, 3053*2, 22, 35)--
	addevent(19, 56, 0, 0, 0, 3053*2, 22, 36)--
	addevent(19, 57, 0, 0, 0, 3053*2, 22, 37)--
	addevent(19, 58, 0, 0, 0, 3053*2, 22, 38)--
	addevent(19, 59, 0, 0, 0, 3053*2, 22, 39)--
	addevent(19, 60, 0, 0, 0, 3053*2, 22, 40)--
	light()
	instruct_30(0,12,0,0);
	instruct_30(3,0,0,0);
	say("＜我倒要看看这杨过小子到底会不会功夫。＞", 68, 1,"崔志方");
	say("清笃，你与杨师弟过过招，下手有分寸些，别太重了！", 68, 1,"崔志方");
	say("＜这小子首日上山，便使诈令我险些烧死，此后我受尽师兄弟的讥笑，说我本事还不及一个小小孩儿。今天我便要他好看！＞", 180, 1,"鹿清笃");
	say("遵命！", 180, 1,"鹿清笃");
	say("鹿清笃右掌打出，这一掌“虎门手”劲力不小，砰的一响，正中杨过胸口。若非杨过已有内功护体，非当场口喷鲜血不可。", 928, 2);
	say("鹿清笃见一掌打杨过不倒，接连又出数拳，杨过被殴得昏天黑地，摇摇幌幌的就要跌倒，不知怎地，忽然间一股热气从丹田中直冲上来。", 928, 2);
	say("这时鹿清笃一拳又向杨过面门击至，闪无可闪，避无可避，杨过自然而然的双腿一弯，口中阁的一声叫喝，手掌推出，正中鹿清笃小腹。", 928, 2);
	dark()
	null(19,51)
	addevent(19, 61, 0, 0, 0, 2720*2, 25, 34)--鹿清笃倒地
	light()
	say("杨过！你学的这是什么妖法！", 406, 1,"赵志敬");
	say("杨过心知已闯下了大祸，昏乱中不及细想，掌下撒腿便奔。赵志敬立传号令，命众人分头追拿杨过。", 928, 2);
	dark()
	null(19,52)
	light()
	say("且慢！", 0, 1);
	if WarMain(73) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	say("阁下是何人？竟敢来管我全真教的闲事？", 406, 1,"赵志敬");
	say("不敢，只是这位杨过小兄弟与我曾有几面之缘，这次他自知闯祸，定然不敢回来见你们，不如由我去将他寻回，再来给诸位一个交代。", 0, 1);
	say("哼，那就有劳了。", 406, 1,"赵志敬");
	say("＜不知杨过跑去了哪里，我先在这附近找一找吧。＞", 0, 1);
	dark()
	for i = 52, 61 do
		null(19,i)
	end
	null(19,50)
	addevent(18, 20, 1, 3529, 1, 4622*2, 23, 31) --古墓杨过
	addevent(18, 21, 1, 3530, 1, 3621*2, 23, 30) --古墓龙女
	addevent(18, 22, 1, 3531, 1, 3565*2, 25, 27) --古墓孙婆婆
	light()
end

OEVENTLUA[3529] = function()--古墓杨过
	say("大哥！你来了，我在树林中昏倒，是这位老婆婆救了我。", 41, 1,"杨过");
end

OEVENTLUA[3530] = function()--古墓龙女
	say("……", 59, 1,"小龙女");
	say("眼前的少女披著一袭轻纱般的白衣，犹似身在烟中雾里，看来约莫十六七岁年纪，除了一头黑发之外，全身雪白，面容秀美绝俗。", 928, 2);
	say("＜好一个清丽脱俗的女子！＞", 0, 1);
end

OEVENTLUA[3531] = function()--古墓孙婆婆
	say("姑娘，这孩子若是回到重阳宫中，他师父定要难为他。", 117, 1,"孙婆婆");
	say("你送他回去，跟他师父说说，教他别难为孩子。", 59, 1,"小龙女");
	say("唉，旁人教门中的事，咱们也管不著。", 117, 1,"孙婆婆");
	say("你送一瓶玉蜂蜜浆去，再跟他说，那老道不能不依。", 59, 1,"小龙女");
	say("杨过霍地站起，向二人作了一揖。", 928, 2);
	say("多谢婆婆和姑姑医伤，我这便走。", 41, 1,"杨过");
	say("孩子，非是我们姑娘不肯留你过宿，实是此处向有严规，不容旁人入来，你别难过。", 117, 1,"孙婆婆");
	say("婆婆说哪里话来？咱们后会有期了。", 41, 1,"杨过");
	say("孙婆婆叹了口气，她知小龙女自来执拗，多说也是无用，只是望著杨过，目光中甚有怜惜之意。", 928, 2);
	say("你不认得路，我带你出去。", 117, 1,"孙婆婆");
	if JY.Person[58]["武功1"] == 90 then
		say("这样吧，我与二位同去。", 0, 1);
		say("也好。", 59, 1,"小龙女");
		null(109,0)
		null(109,1)
		transferme(109, 41, 31, 2)
		instruct_30(4,0,0,0);
		for i = 20, 22 do
			null(18,i)
		end
		say("三人出了墓门，穿过丛林，来到林前空地。月光下只见六七名道人一排站著。群道见到杨过，轻声低语，不约而同的走上了几步。", 928, 2);
		dark()
		addevent(109, 30, 0, 0, 0, 3053*2, 34, 28)
		addevent(109, 31, 0, 0, 0, 3053*2, 34, 29)
		addevent(109, 32, 0, 0, 0, 3053*2, 34, 30)
		addevent(109, 33, 0, 0, 0, 3053*2, 34, 31)
		addevent(109, 34, 0, 0, 0, 3053*2, 34, 32)
		addevent(109, 35, 0, 0, 0, 3053*2, 34, 33)
		addevent(109, 36, 0, 0, 0, 4624*2, 37, 32)--杨过
		addevent(109, 37, 0, 0, 0, 3565*2, 36, 29)--孙婆婆
		light()
		say("全真门下弟子甄志丙，奉师命拜见龙姑娘。", 204, 1,"甄志丙");
		say("我在这里，要杀要剐，全凭你们就是。", 41, 1,"杨过");
		say("群道人料不到他小小一个孩儿居然这般刚硬，都是出乎意料之外。一个道人抢将上来，伸手抓住杨过後领拖了过去。", 928, 2);
		say("我又不逃，你急什么？", 41, 1,"杨过");
		say("这道人是赵志敬的大弟子，心想做徒弟的居然会对师父如此忤逆，实是无法无天之至，听杨过出言冲撞，顺手在他头上就是一拳。", 928, 2);
		say("孙婆婆本欲与群道好言相说，眼见杨过被人强行拖去，已是大为不忍，突然见他被殴，心头怒火哪里还按捺得下？", 928, 2);
		say("立时大踏步上前，衣袖一抖，拂在那道人手上。那人只觉手腕上热辣辣的一阵剧痛，不由得松手，待要喝问，孙婆婆已将杨过抱起，转身而行。", 928, 2);
		say("放人下来！", 700, 1,"群道");
		say("你们要怎地？", 117, 1,"孙婆婆");
		say("大家散开，不得在前辈面前无礼。", 204, 1,"甄志丙");
		say("弟子甄志丙拜见前辈。", 204, 1,"甄志丙");
		say("干什么？", 117, 1,"孙婆婆");
		say("这孩子是我全真教的弟子，请前辈赐还。", 204, 1,"甄志丙");
		say("你们当我之面，已将他这般毒打，待得拉回道观之中，更不知要如何折磨他。要我放回，万万不能！", 117, 1,"孙婆婆");
		say("这孩子顽劣无比，欺师灭祖，大壤门规。武林中人讲究的是敬重师长，敝教责罚于他，想来也是应该的。", 204, 1,"甄志丙");
		say("什么欺师灭祖，全是一面之词。", 117, 1,"孙婆婆");
		say("孩子跟这胖道士比武，是你们全真教自己定下的规矩。他本来不肯比，给你们硬逼著下场。既然动手，自然有输有赢，这胖道人自己不中用，又怪得谁了？", 117, 1,"孙婆婆");
		say("这是我的弟子，爱打爱骂，全凭于我。不许师父管弟子，武林中可有这等规矩？", 406, 1,"赵志敬");
		say("我偏不许你管教，那便怎么？", 117, 1,"孙婆婆");
		say("这孩子是你什么人？你凭什么来横加插手？", 406, 1,"赵志敬");
		say("他早不是你全真教的门人啦。这孩子已改拜我家小龙女姑娘为师，他好与不好，天下只小龙女姑娘一人管得。你们乘早别来多管闲事。", 117, 1,"孙婆婆");
		say("杨过，此事当真？", 406, 1,"赵志敬");
		say("臭道士，贼头狗脑的山羊胡子牛鼻子，你这般打我，我为什么还认你为师？不错，我已拜了孙婆婆为师，又拜了龙姑姑为师啦。", 41, 1,"杨过");
		say("赵志敬气得胸口几欲炸裂，飞身而起，双手往杨过肩头抓去。孙婆婆右臂格出，碰向赵志敬手腕。", 928, 2);
		say("得罪！", 204, 1,"甄志丙");
		if WarMain(73) == false then
			instruct_15(0);   
			instruct_0();  
			do return; end			
		end
		for i = 30, 35 do
			null(109,i)
		end
		say("婆婆，你没事吧？", 41, 1,"杨过");
		say("好孩子，我没事。我们这就回古墓，我定会说服小龙女姑娘收留了你。", 117, 1,"孙婆婆");
		dark()
		null(109,36)
		null(109,37)
		light()
		say("＜这婆婆相貌虽丑，心肠倒是很好。但愿杨过小兄弟这次能平安。＞", 0, 1);
		addevent(18, 23, 1, 3533, 1, 2644*2, 14, 20)--古墓孙婆婆
		addevent(18, 24, 1, 3534, 1, 4623*2, 15, 16)--古墓杨过
		addevent(18, 25, 1, 3535, 1, 3034*2, 16, 16)--古墓小龙女
	else
		say("＜这样也好，我先回去吧。＞", 0, 1);
		transferme(70, 8, 28, 1)
		for i = 20, 22 do
			null(18,i)
		end
		say("＜数月不见，不知杨过小兄弟在重阳宫过的如何了，我去看看吧。＞", 0, 1);
		addevent(19, 62, 1, 3532, 1, 3054*2, 36, 34)
	end
end

OEVENTLUA[3532] = function()--杨过未回重阳宫
	say("杨过？自从那日他逃下山去，就再没回来过。", 291, 1);
	dark()
	null(19,62)
	addevent(18, 24, 1, 3537, 1, 4623*2, 15, 16)--古墓杨过
	addevent(18, 25, 1, 3538, 1, 3034*2, 16, 16)--古墓小龙女
	light()
	say("＜难道当日发生了什么变故？我还是去古墓再看看。＞", 0, 1);
end

OEVENTLUA[3533] = function()--孙婆婆未死
	say("唉，小龙女姑娘终究是不肯收留这孩子。", 117, 1,"孙婆婆");
	say("少侠，老婆子这一生从没求过人，我看你也是个好心人，能不能请你代为照顾这孩子？", 117, 1,"孙婆婆");
	say("婆婆不必多礼，婆婆所托，晚辈自当尽力。", 0, 1);
	say("那就多谢少侠了。", 117, 1,"孙婆婆");
	dark()
	null(18,24)
	teammate(58)
	null(80,150)
	addevent(80, 150, 1, 3536, 1, 4712*2, 15, 21) -- 华山后山
	light()
	say("＜虽然答应了，但我闯荡江湖，前路漂泊无定，带着个孩子总是不方便，还是得给他找个安身之所才是。＞", 0, 1);
end

OEVENTLUA[3534] = function()
	say("大哥好。", 41, 1,"杨过");
end

OEVENTLUA[3535] = function()
	say("……", 59, 1,"小龙女");
end

OEVENTLUA[3536] = function() -- 杨过入一刀流
	if hasppl(58) then
		dark()
		addevent(80, 151, 1, 3536, 1, 4624*2, 16, 22) -- 华山后山
		light()
		say("找了一年也没有找到谢云流，这坑爹的风花小雪，我还是回东瀛去吧。", 578, 1,"谢无忧");
		say("大姐姐，你真厉害。", 41, 1,"杨过");
		say("你怎么知道我厉害？", 578, 1,"谢无忧");
		say("隔壁的大叔都打不过你，你自然是厉害了。", 41, 1,"杨过");
		say("你这小家伙倒是会说话，我正好打算收个弟子回去，看你悟性也不差，不如跟我走吧？", 578, 1,"谢无忧");
		say("好啊！", 41, 1,"杨过");
		say("大哥，再见！", 41, 1,"杨过");
		dark()
		null(80,150)
		null(80,151)
		instruct_21(58) -- 杨过离队
		light()
		say("这么快就走了，也好，让这孩子出去锻炼一下。", 0, 1);
		JoinMP(58, 11, 3)
	else
		say("……", 578, 1,"谢无忧");
	end
end

OEVENTLUA[3537] = function() -- 杨过入古墓
	say("小兄弟，你在这儿啊？怎么不见那位婆婆？", 0, 1);
	say("大哥，那日婆婆送我回重阳宫，不想……遭了那帮贼道人的毒手，她临终之前托付龙姑姑照顾我，我这才留了下来。", 41, 1,"杨过");
	say("过儿，祖师婆婆这套功夫叫作‘玉女心经’须得二人同练，互为臂助。", 59, 1,"小龙女");
	say("是，姑姑。", 41, 1,"杨过");
	JoinMP(58, 3, 2)
	null(18,24)
	addevent(18, 24, 1, 3538, 1, 4623*2, 15, 16)--古墓杨过
	for i = 0, 9 do
		null(62,i)
	end
	--addevent(62, 10, 1, 3539, 1, 3621*2, 19, 34) -- 破庙小龙女，暂时弃用
	addevent(62, 11, 0, 3540, 3, 0, 44, 24) -- 杨龙分离事件
	addevent(62, 12, 0, 3540, 3, 0, 44, 25)
	addevent(62, 13, 0, 3540, 3, 0, 44, 26)
	addevent(62, 14, 1, 0, 0, 3093*2, 33, 25)--杨过
	addevent(62, 15, 1, 0, 0, 3034*2, 34, 24)--龙女
	say("＜杨过小兄弟这次应该是安定下来了，希望他能跟着龙姑娘好好学武。＞", 0, 1);	
end

OEVENTLUA[3538] = function() -- 杨过入古墓
	say("过儿，祖师婆婆这套功夫叫作‘玉女心经’须得二人同练，互为臂助。", 59, 1,"小龙女");
	say("是，姑姑。", 41, 1,"杨过");
end

--[[OEVENTLUA[3539] = function() -- 骑龙未遂事件，暂时弃用
	say("咦？这不是龙姑娘么？怎么被人点了穴道？", 0, 1);	
	say("有人！", 0, 1);
	SetS(106, 63, 1, 0, 0)
   	SetS(106, 63, 2, 0, 291)
	if WarMain(288) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	say("甄志丙遁去", 928, 2);
	say(JY.Person[zj()]["姓名"].."解开小龙女穴道", 928, 2);
	say("龙姑娘，你怎么到了这里？", 0, 1);
	say("多谢少侠相助，事情是这样的……", 59, 1,"小龙女");
	say("小龙女讲述了李莫愁如何来抢夺玉女心经，自己和杨过是又如何离开古墓，到了这里。", 928, 2);
	say("那大胡子疯汉原来是过儿的义父。他要传授过儿武功，怕我跟去偷学，便点了我的穴道。", 59, 1,"小龙女");
	say("原来是这样。", 0, 1);
	dark()
	addevent(62, 11, 1, 3539, 1, 3621*2, 20, 34) -- 破庙杨过
	light()
	say("大哥？你怎么在这？", 41, 1,"杨过");
	say("方才我被你义父点了穴道，又被人偷袭，多亏这位少侠相助。", 59, 1,"小龙女");
	say("是什么人？", 41, 1,"杨过");
	say("那人蒙着面，看不清脸，看装束似乎是全真派弟子。", 0, 1);
	say("姑姑，我义父患病已深，性子又古怪，你别同他计较。", 41, 1,"杨过");
	say("没事。", 59, 1,"小龙女");
	say("这一年来，那遗刻上的法门，我们也练的差不多了。我同你下山去找你义父吧。", 59, 1,"小龙女");
	say("大哥，就此别过。", 41, 1,"杨过");
	dark()
	null(62,10) -- 杨龙离开
	null(62,11)
	light()
end ]]

OEVENTLUA[3540] = function() -- 杨龙分离事件
	null(62,11)
	null(62,12)
	null(62,13)
	null(18,24)
	null(18,25)
	instruct_30(8,0,0,0);
    JY.Person[58]["武功2"] = 121
    JY.Person[58]["武功等级2"] = 999
	JY.Person[58]["武功3"] = 119
    JY.Person[58]["武功等级3"] = 999
	JY.Person[58]["武功4"] = 107
    JY.Person[58]["武功等级4"] = 1
	JY.Person[58]["武功5"] = 104
    JY.Person[58]["武功等级5"] = 999
	JY.Person[58]["武功6"] = 42
    JY.Person[58]["武功等级6"] = 999
	JY.Person[58]["武功7"] = 39
  	JY.Person[58]["武功等级7"] = 999
	JY.Person[58]["半身像"] = 172
	JY.Person[58]["声望"] = 121
	JY.Person[58]["拳掌功夫"] = JY.Person[58]["拳掌功夫"]+50
	JY.Person[58]["御剑能力"] = JY.Person[58]["御剑能力"]+50
	JY.Person[58]["耍刀技巧"] = 30
	JY.Person[58]["特殊兵器"] = JY.Person[58]["特殊兵器"]+20
	JY.Person[58]["暗器技巧"] = JY.Person[58]["暗器技巧"]+20
	JY.Person[58]["等级"] = 5
	JY.Person[58]["实战"] = 50
	JY.Person[58]["攻击力"]=JY.Person[58]["攻击力"]+100
    JY.Person[58]["防御力"]=JY.Person[58]["防御力"]+50
	JY.Person[58]["轻功"]=JY.Person[58]["轻功"]+100
	QZXS("杨过学会玉女心经！")
	QZXS("杨过学会天罗地网！")
	QZXS("杨过学会九阴神功！")
	QZXS("杨过学会逆运筋脉！")
	QZXS("杨过学会玉女素心剑！")
	say("龙姑娘？这位是……杨兄弟？", 0, 1);
	say("大哥，好久不见。", 172, 1,"杨过");
	say("是啊，自从上次一别，已经有几个年头了。我差点都认不出你了。你们怎么会在这儿？", 0, 1);
	say("是这样。", 172, 1,"杨过");
	say("杨过讲述了李莫愁如何来抢夺玉女心经，自己和小龙女是又如何离开古墓，到了这里，遇到义父。", 928, 2);
	say("姑姑，我义父做事颠三倒四，你莫跟他一般见识。", 172, 1,"杨过");
	say("你还叫我姑姑？", 59, 1,"小龙女");
	say("我不叫你姑姑叫什么？要我叫师父么？", 172, 1,"杨过");
	say("你这般对我，我还能做你师父么？", 59, 1,"小龙女");	
	say("我……我怎么啦？", 172, 1,"杨过");
	say("小龙女淡淡一笑，卷起衣袖，露出一条雪藕也似的臂膀，但见洁白似玉，竟无半分瑕疵，本来一点殷红的守宫砂已不知去向。", 928, 2);
	say("你瞧。", 59, 1,"小龙女");	
	say("姑姑，我不懂啊。", 172, 1,"杨过");
	say("你怎么仍是叫我姑姑？难道你没真心待我么？", 59, 1,"小龙女");	
	say("小龙女见杨过不答，心中焦急起来。", 928, 2);
	say("你到底当我是什么人？", 59, 1,"小龙女");
	say("你是我师父，你怜我教我，我发过誓，要一生一世敬你重你，听你的话。", 172, 1,"杨过");
	say("难道你不当我是你妻子？", 59, 1,"小龙女");
	say("不，不！你不能是我妻子，我怎么配？你是我师父，是我姑姑。", 172, 1,"杨过");
	say("小龙女气得全身发抖，突然“哇”的一声，喷出一口鲜血。", 928, 2);
	say("龙姑娘！", 0, 1);
	say("姑姑！", 172, 1,"杨过");
	say("小龙女听杨过仍是这么叫，狠狠凝视著他，举起左掌，便要向他天灵盖拍落，但这一掌始终落不下去，她目光渐渐的自恼恨转为怨责，又自怨责转为怜惜，叹了一口长气。", 928, 2);
	say("既是这样，以后你别再见我。", 59, 1,"小龙女");
	dark()
	null(62,15) -- 龙女离开
	light()
	say("大哥，姑姑这是生我的气了吗？可我真的不知道做错了什么。", 172, 1,"杨过");
	say("杨兄弟莫慌，此事颇有蹊跷。你不妨再把事情经过向我详细讲一遍，我们再一起找回你姑姑，向她解释清楚。", 0, 1);
	say("好，那就打扰大哥了。不过我想先找到义父，他年纪大了，又有疯病在身，我担心他。", 172, 1,"杨过");
	teammate(58)
	null(62,14)
	addevent(80, 152, 0, 3541, 3, 0, 49, 36)
end

OEVENTLUA[3541] = function() -- 华山绝顶事件
	if hasppl(58) == false then
		do return end
	end	
	dark()
	addevent(80, 153, 0, 0, 0, 3985*2, 31, 25)-- 欧阳锋
	addevent(80, 154, 0, 0, 0, 4000*2, 31, 33)-- 洪七公
	light()
	instruct_30(12,0,0,0);
	instruct_30(0,7,0,0);
	instruct_30(2,0,0,0);
	dark()
	addevent(80, 155, 0, 0, 0, 3093*2, 28, 29)-- 杨过
	light()
	say("爸爸！洪老前辈！", 172, 1,"杨过");
	say("爸爸！这些日子你在哪儿？", 172, 1,"杨过");
	say("我在找你。", 60, 1,"欧阳锋");
	say("爸爸，你就是欧阳锋。这位洪老前辈是好人，你别跟他打架了。", 172, 1,"杨过");
	say("他是欧阳锋，欧阳锋是坏人。", 60, 1,"欧阳锋");
	say("不错，欧阳锋是坏人，欧阳锋该死。", 69, 1,"洪七公");
	say("洪老前辈，他是我的义父。你怜他身患重病，神智胡涂，别跟他为难了罢。", 172, 1,"杨过");
	say("好小子，原来他是你义父。", 69, 1,"洪七公");
	say("欧阳锋，咱们拳脚比不出胜败，再比兵器。", 60, 1,"欧阳锋");
	say("臭蛤蟆，你服了我么？", 69, 1,"洪七公");
	say("服什么？我还有许多武功尚未使出，若是尽数施展，定要打得你一败涂地。", 60, 1,"欧阳锋");
	say("正巧我也有好多武功未用。你听见过丐帮的打狗棒法没有？", 69, 1,"洪七公");
	say("打狗棒法有什么了不起？", 60, 1,"欧阳锋");
	say("洪七公日前与欧阳锋拼斗，已耗损了大半力气，眼下已经使不出这路打狗棒法，但听得欧阳锋这么说，心中甚不服气。", 928, 2);
	say("小子，你过来。我这有一套武功传给你。这武功向来只传本帮帮主，不传旁人，只是你义父出言小觑於我，我却要你演给他瞧瞧。", 69, 1,"洪七公");
	say("老前辈这武功既然不传外人，晚辈以不学为是。", 172, 1,"杨过");
	say("臭蛤蟆，你义儿知道你敌不过我的打狗棒法，不肯摆式子给你瞧。", 69, 1,"洪七公");
	say("孩儿，我还有好些神奇武功未曾使用，怕他怎地？快摆出来我瞧。", 60, 1,"欧阳锋");
	say("两人如此大费唇舌的比武，比到傍晚，也不过拆了十来招，杨过却已累得满身大汗。次晨又比，直过了三天，三十六路棒法方始说完。", 928, 2);
	say("到这日傍晚，洪七公将第三十六路棒法“天下无狗”的第六变说了，这是打狗棒法最後一招最後一变的绝招，棒法之精妙，已臻武学中的绝诣。", 928, 2);
	say("当晚，欧阳锋翻来覆去，折腾了一夜，直到次晨。", 928, 2);
	dark()
	light()
	say("有了，有了。孩儿，你便以这杖法破他。", 60, 1,"欧阳锋");
	say("杨过向他望去，欧阳锋虽然年老，但因内功精湛，须发也只略现灰白，而昨晚用心过度，一夜之间竟然须眉尽白，似乎忽然老了十多岁。", 928, 2);
	say("爸爸……", 172, 1,"杨过");
	say("杨过心中难过，欲求洪七公休要再比，欧阳锋却连声相催。这一招十分繁复，欧阳锋反覆解说，杨过方行领悟，于是依式演了出来。", 928, 2);
	JY.Person[58]["武功8"] = 80
	JY.Person[58]["武功等级8"] = 999
	JY.Person[58]["武功9"] = 120
  	JY.Person[58]["武功等级9"] = 999
	JY.Person[58]["特殊兵器"] = JY.Person[58]["特殊兵器"]+100
	JY.Person[58]["实战"] = JY.Person[58]["实战"]+50
	JY.Person[58]["攻击力"]=JY.Person[58]["攻击力"]+50
    JY.Person[58]["防御力"]=JY.Person[58]["防御力"]+50
	JY.Person[58]["轻功"]=JY.Person[58]["轻功"]+50
	QZXS("杨过学会打狗棒法！")
	QZXS("杨过学会灵蛇杖法！")
	instruct_0();   --  0(0)::空语句(清屏)
	local title = "西毒/北丐真传";
	local str = "可以获得一种武功秘籍，请选择"
	local btn = {"灵蛇杖法","打狗棒法"};
	local num = #btn;
	local r = JYMsgBox(title,str,btn,num);
	if r == 1 then
	    addthing(251)
		SetS(106, 63, 1, 0, 58)
 		SetS(106, 63, 2, 0, 69)
		if WarMain(288) == false then
            instruct_14();   --  14(E):场景变黑
   	        instruct_0();   --  0(0)::空语句(清屏)
			instruct_13();   --  13(D):重新显示场景
		else
			addHZ(105)
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_14();   --  14(E):场景变黑
			instruct_0();   --  0(0)::空语句(清屏)
 			instruct_13();   --  13(D):重新显示场景
		end		
	elseif r == 2 then
		addthing(167)
		SetS(106, 63, 1, 0, 58)
	   	SetS(106, 63, 2, 0, 60)
		if WarMain(288) == false then
	        instruct_14();   --  14(E):场景变黑
	        instruct_0();   --  0(0)::空语句(清屏)
	        instruct_13();   --  13(D):重新显示场景
		else
			addHZ(106)
	        instruct_0();   --  0(0)::空语句(清屏)
	        instruct_14();   --  14(E):场景变黑
	        instruct_0();   --  0(0)::空语句(清屏)
	        instruct_13();   --  13(D):重新显示场景
		end
	end
	say("老毒物，欧阳锋！老叫化今日服了你啦。", 69, 1,"洪七公");
	say("我是欧阳锋！我是欧阳锋！我是欧阳锋！你是老叫化洪七公！", 60, 1,"欧阳锋");
	say("爸爸！老前辈！", 172, 1,"杨过");
	say("北丐西毒数十年来反覆恶斗，互不相下，竟同时在华山绝顶归天。两人毕生怨愤纠结，临死之际却相抱大笑。数十年的深仇大恨，一笑而罢！", 928, 2);
	dark()
	null(80,153)
	null(80,154)
	null(80,155)
	light()
	instruct_30(0,10,0,0);
	dark()
	addevent(80, 156, 1, 3543, 1, 1385*2, 34, 15)
	addevent(80, 157, 1, 3542, 1, 1385*2, 35, 15)-- 加洪七欧阳锋墓
	addevent(75, 78, 1, 3544, 1, 3044*2, 25, 12) -- 桃花岛增加郭靖
	addevent(75, 79, 1, 3544, 1, 3045*2, 27, 12) -- 桃花岛增加黄蓉
	addevent(75, 80, 1, 3545, 1, 4581*2, 18, 27) -- 桃花岛增加大武
	addevent(75, 81, 1, 3546, 1, 4577*2, 18, 26) -- 桃花岛增加小武
	addevent(75, 82, 1, 3547, 1, 4587*2, 19, 24) -- 桃花岛增加郭芙
	light()
	say("杨兄弟……", 0, 1);
	say("大哥，我想回桃花岛看看郭伯父他们，顺便告知洪老前辈的死讯。", 172, 1,"杨过");	
	say("嗯，我们走吧。", 0, 1);
	addthing(252)
end

OEVENTLUA[3542] = function() --欧阳锋墓
	say("西毒欧阳锋之墓", 928, 2);
end

OEVENTLUA[3543] = function() --洪七公墓
	say("北丐洪七公之墓", 928, 2);
end

OEVENTLUA[3544] = function() -- 再遇郭靖黄蓉
	if hasppl(58) == false then
		say("……", 55, 1,"郭靖");
	else
		say("郭伯父，黄伯母。", 172, 1,"杨过");	
		say("过儿？过几日在陆家庄有英雄大宴，你同少侠一起来吧。", 55, 1,"郭靖");
		say("是。", 172, 1,"杨过");	
		JY.Scene[54]["名称"] = "陆家庄"
		addevent(54, 50, 0, 3548, 3, 0, 43, 31) -- 英雄大会
		addevent(54, 51, 0, 3548, 3, 0, 43, 30) -- 英雄大会
	end
end

OEVENTLUA[3545] = function() -- 大武
	if hasppl(58) == false then
		say("我叫武敦儒。", 700, 1,"武敦儒");
	else
		say("两位武兄，别来安好。", 172, 1,"杨过");	
		say("恕小弟眼拙，尊兄是谁？", 700, 1,"武敦儒");
	end
end

OEVENTLUA[3546] = function() -- 小武
	if hasppl(58) == false then
		say("我叫武修文。", 700, 1,"武修文");
	else
		say("两位武兄，别来安好。", 172, 1,"杨过");	
		say("恕小弟眼拙，尊兄是谁？", 700, 1,"武修文");
	end
end

OEVENTLUA[3547] = function() -- 郭芙
	if hasppl(58) == false then
		say("……", 358, 1,"郭芙");
	else
		say("杨大哥？你不在这住几天吗？", 358, 1,"郭芙");	
		say("不了。", 172, 1,"杨过");
	end
end

OEVENTLUA[3548] = function() --神雕古墓线，英雄大会
	if hasppl(58) == false then
		do return end
	end	
	dark()
	--右侧
	addevent(54, 52, 0, 0, 0, 2602*2, 28, 23) -- 英雄大会观众
	addevent(54, 53, 0, 0, 0, 2602*2, 29, 23) -- 英雄大会观众
	addevent(54, 54, 0, 0, 0, 2602*2, 30, 23) -- 英雄大会观众
	addevent(54, 55, 0, 0, 0, 3054*2, 31, 23) -- 英雄大会观众
	addevent(54, 56, 0, 0, 0, 3054*2, 32, 23) -- 英雄大会观众
	addevent(54, 57, 0, 0, 0, 3054*2, 33, 23) -- 英雄大会观众
	addevent(54, 58, 0, 0, 0, 2703*2, 34, 23) -- 英雄大会观众
	addevent(54, 59, 0, 0, 0, 2703*2, 35, 23) -- 英雄大会观众
	addevent(54, 60, 0, 0, 0, 2703*2, 36, 23) -- 英雄大会观众
	addevent(54, 61, 0, 0, 0, 3133*2, 37, 23) -- 英雄大会观众
	addevent(54, 62, 0, 0, 0, 3133*2, 38, 23) -- 英雄大会观众
	addevent(54, 63, 0, 0, 0, 3133*2, 39, 23) -- 英雄大会观众
	addevent(54, 64, 0, 0, 0, 2602*2, 28, 24) -- 英雄大会观众
	addevent(54, 65, 0, 0, 0, 2602*2, 29, 24) -- 英雄大会观众
	addevent(54, 66, 0, 0, 0, 2602*2, 30, 24) -- 英雄大会观众
	addevent(54, 67, 0, 0, 0, 3054*2, 31, 24) -- 英雄大会观众
	addevent(54, 68, 0, 0, 0, 3054*2, 32, 24) -- 英雄大会观众
	addevent(54, 69, 0, 0, 0, 3054*2, 33, 24) -- 英雄大会观众
	addevent(54, 70, 0, 0, 0, 2703*2, 34, 24) -- 英雄大会观众
	addevent(54, 71, 0, 0, 0, 2703*2, 35, 24) -- 英雄大会观众
	addevent(54, 72, 0, 0, 0, 2703*2, 36, 24) -- 英雄大会观众
	addevent(54, 73, 0, 0, 0, 3133*2, 37, 24) -- 英雄大会观众
	addevent(54, 74, 0, 0, 0, 3133*2, 38, 24) -- 英雄大会观众
	addevent(54, 75, 0, 0, 0, 3133*2, 39, 24) -- 英雄大会观众
	--左侧
	addevent(54, 76, 0, 0, 0, 2603*2, 28, 32) -- 英雄大会观众
	addevent(54, 77, 0, 0, 0, 2603*2, 29, 32) -- 英雄大会观众
	addevent(54, 78, 0, 0, 0, 2603*2, 30, 32) -- 英雄大会观众
	addevent(54, 79, 0, 0, 0, 3055*2, 31, 32) -- 英雄大会观众
	addevent(54, 80, 0, 0, 0, 3055*2, 32, 32) -- 英雄大会观众
	addevent(54, 81, 0, 0, 0, 3055*2, 33, 32) -- 英雄大会观众
	addevent(54, 82, 0, 0, 0, 2704*2, 34, 32) -- 英雄大会观众
	addevent(54, 83, 0, 0, 0, 2704*2, 35, 32) -- 英雄大会观众
	addevent(54, 84, 0, 0, 0, 2704*2, 36, 32) -- 英雄大会观众
	addevent(54, 85, 0, 0, 0, 3134*2, 37, 32) -- 英雄大会观众
	addevent(54, 86, 0, 0, 0, 3134*2, 38, 32) -- 英雄大会观众
	addevent(54, 87, 0, 0, 0, 3134*2, 39, 32) -- 英雄大会观众
	addevent(54, 88, 0, 0, 0, 2603*2, 28, 33) -- 英雄大会观众
	addevent(54, 89, 0, 0, 0, 2603*2, 29, 33) -- 英雄大会观众
	addevent(54, 90, 0, 0, 0, 2603*2, 30, 33) -- 英雄大会观众
	addevent(54, 91, 0, 0, 0, 3055*2, 31, 33) -- 英雄大会观众
	addevent(54, 92, 0, 0, 0, 3055*2, 32, 33) -- 英雄大会观众
	addevent(54, 93, 0, 0, 0, 3055*2, 33, 33) -- 英雄大会观众
	addevent(54, 94, 0, 0, 0, 2704*2, 34, 33) -- 英雄大会观众
	addevent(54, 95, 0, 0, 0, 2704*2, 35, 33) -- 英雄大会观众
	addevent(54, 96, 0, 0, 0, 2704*2, 36, 33) -- 英雄大会观众
	addevent(54, 97, 0, 0, 0, 3134*2, 37, 33) -- 英雄大会观众
	addevent(54, 98, 0, 0, 0, 3134*2, 38, 33) -- 英雄大会观众
	addevent(54, 99, 0, 0, 0, 3134*2, 39, 33) -- 英雄大会观众
	addevent(54, 100, 0, 0, 0, 3619*2, 26, 29) -- 郭靖
	addevent(54, 101, 0, 0, 0, 3620*2, 26, 27) -- 黄蓉
	addevent(54, 102, 0, 0, 0, 4588*2, 23, 27) -- 郭芙
	addevent(54, 103, 0, 0, 0, 4581*2, 23, 28) -- 大武
	addevent(54, 104, 0, 0, 0, 4577*2, 23, 29) -- 小武
	light()
	if JY.Base["人Y1"] == 31 then		--两个触发地方的移动方式不一样
		instruct_30(3,0,0,0);
		instruct_30(0,9,0,0);
		instruct_30(13,0,0,0);
		instruct_30(0,-2,0,0);
	else
		instruct_30(3,0,0,0);
		instruct_30(0,8,0,0);
		instruct_30(13,0,0,0);
		instruct_30(0,-2,0,0);
	end
	dark()
	addevent(54, 105, 0, 0, 0, 3094*2, 26, 24) -- 杨过
	light()
	say("黄蓉按着帮规宣布后，将历代帮主相传的打狗棒交给了鲁有脚，众弟子一齐向他唾吐，只吐得他满头满身都是痰涎，于是新帮主接任之礼告成。", 928, 2);
	say("洪老帮主有令，命我传达。", 700, 1,"丐帮弟子");
	say("恭祝洪老帮主安好！", 700, 1,"众丐");
	say("＜众人这等欢欣，我又何忍将洪老帮主逝世的讯息说了出来？何况我人微言轻，述说这等大事，他们未必肯信。我何必扫他们的兴？＞", 172, 1,"杨过");	
	say("迎接贵宾！", 700, 1,"陆冠英");
	dark()
	addevent(54, 106, 0, 0, 0, 4108*2, 31, 28) -- 金轮
	addevent(54, 107, 0, 0, 0, 3032*2, 30, 26) -- 霍都
	addevent(54, 108, 0, 0, 0, 3381*2, 33, 27) -- 达尔巴等人
	addevent(54, 109, 0, 0, 0, 3381*2, 33, 28) -- 
	addevent(54, 110, 0, 0, 0, 3381*2, 33, 29) -- 
	addevent(54, 111, 0, 0, 0, 3381*2, 34, 27) -- 
	addevent(54, 112, 0, 0, 0, 3381*2, 34, 28) -- 
	addevent(54, 113, 0, 0, 0, 3381*2, 34, 29) --
	light()
	say("各位远道到来，就请入座喝上几杯。", 55, 1,"郭靖");
	say("师父，我给你老人家引见中原两位大名鼎鼎的英雄……", 84, 1,"霍都");
	say("这位是做过咱们蒙古西征右军元帅的郭靖郭大侠，这位是郭夫人，也即是丐帮的黄帮主。", 84, 1,"霍都");
	say("这位是在下的师尊，西藏圣僧，人人尊称金轮法王，当今大蒙古国皇后封为第一护国大师。", 84, 1,"霍都");
	say("盛会难得，良时不再，天下英雄尽聚于此，依小王之见，须得推举一位群雄的盟主，领袖武林，以为天下豪杰之长，各位以为如何？", 84, 1,"霍都");
	say("这话不错。我们已推举了丐帮洪老帮主为群雄盟主，现下正在推举副盟主，阁下有何高见？", 700, 1,"雷猛");
	say("莫说洪七公此时死活难知，就算他好端端的坐在此处，凭他的武功德望，又怎及得上我师父金轮法王？", 84, 1,"霍都");
	say("群雄听了这一番话，都已明白这些人的来意。若金轮法王凭武功夺得盟主，中原豪杰虽然决不会听他号令，却也是削弱了汉人抗拒蒙的声势。", 928, 2);
	say("这样罢，咱们言明比武三场，那一方胜得两场，就取盟主之位。", 84, 1,"霍都");
	say("郭靖、黄蓉与众人低声商量，觉得对方此议实难以拒却。今日与会之人，除黄蓉不能出阵外，算来以郭靖、郝大通，和朱子柳三人武功最强。", 928, 2);
	say("蒙古乃蛮夷之邦，未受圣人教化，阁下既然请教，敝人自当指点指点。", 122, 1,"朱子柳");
	say("你出言辱我蒙古，须饶你不得！", 84, 1,"霍都");
	dark()
	light()
	say("堂上群雄一齐注目朱子柳与霍都二人，这时外面走进来一个白衣少女。她周身犹如笼罩着一层轻烟薄雾，似真似幻，实非尘世中人。", 928, 2);
	say("姑姑，姑姑！", 172, 1,"杨过");
	dark()
	addevent(54, 114, 0, 0, 0, 3034*2, 25, 24) -- 龙女
	light()	
	say("过儿，你果然在此，我终于找到你啦。", 59, 1,"小龙女");
	say("你……你不再撇下我了罢？", 172, 1,"杨过");
	say("我不知道。", 59, 1,"小龙女");
	say("你今后到哪里，我便跟你到哪里。", 172, 1,"杨过");
	dark()
	for i = 106, 113 do
		null(54,i)
	end
	addevent(54, 116, 0, 0, 0, 3033*2, 33, 28) -- 霍都上场
	addevent(54, 117, 0, 0, 0, 4108*2, 37, 26) -- 金轮
	addevent(54, 118, 0, 0, 0, 3381*2, 37, 27) -- 达尔巴等人
	addevent(54, 119, 0, 0, 0, 3381*2, 37, 28) -- 
	addevent(54, 120, 0, 0, 0, 3381*2, 37, 29) -- 
	addevent(54, 121, 0, 0, 0, 3381*2, 38, 27) -- 
	addevent(54, 122, 0, 0, 0, 3381*2, 38, 28) -- 
	addevent(54, 123, 0, 0, 0, 3381*2, 38, 29) --
	light()
	say("霍都使诈用暗器偷袭胜了第一场，第二场达尔巴与点苍渔隐以力相拼，铁桨竟被黄金杵震断。", 928, 2);
	say("咱们言明在先，三赛两胜。各位说过的话，算人话不算？", 84, 1,"霍都");
	say("今日争武林盟主，都是徒弟替师父打架，是也不是？", 172, 1,"杨过");
	say("不错，我们三场中胜了两场，因此我师父是盟主。", 84, 1,"霍都");
	say("就算你胜了他们，那又怎地？我师父的徒弟你可没打胜。", 172, 1,"杨过");
	say("你师父的徒弟是谁？", 84, 1,"霍都");
	say("蠢才！我师父的徒弟，自然是我。", 172, 1,"杨过");
	say("众人听他说到此处，均想莫非他师父当真是大有来头的人物，要来争武林盟主，不管他师父是谁，总是汉人，自胜于让蒙古国师抢了盟主去。", 928, 2);
	say("对，对，除非你们蒙古人再胜得两场。", 700, 1,"众人");
	dark()
	null(54,105)
	addevent(54, 115, 0, 0, 0, 3093*2, 29, 28) -- 杨过上场
	light()	
	say("天下英雄请了，小王杀此顽童，那是他自取其咎，须怪不得小王。", 84, 1,"霍都");
	say("天下英雄请了，小顽童杀此王子，那是他自取其咎，须怪不得小顽童！", 172, 1,"杨过");
	SetS(106, 63, 1, 0, 58)
   	SetS(106, 63, 2, 0, 84)
	if WarMain(288) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end	
	say("我三番四次提醒，要放暗器了，要放暗器了，你总是不信。可没骗你，是不是？", 172, 1,"杨过");
	say("小孩子，我来和你比武！＜藏语＞", 160, 1,"达尔巴");
	say("达尔巴说罢，金刚杵横扫，疾向杨过腰间打去。杨过双脚不动，腰身向后缩了尺许，金刚杵恰好在他腰前掠过。", 928, 2);
	dark()
	null(54,116)
	null(54,118)
	addevent(54, 124, 0, 0, 0, 4490*2, 33, 28) -- 达尔巴上场
	light()
	say("小孩子的功夫很不错，是谁教你的啊？＜藏语＞", 160, 1,"达尔巴");
	say("＜这和尚叽哩咕噜说什么？想来是在骂我，待我学他骂回去。＞", 172, 1,"杨过");
	say("小孩子的功夫很不错，是谁教你的啊？＜这几个字发音既准，次序也是丝毫不乱＞", 172, 1,"杨过");
	say("我师父是金轮法王。我又不是小孩子，你该叫我大和尚。＜藏语＞", 160, 1,"达尔巴");
	say("＜不管你如何恶毒的骂我，我只要全盘奉还，口头上就不会输了。＞", 172, 1,"杨过");
	say("我师父是金轮法王。我又不是小孩子，你该叫我大和尚。＜藏语＞", 172, 1,"杨过");
	say("我是法王的首代弟子，你是第几代的？＜藏语＞", 160, 1,"达尔巴");
	say("我是法王的首代弟子，你是第几代的？＜藏语＞", 172, 1,"杨过");
	say("＜师傅早年曾收过一个弟子，可这弟子不到二十岁就死了，这人莫非是大师兄转世？否则他年纪轻轻，怎能有如此武功？＞", 160, 1,"达尔巴");
	say("大师兄，师弟达尔巴参见。＜藏语＞", 160, 1,"达尔巴");
	say("…………", 62, 1,"金轮法王");
	say("达尔巴，他不是你大师兄转世，快起来跟他比武。＜藏语＞", 62, 1,"金轮法王");
	SetS(106, 63, 1, 0, 58)
   	SetS(106, 63, 2, 0, 160)
	if WarMain(288) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	say("我们又胜了第二场！武林盟主是大宋高手！蒙古鞑子快快滚出去罢，别来中原现世啦！", 700, 1,"众人");
	dark()
	null(54,124)
	null(54,117)
	addevent(54, 125, 0, 0, 0, 4108*2, 33, 28) -- 金轮上场
	light()
	say("少年，你的师父是谁？", 62, 1,"金轮法王");
	dark()
	null(54,114)
	addevent(54, 126, 0, 0, 0, 3621*2, 29, 27) -- 龙女上场
	light()
	say("我师父就是这一位，你快来拜见武林盟主罢！", 172, 1,"杨过");
	say("哼，你这小丫头也配做武林盟主？只要你接得住我这金轮的十招，我就认你是盟主。", 62, 1,"金轮法王");
	SetS(106, 63, 1, 0, 59)
 	SetS(106, 63, 2, 0, 62)
	if WarMain(288) == false then
        instruct_14();   --  14(E):场景变黑
   	    instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
	else
		addHZ(125)
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_14();   --  14(E):场景变黑
		instruct_0();   --  0(0)::空语句(清屏)
 		instruct_13();   --  13(D):重新显示场景
	end
	say("还不认输？你的兵刃都失了，还有甚么脸面？世上可有兵刃给人收去的武林盟主么？", 172, 1,"杨过");
	say("我们也不难为你，你们大多儿好好的去罢。", 172, 1,"杨过");
	say("郭大侠，黄帮主，今日领教高招。青山不改，绿水长流，咱们后会有期。", 62, 1,"金轮法王");
	dark()
	null(54,126)
	null(54,115)
	null(54,125)
	for i = 119, 123 do
		null(54,i)
	end
	addevent(54, 105, 0, 0, 0, 3094*2, 26, 24) -- 杨过
	addevent(54, 114, 0, 0, 0, 3034*2, 25, 24) -- 龙女
	light()
	say("龙姑娘，令徒过世了的父亲当年与在下有八拜之交。杨郭两家累世交好，在下单生一女，相貌与武功都还过得去……", 55, 1,"郭靖");
	say("在下意欲将小女许配给贤徒。他父母都已过世，此事须得请龙姑娘作主。", 55, 1,"郭靖");
	say("我自己要做过儿的妻子，他不会娶你女儿的。", 59, 1,"小龙女");
	say("龙姑娘，你是天下武林盟主，群望所属，观瞻所系，此事还须三思。", 56, 1,"黄蓉");
	say("我做不来什么盟主不盟主，姊姊你若是喜欢，就请你当罢。", 59, 1,"小龙女");
	say("过儿，你可要立定脚跟，好好做人，别闹得身败名裂。你的名字是我取的，你可知这个‘过’字的用意么？", 55, 1,"郭靖");
	say("若是我错了，自然要改。可我和姑姑清清白白，天日可表。我敬她爱她，难道这就错了？", 172, 1,"杨过");
	say("这番话当真是语惊四座。当时人哪里听见过这般叛逆之伦？郭靖一生最是敬重师父，只听得气向上冲，抢上一步，伸手便往杨过胸口抓去。", 928, 2);
	say("姑姑全心全意的爱我，我对她也是这般。郭伯伯，你要杀我便下手，我这主意是永生永世不改的。", 172, 1,"杨过");
	say("郭靖左掌在空际停留片时，又向杨过瞧了一眼，但见他咬紧口唇，双眉紧蹙，宛似杨康当年的模样，心中一阵酸痛，长叹一声，放松了他领口。", 928, 2);
	say("你好好的想想去罢。", 55, 1,"郭靖");
	say("过儿，这些人横蛮得紧，咱们走罢。", 59, 1,"小龙女");
	say("群雄眼睁睁的望著二人背影，有的鄙夷，有的惋惜，有的愤怒，有的惊诧。", 928, 2);
	dark()
	for i = 50, 105 do
		null(54,i)
	end
	null(54,114)
	null(111,10)
	instruct_21(58) -- 杨过离队
	addevent(111, 30, 0, 3549, 3, 0, 24, 39) -- 神雕古墓线，双剑战金轮
	addevent(111, 31, 0, 3549, 3, 0, 25, 39) -- 神雕古墓线，双剑战金轮
	addevent(111, 32, 0, 3549, 3, 0, 26, 39) -- 神雕古墓线，双剑战金轮
	light()
	say("想不到事态竟有如此发展，现在天色已晚，我先找个地方借宿吧。", 0, 1);
	transferme(111, 46, 42, 2)
end

OEVENTLUA[3549] = function() -- 神雕古墓线，双剑战金轮，龙女再度离开
	dark()
	null(111,30)
	null(111,31)
	null(111,32)
	addevent(111, 33, 0, 0, 0, 3554*2, 25, 31) -- 金轮一行
	addevent(111, 34, 0, 0, 0, 3380*2, 24, 32) -- 金轮一行
	addevent(111, 35, 0, 0, 0, 3380*2, 25, 32) -- 金轮一行
	addevent(111, 36, 0, 0, 0, 3380*2, 26, 32) -- 金轮一行
	addevent(111, 37, 0, 0, 0, 3094*2, 24, 28) -- 杨过
	addevent(111, 38, 0, 0, 0, 3034*2, 26, 28) -- 龙女
	addevent(111, 39, 0, 0, 0, 3045*2, 29, 25) -- 黄蓉
	addevent(111, 40, 0, 0, 0, 4587*2, 30, 25) -- 郭芙
	light()
	instruct_30(0,5,0,0);
	say("＜金轮法王？他们怎么在这？＞", 0, 1);
	say("杨兄弟，龙姑娘，我来助你们！", 0, 1);
	if instruct_6(74,4,0,0) ==false then    --  6(6):战斗[74]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2
	say("今日见识中原武功，老衲佩服得紧。你们这套剑法叫做什么名堂？", 62, 1,"金轮法王");
	say("中原武功，以打狗棒法与刺驴剑术为首，我们这套剑法，就是刺驴剑术了。", 172, 1,"杨过");
	say("刺驴剑术？", 62, 1,"金轮法王");
	say("是啊，刺秃驴的剑术。", 172, 1,"杨过");
	say("无礼小儿，终须叫你知道金轮法王的手段。", 62, 1,"金轮法王");
	say("大师兄，你杀我不杀？", 160, 1,"达尔巴");
	say("你们走吧。", 172, 1,"杨过");
	say("大师兄，多谢。", 160, 1,"达尔巴");
	dark()
	for i = 33, 40 do
		null(111, i)
	end
	addevent(111, 41, 0, 0, 0, 3094*2, 24, 31) -- 杨过
	addevent(111, 42, 0, 0, 0, 3034*2, 24, 28) -- 龙女
	addevent(111, 43, 0, 0, 0, 3045*2, 26, 31) -- 黄蓉
	addevent(111, 44, 0, 0, 0, 4587*2, 26, 28) -- 郭芙
	light()
	say("今儿大伙儿累了，咱们找个客店休息一宵，明日分手动身不迟。", 56, 1,"黄蓉");
	say("龙姑娘，你来，我有一件事送给你。", 56, 1,"黄蓉");
	dark()
	for i = 41, 44 do
		null(111, i)
	end
	light()
	if JY.Base["人X1"] == 26 then		--三个触发地方的移动方式不一样
		instruct_30(0,-11,0,0);
	elseif  JY.Base["人X1"] == 25 then
		instruct_30(-1,0,0,0);
		instruct_30(0,-11,0,0);
	else
		instruct_30(-2,0,0,0);
		instruct_30(0,-11,0,0);
	end
	instruct_25(26,45,33,45)--镜头移动
	dark()
	addevent(111, 45, 1, 3550, 1, 3094*2, 33, 44) -- 杨过
	addevent(111, 46, 0, 0, 0, 3621*2, 32, 45) -- 龙女
	light()
	say("郭伯母说，今晚你跟她母女俩睡一间房，我跟武氏兄弟俩睡一间房。", 172, 1,"杨过");
	say("不！为什么要那两个男人来陪你？我要和你睡你一起。", 59, 1,"小龙女");
	say("过儿，有一件事你须得真心答我。你和我住在古墓之中，多过得几年，可会想到外边的花花世界？", 59, 1,"小龙女");
	say("杨过一怔，半晌不答。", 928, 2);
	say("你若是不能出来，可会烦恼？你虽爱我之心始终不变，在古墓中时日久了，可会气闷？", 59, 1,"小龙女");
	say("姑姑，要是咱们气闷了、厌烦了，那便一同出来便是。", 172, 1,"杨过");
	say("＜郭夫人的话倒非骗我。将来他终究会气闷，要出墓来，那时人人都瞧他不起，他做人有何乐趣？＞", 59, 1,"小龙女");
	dark()
	null(111,46)
	instruct_25(33,45,26,45)--镜头移动
	light()
end

OEVENTLUA[3550] = function() --对话杨过
	say("大哥，姑姑她又走了！", 172, 1,"杨过");
	say("这是……龙姑娘留下的字？", 0, 1);
	say("只见桌面上用金针刻著细细的八个字道：“善自珍重，勿以为念。”", 928, 2);
	say("姑姑她……", 172, 1,"杨过");
	say("杨兄弟莫慌，我们再去寻回她便是。", 0, 1);
	teammate(58)
	null(111,45)
	addevent(22,49,1,3551,1,4585*2,36,23)--公孙绿萼
end

OEVENTLUA[3551] = function()
	if hasppl(58) == false then
		do return end
	end
	say("两人来到一幽谷之中，一名绿衫少女正在道旁摘花，只见那女郎将花瓣一瓣瓣的摘下，再送入口中。", 928, 2);
	say("难道花儿也吃得的？", 172, 1,"杨过");
	say("杨过说罢伸手便去摘花。", 928, 2);
	say("留神！树上有刺，别碰上了！", 313, 1,"绿衫少女");
	say("杨过避开枝上尖刺，落手甚是小心，岂知花朵背後又隐藏著小刺，还是将手指刺损了。", 928, 2);
	say("这谷叫做‘绝情谷’，偏偏长著这许多情花。", 313, 1,"绿衫少女");
	dark()
	addevent(22,50,1,3551,1,3391*2,31,24) --绝情谷弟子
	light()
	say("谷主有请几位贵客相见。", 700, 1,"绝情谷弟子");
	dark()
	null(22,49)
	null(22,50)
	light()
	if JY.Base["人X1"] == 35 then
		instruct_30(0,-3,0,0);
		instruct_30(10,0,0,0);
	else
		instruct_30(0,-2,0,0);
		instruct_30(11,0,0,0);
	end
	dark()
	addevent(22,51,1,0,1,4509*2,14,27)--公孙止
	addevent(22,52,1,0,1,3621*2,14,26)--小龙女
	addevent(22,53,1,0,1,4005*2,17,23)--金轮
	addevent(22,54,1,0,1,3507*2,18,23)--尼摩星
	addevent(22,55,1,0,1,4553*2,19,23)--潇湘子
	addevent(22,56,1,0,1,2568*2,20,23)--尹克西
	addevent(22,57,1,0,1,3393*2,17,30)--弟子
	addevent(22,58,1,0,1,3393*2,18,30)
	addevent(22,59,1,0,1,3393*2,19,30)
	addevent(22,60,1,0,1,3393*2,20,30)
	light()
	instruct_25(24,26,19,26)--镜头移动
	instruct_21(58) -- 杨过离队
	say("今日午后，小弟续弦行礼，想屈各位大驾观礼。", 509, 1,"公孙止");
	say("姑姑！", 172, 1,"杨过");
	say("那白衣女郎“啊”的一声大叫，身子颤抖，坐倒在地，合了双眼，似乎晕了过去。过了半晌，才缓缓睁眼。", 928, 2);
	say("阁下是谁？你对我是怎生称呼？", 59, 1,"小龙女");
	say("姑姑，我是过儿啊，怎……怎地你不认得我了么？你身子好么？什么地方不舒服？", 172, 1,"杨过");
	say("我与阁下素不相识。", 59, 1,"小龙女");
	say("这位柳姑娘便是兄弟的新婚夫人，已择定今日午后行礼成亲。", 509, 1,"公孙止");
	say("不知谷主如何与她结识？", 172, 1,"杨过");
	say("半月之前，我到山边采药，遇到她卧在山脚之下，身受重伤，气息奄奄。我用家传灵药助她调养。说到相识的因缘，实是出于偶然。", 509, 1,"公孙止");
	say("这正所谓千里姻缘一线牵。想必柳姑娘由是感恩图报，委身以事了。那真是郎才女貌，佳偶天成啊。", 62, 1,"金轮法王");
	say("杨过一听此言，脸色大变，全身发颤，突然间喉头微甜，一口鲜血喷在地下。", 928, 2);
	say("你……你……", 59, 1,"小龙女");
	say("杨兄弟！", 0, 1);
	say("姑姑，倘若我有不是，你尽可打我骂我，便是一剑将我杀了，我也甘心。可是你怎能不认我啊？", 172, 1,"杨过");
	say("公孙止偷瞧小龙女的脸色，只见她目中泪珠滚来滚去，终於忍耐不住，一滴滴的溅在胸口鲜血之上。", 928, 2);
	say("＜瞧来他二人定是一对情侣。只因有甚言语失和，柳妹才愤而允我婚事，看来留这小子不得。＞", 509, 1,"公孙止");
	say("将这小子拿下了！", 509, 1,"公孙止");
	say("姑姑，过儿今日有难，你的金铃索与掌套给我一用。", 172, 1,"杨过");
	say("小龙女只想著杨过安危，此外更无别样念头，听了这话，当即从怀中取出一双白色手套、一条白绸带子，递了给杨过。", 928, 2);
	say("你现在认我了么？", 172, 1,"杨过");
	say("我心中早就认你啦！", 59, 1,"小龙女");
	say("＜我纵然得不了你的心，也须得到你的人。我一掌将这小畜生击毙，你不跟我也得跟我！＞", 509, 1,"公孙止");
	say("看剑！", 509, 1,"公孙止");
	local pid = 9999;				
	JY.Person[pid] = {};
	for i=1, #PSX-8 do
		JY.Person[pid][PSX[i]] = JY.Person[96][PSX[i]];
	end
	JY.Person[pid]["姓名"] = "公孙止";
	JY.Person[pid]["生命最大值"] = 2800
	JY.Person[pid]["生命"] = 2800
	JY.Person[pid]["内力最大值"] = 6000
	JY.Person[pid]["内力"] = 6000
	JY.Person[pid]["防御力"] = 500
	JY.Person[pid]["攻击力"] = 450
	JY.Person[pid]["轻功"] = 250
	JY.Person[pid]["特殊兵器"] = 150
	JY.Person[pid]["武功1"] = 77
	JY.Person[pid]["武功等级1"] = 999
	JY.Person[pid]["声望"] = 97	
	JY.Person[pid]["左右互搏"] = 1	
	JY.Person[pid]["资质"] = 20
	for i = 2, 10 do
		JY.Person[pid]["武功"..i] = 0
		JY.Person[pid]["武功等级"..i] = 0
	end
	SetS(106, 63, 1, 0, 58)
 	SetS(106, 63, 2, 0, 9999)
	if WarMain(288) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	say("杨兄弟小心！", 0, 1);
	say("老衲愿领教公子高招。", 62, 1,"金轮法王");
	if instruct_6(74,4,0,0) ==false then    --  6(6):战斗[74]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2
	addevent(22,61,1,0,1,2581*2,17,27)--杨过倒地
	say("不好！", 0, 1);
	say("这姓杨的小子已中情花之毒！每过一个时辰，疼痛便增一分，三十六日后全身剧痛而死。", 509, 1,"公孙止");
	say("柳姑娘，十二个时辰之内你如回心转意，只须呼叫一声，我便拿解药来救他性命。若拖过一天，那便是神仙难救了。", 509, 1,"公孙止");
	say("小龙女见杨过全身发颤，咬唇出血，双目本来朗若流星，此刻已是黯然无光，想得到他身上如何痛苦，只怕地狱之中也无如此苦刑。", 928, 2);
	say("公孙先生，我允你成亲便了。你快放了他，取药解救。", 59, 1,"小龙女");
	dark()
	for i= 51, 61 do
		null(22,i)
	end
	light()
	instruct_25(19,26,24,26)--镜头移动
	say("不想竟生如此变故，杨兄弟落入他们手里。这情花之毒，我看也未必无药可解，先回小村问问贤叔吧。", 0, 1);
	addevent(70, 3, 1, 3552)
end

OEVENTLUA[3552] = function()
	say("贤叔……", 0, 1);
	say(JY.Person[zj()]["姓名"].."将杨过中毒一事告知。", 928, 2);
	say("凡毒蛇出没之处，七步之内必有解蛇毒之药。其他毒物，无不如此，这是天地间万物生克的至理。", 255, 1,"南贤");
	say("如此说来，这解药定在那情花丛附近了。", 0, 1);
	addevent(70, 3, 1, 693)
	addevent(22,62,0,3553,3,0,22,50)
	addevent(22,63,0,3553,3,0,23,50)
	addevent(22,64,0,3553,3,0,24,50)
end

OEVENTLUA[3553] = function()
	transferme(22, 24, 26, 2)
	for i= 62, 64 do
		null(22,i)
	end
	for i= 0, 10 do
		null(7,i)
	end
	for i= 12, 17 do
		null(7,i)
	end
	instruct_39(7)
	addevent(7, 11, 1, 3554) -- 神雕
	addevent(7, 30, 1, 3555, 1, 3095*2, 14, 17) -- 杨过
	addevent(7, 32, 1, 3556, 1, 3524*2, 35, 11) -- 利剑
	addevent(7, 33, 1, 3557, 1, -2, 36, 10) -- 紫薇软剑
	addevent(7, 34, 1, 3558, 1, 3524*2, 37, 11) -- 玄铁剑
	addevent(7, 35, 1, 3559, 1, 3524*2, 38, 11) -- 木剑
	addthing(201)
	say("这断肠草应该便是情花毒的解药了。可这谷中为何空无一人？杨兄弟，龙姑娘，还有公孙止都到哪里去了呢？", 0, 1);
end

OEVENTLUA[3554] = function() -- 神雕
	say("嘎，嘎，嘎……", 226, 1,"神雕");
end


OEVENTLUA[3555] = function() -- 杨过
	JY.Person[58]["武功7"] = 45  --杨过洗玄铁
	JY.Person[58]["武功等级7"] = 999
	QZXS("杨过学会玄铁剑法！")
	say("杨兄弟？你怎么在这儿？你的手臂是怎么回事？", 0, 1);
	say("大哥，说来话长……", 172, 1,"杨过");
	say("杨过讲述了自绝情谷一别后的种种遭遇。", 928, 2);
	say("＜想到杨过一生孤苦，现今又失去了一条手臂，不禁心中难过。＞", 0, 1);
	say("是大哥没有好好照料你。想不到那郭姑娘竟下此毒手，大哥这就去襄阳，找那郭靖黄蓉讨个公道。", 0, 1);
	say("算了，大哥，我中毒已深，没有几天活头了。郭伯伯为人忠厚，为国为民，事已至此，我又何必再去令他们难过。", 172, 1,"杨过");
	say("杨兄弟，我听前辈说，这断肠草或许可解情花之毒，你不妨试它一试。", 0, 1);
	instruct_32(201,-1)
	dark()
	instruct_0();  
	addevent(7, 31, 1, 3555, 1, 3093*2, 14, 17) -- 杨过
	light()
	say("多谢大哥。大哥，我要去找姑姑。", 172, 1,"杨过");
	say("我们这就走。", 0, 1);
	--say("此时此刻，重阳宫内……", 928, 2);
	QZXS("此时此刻，重阳宫内……")
	addevent(19,63,1,0,0,3034*2,26,35)--小龙女被围攻
	addevent(19,64,1,0,0,3554*2,26,37)--金轮
	addevent(19,65,1,0,0,4499*2,26,33)--尹克西
	addevent(19,66,1,0,0,4493*2,24,35)--尼摩星
	addevent(19,67,1,0,0,4502*2,28,35)--潇湘子
	addevent(19,68,1,0,0,4548*2,24,39)--全真弟子
	addevent(19,69,1,0,0,4548*2,25,39)--全真弟子
	addevent(19,70,1,0,0,4548*2,26,39)--全真弟子
	addevent(19,71,1,0,0,4548*2,27,39)--全真弟子
	addevent(19,72,1,0,0,4548*2,28,39)--全真弟子
	addevent(19,73,1,0,0,4551*2,24,31)--全真弟子
	addevent(19,74,1,0,0,4551*2,25,31)--全真弟子
	addevent(19,75,1,0,0,4551*2,26,31)--全真弟子
	addevent(19,76,1,0,0,4551*2,27,31)--全真弟子
	addevent(19,77,1,0,0,4551*2,28,31)--全真弟子
	addevent(19,78,1,0,0,4549*2,22,33)--全真弟子
	addevent(19,79,1,0,0,4549*2,22,34)--全真弟子
	addevent(19,80,1,0,0,4549*2,22,35)--全真弟子
	addevent(19,81,1,0,0,4549*2,22,36)--全真弟子
	addevent(19,82,1,0,0,4549*2,22,37)--全真弟子
	addevent(19,83,1,0,0,4550*2,30,33)--全真弟子
	addevent(19,84,1,0,0,4550*2,30,34)--全真弟子
	addevent(19,85,1,0,0,4550*2,30,35)--全真弟子
	addevent(19,86,1,0,0,4550*2,30,36)--全真弟子
	addevent(19,87,1,0,0,4550*2,30,37)--全真弟子
	dark()
	null(7,31) -- 删除神雕洞杨过贴图
	My_Enter_SubScene2(19, 5,35, 2)
	instruct_25(5,35,26,35)--镜头移动
	light()
	say("今日我是来向全真教的道人寻仇，与旁人无干，你们快退开了。", 59, 1,"小龙女");
	say("＜赵志敬已受蒙古大汗敕封，怎能杀他？＞", 158, 1,"尹克西");
	say("这位赵真人为人很好啊，姑娘只怕有点误会。", 158, 1,"尹克西");
	say("小龙女秀眉微蹙，左手剑倏地递出，快如电闪，向尹克西刺了过去。", 928, 2);
	say("啊！", 158, 1,"尹克西");
	say("龙姑娘剑法不差，我也得领教领教！", 157, 1,"潇湘子");
	say("你们让是不让？", 59, 1,"小龙女");
	say("我们偏偏不让，你这小妖女有什么本事，一塌胡涂施展出来的？", 159, 1,"尼摩星");
	say("既不肯让，我可要得罪了！", 59, 1,"小龙女");
	JY.Person[59]["实战"]=500
	JY.Person[59]["攻击力"]=999
	JY.Person[59]["防御力"]=999
	JY.Person[59]["轻功"]=999 
	JY.Person[59]["生命最大值"] = 1500
    JY.Person[59]["生命"] = 1500
    JY.Person[59]["内力最大值"] = 10000
    JY.Person[59]["内力"] = 10000	
	JY.Person[59]["武功1"] = 112
	JY.Person[59]["武功等级1"] = 999
	JY.Person[59]["武功2"] = 107
	JY.Person[59]["武功等级2"] = 999
	JY.Person[59]["武功3"] = 106
	JY.Person[59]["武功等级3"] = 999
	JY.Person[59]["武功4"] = 119
	JY.Person[59]["武功等级4"] = 999
	JY.Person[59]["武功5"] = 108
	JY.Person[59]["武功等级5"] = 999
	JY.Person[59]["武功6"] = 103
	JY.Person[59]["武功等级6"] = 999
	JY.Person[59]["武功7"] = 101
	JY.Person[59]["武功等级7"] = 999
	QZXS("为方便测试，小龙女能力大幅提高。") --神雕重阳宫小龙女1vN，测试用
	SetS(106, 63, 1, 0, 59)
 	SetS(106, 63, 2, 0, 62)
	if WarMain(288) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	say("小龙女不断抓起地上被击落的长剑，一一掷上半空，待落下时，她一接住跟著又掷了上去。但见数十柄长剑此上彼落，寒光闪烁，煞是奇观。", 928, 2);
	say("当年小龙女传授杨过武功之时，要他以双掌拦住八十一只麻雀。这“天罗地网势”使将出来，活的麻雀尚能拦住，数十柄长剑随接随抛，在她自是浑若无事。她手中每一刻都有兵刃，也是每一刻都无兵刃，只瞧得潇湘子等目瞪口呆。", 928, 2);
	say("大伙一齐上啊！", 159, 1,"尼摩星");
	SetS(106, 63, 1, 0, 59)
 	SetS(106, 63, 2, 0, 62)
	if WarMain(288) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	dark()
	addevent(19,88,1,0,0,3058*2,28,29)
	addevent(19,89,1,0,0,3058*2,29,29)
	addevent(19,90,1,0,0,3058*2,30,29)
	addevent(19,91,1,0,0,3058*2,31,29)
	addevent(19,92,1,0,0,3058*2,32,29)
	light()
	say("金轮法王率人来攻之时，全真五子正在玉虚洞中修炼“七星聚会”，万万分心不得，直到五人练到五力归一，融合无间，这才破洞而出。", 928, 2);
	say("师父！您没事！", 204, 1,"甄志丙");
	say("丘处机等人见金轮法王等四人围著小龙女剧斗方酣。五人不禁面面相觑，都暗想原来古墓派的武功精妙若斯，要想胜她，那是终身无望了。", 928, 2);
	say("＜若是先师在世，自能胜得过他们，周师叔大概也胜他们一筹，但若同时受这四人围攻，十九要抵敌不住。＞", 68, 1,"丘处机");
	say("小龙女自闯入大殿，到这时已斗了将近一个时辰，气力渐感不支，而强敌越逼越近。丘处机等五人又环伺在侧，四下里尽是敌人，自己孤身一人，今日定要丧身重阳宫中了。", 928, 2);
	say("＜我遭际若此，一死又有什么可惜？只是临死之时，却不能见过儿一面。＞", 59, 1,"小龙女");
	say("＜他这时是在哪里呢？多半是在跟郭姑娘亲热，说不定已成了亲，新婚燕尔，怎会想到我这苦命女子在此受人围攻？＞", 59, 1,"小龙女");
	say("＜不……不！过儿不会这样，他便和郭姑娘成了亲，也决不会忘了我。我只要能再见他一面……＞", 59, 1,"小龙女");
	say("她一想到杨过，本来分心二用突然变为心有专注，再无“玉女素心剑法”的威力。法王见机，当下踏上半步，右手金轮往她剑上碰去。", 928, 2);
	say("小龙女淡淡一笑，已不愿再挣扎力抗，瞥眼望见三丈外的一株青松旁生著一丛玫瑰，花朵娇艳欲滴，突然想起当年与杨过练玉女心经的光景。", 928, 2);
	say("＜我既已见不到过儿，那便在临死之时心中想念著他。＞", 59, 1,"小龙女");
	say("龙姑娘，小心！", 204, 1,"甄志丙");
	dark()
	addevent(19,93,1,0,0,2720*2,26,36) -- 甄志丙倒地
	light()
	say("天罡北斗阵！", 68, 1,"丘处机");
	SetS(106, 63, 1, 0, 59)
 	SetS(106, 63, 2, 0, 68)
	if WarMain(288) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	say("各位道兄且退，这小妖女待老衲来料理罢！", 62, 1,"金轮法王");
	SetS(106, 63, 1, 0, 59)
 	SetS(106, 63, 2, 0, 68)
	if WarMain(288) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	teammate(58)
	--say("便在此时，法王金轮迎面砸去，全真五子那招“七星聚会”却自后心击了上来……", 928, 2);
	QZXS("便在此时，法王金轮迎面砸去，全真五子那招“七星聚会”却自后心击了上来……")
	My_Enter_SubScene2(7, 15,17, 2)
	addevent(19,94,0,3560,3,0,32,49)
end

OEVENTLUA[3556] = function() -- 利剑
	say("凌厉刚猛，无坚不摧，弱冠前以之与河朔群雄争锋。", 928, 2);
end
OEVENTLUA[3557] = function() -- 紫薇软剑
	say("紫薇软剑，三十岁前所用，误伤义士不祥，乃弃之深谷。", 928, 2);
end
OEVENTLUA[3558] = function() -- 玄铁剑
	say("重剑无锋，大巧不工，四十岁之前恃之横行天下。", 928, 2);
	SetS(106, 63, 1, 0, 0)
 	SetS(106, 63, 2, 0, 607)
	if WarMain(288) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	say("重剑无锋，大巧不工……好剑法！", 0, 1);
	dark()
	null(7,34)
	light()
	addthing(36)
	addthing(116)
end
OEVENTLUA[3559] = function() -- 木剑
	say("四十岁后，不滞于物，草木竹石均可为剑。自此精修，渐进于无剑胜有剑之境。", 928, 2);
	SetS(106, 63, 1, 0, 0)
 	SetS(106, 63, 2, 0, 592)
	if WarMain(288) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	say("独孤前辈神技，真令人难以想像。", 0, 1);
	dark()
	null(7,35)
	light()
	addthing(302)
end

OEVENTLUA[3560] = function() -- 重阳宫决战
	say("姑姑！", 172, 1,"杨过");
	instruct_25(32,49,26,35)--镜头移动
	say("过儿，是你，这不是做梦么？", 59, 1,"小龙女");
	say("杨过窜入法王和全真五子之间，伸左臂抱起小龙女，一闪一幌，又已跃出圈子，迳自坐在青松之下、玫瑰花旁，将小龙女抱在怀里。", 928, 2);
	instruct_25(26,35,32,49)--镜头移动
	dark()
	null(19,63)
	null(19,93)
	addevent(19,64,1,0,0,4005*2,26,37)--金轮
	addevent(19,65,1,0,0,4499*2,26,33)--尹克西
	addevent(19,66,1,0,0,4495*2,24,35)--尼摩星
	addevent(19,67,1,0,0,4503*2,28,35)--潇湘子
	addevent(19,68,1,0,0,4551*2,24,39)--全真弟子
	addevent(19,69,1,0,0,4551*2,25,39)--全真弟子
	addevent(19,70,1,0,0,4551*2,26,39)--全真弟子
	addevent(19,71,1,0,0,4551*2,27,39)--全真弟子
	addevent(19,72,1,0,0,4551*2,28,39)--全真弟子
	addevent(19,73,1,0,0,4551*2,24,31)--全真弟子
	addevent(19,74,1,0,0,4551*2,25,31)--全真弟子
	addevent(19,75,1,0,0,4551*2,26,31)--全真弟子
	addevent(19,76,1,0,0,4551*2,27,31)--全真弟子
	addevent(19,77,1,0,0,4551*2,28,31)--全真弟子
	addevent(19,78,1,0,0,4551*2,22,33)--全真弟子
	addevent(19,79,1,0,0,4551*2,22,34)--全真弟子
	addevent(19,80,1,0,0,4551*2,22,35)--全真弟子
	addevent(19,81,1,0,0,4551*2,22,36)--全真弟子
	addevent(19,82,1,0,0,4551*2,22,37)--全真弟子
	addevent(19,83,1,0,0,4551*2,30,33)--全真弟子
	addevent(19,84,1,0,0,4551*2,30,34)--全真弟子
	addevent(19,85,1,0,0,4551*2,30,35)--全真弟子
	addevent(19,86,1,0,0,4551*2,30,36)--全真弟子
	addevent(19,87,1,0,0,4551*2,30,37)--全真弟子
	light()
	instruct_30(0,5,0,0);
	instruct_30(6,0,0,0);
	instruct_30(0,3,0,0);
	dark()
	addevent(19,98,1,0,1,3093*2,18,42)--杨过
	addevent(19,99,1,0,1,3621*2,18,43)--龙女
	light()
	say("过儿！你的右臂呢？怎么没了？", 59, 1,"小龙女");
	say("可怜的过儿，断了很久吗？这时还疼么？", 59, 1,"小龙女");
	say("早就不痛了。只要我见了你面，永远不跟你分开，少一条臂膀又算得什么？我一条左臂不是也能抱著你么？", 172, 1,"杨过");
	say("杨过和小龙女在无数高手虎视眈眈之下缠绵互怜，将所有强敌全都视如无物。爱到极处，富贵荣华完全不放在心上，甚至生死大事也视作等闲。", 928, 2);
	say("金轮法王，咱们的帐是今日算呢，还是留待异日？", 172, 1,"杨过");
	say("杨兄弟，恭喜你又有异遇，得了这柄威猛绝伦的神剑啊！你这件希奇古怪的法宝，只怕老衲也对付不了。", 62, 1,"金轮法王");
	say("杨兄弟，你看护好龙姑娘，这和尚就交给我了！", 0, 1);
	instruct_21(58) -- 杨过离队
	if instruct_6(74,4,0,0) ==false then    --  6(6):战斗[74]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label2
	for i= 68,72 do
		null(19,i)
	end
	addevent(19,94,1,0,0,3983*2,26,37)--金轮
	say("法王岔了内息，惟觉郁闷欲死，委顿在地，全无抗拒之力。达尔巴举起金杵，勉力护住师父。", 928, 2);
	say("师哥，小弟回藏边勤练武功，十年后定要找上这姓杨的小子，替师父和你报仇。", 84, 1,"霍都");
	say("霍都说著转身急跃，飞也似的去了。", 928, 2);
	say("大师兄，你饶小弟一命，待我救回师父，找那狼心狗肺的师弟来碎尸万段，然后自行投上，住凭处置。要杀要剐，小弟决不敢皱一皱眉头。", 160, 1,"达尔巴");
	say("＜霍都临危逃命，此人倒是对师忠义，是条汉子。＞", 172, 1,"杨过");
	say("你去罢！", 172, 1,"杨过");
	dark()
	for i= 65, 67 do
		null(19,i)
	end
	null(19,94)
	light()
	say("杨过，你武功练到了这等地步，我辈远远不及。但这里我教数百人在此，你自忖能闯出重围么？", 68, 1,"丘处机");
	say("要想动他，先过得了我这一关！", 0, 1);
	if WarMain(73) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	say("少侠当真要与我全真教为敌？", 68, 1,"丘处机");
	say("甄志丙呢？", 59, 1,"小龙女");
	say("龙姑娘……", 204, 1,"甄志丙");
	say("过儿，我的清白已为此人玷污，纵然伤愈，也不能和你长相厮守。但他……但他舍命救我，你也别再难为他。", 59, 1,"小龙女");
	say("师父，四位师伯师叔，弟子罪孽深重，你们千万不能难为了龙姑娘和杨过。", 204, 1,"甄志丙");
	say("甄志丙说罢纵身跃起，扑向众道士手中兀自向前挺出的八九柄长剑，数剑穿身而过，登时毙命。", 928, 2);
	say("志丙！", 68, 1,"丘处机");
	say("过儿，这时候，我在你身边死了，心里……心里很快活。只是你孤苦伶仃的一个儿，你……没人陪伴……", 59, 1,"小龙女");
	say("＜那日姑姑在终南山上，曾问我愿不愿要她做妻子，那时我愕然不答，以致生出这许多灾难困苦。眼前为时无多，务须让她明白我的心意。＞", 172, 1,"杨过");
	say("什么师徒名分，什么名节清白，咱们通通当是放屁！通通滚他妈的蛋！死也罢，活也罢，咱俩谁也没命苦，谁也不会孤苦伶仃。从今而后，你不是我师父，不是我姑姑，是我妻子。", 172, 1,"杨过");
	say("这是你的真心话么？是不是为了让我欢喜，故意说些好听言语？", 59, 1,"小龙女");
	say("当年重阳先师和我古墓派祖师婆婆原该好好结为夫妻，不知为了什么古怪礼教，弄得各自遗恨而终，咱俩今日便在重阳祖师的座前拜堂成亲，结为夫妇，让咱们祖师婆婆出了这口恶气。", 172, 1,"杨过");
	dark()
	null(19,98)
	null(19,99)
	My_Enter_SubScene2(19, 28, 27, 3)
	addevent(19,95,1,0,0,3094*2,27,22)--杨过
	addevent(19,96,1,0,0,3034*2,28,22)--小龙女
	addevent(19,73,1,0,0,4548*2,24,31)--全真弟子
	addevent(19,74,1,0,0,4548*2,25,31)--全真弟子
	addevent(19,75,1,0,0,4548*2,26,31)--全真弟子
	addevent(19,76,1,0,0,4548*2,27,31)--全真弟子
	addevent(19,77,1,0,0,4548*2,28,31)--全真弟子
	addevent(19,78,1,0,0,4548*2,22,33)--全真弟子
	addevent(19,79,1,0,0,4548*2,22,34)--全真弟子
	addevent(19,80,1,0,0,4548*2,22,35)--全真弟子
	addevent(19,81,1,0,0,4548*2,22,36)--全真弟子
	addevent(19,82,1,0,0,4548*2,22,37)--全真弟子
	addevent(19,83,1,0,0,4548*2,30,33)--全真弟子
	addevent(19,84,1,0,0,4548*2,30,34)--全真弟子
	addevent(19,85,1,0,0,4548*2,30,35)--全真弟子
	addevent(19,86,1,0,0,4548*2,30,36)--全真弟子
	addevent(19,87,1,0,0,4548*2,30,37)--全真弟子
	addevent(19,88,1,0,0,4522*2,28,29)--五子
	addevent(19,89,1,0,0,4522*2,29,29)
	addevent(19,90,1,0,0,4522*2,30,29)
	addevent(19,91,1,0,0,4522*2,31,29)
	addevent(19,92,1,0,0,4522*2,32,29)
	light()
	say("杨过，老子今天就跟你拼了！", 406, 1,"赵志敬");
	say("杨兄弟，借剑一用！", 0, 1);
	say("赵志敬提剑刺来，实是使上了毕生的修为劲力。"..JY.Person[zj()]["姓名"].."抽玄铁剑击出，势挟风雷，只听得轰然一声响，赵志敬连人带剑已飞出丈远。", 928, 2);
	dark()
	null(19,76)
	addevent(19,97,1,0,0,2720*2,26,40) -- 赵志敬倒地
	light()
	say("弟子杨过和弟子龙氏，今日在重阳祖师之前结成夫妇，此间全真教数百位道长，都是见证。", 172, 1,"杨过");
	say("我既非清白之躯，又是个垂死之人，你何必……你何必待我这样好？", 59, 1,"小龙女");
	say("老天爷只许咱们再活一天，咱们便做一天夫妻，只许咱们再活一个时辰，咱们就做一个时辰的夫妻。", 172, 1,"杨过");
	say("小龙女见杨过脸色诚恳，目光中深情无限，心中激动，真不知要怎样爱惜他才好，凄苦的脸上慢慢露出笑靥，泪珠未乾，便在蒲团上盈盈跪倒。", 928, 2);
	say("弟子杨过和龙氏真心相爱，始终不渝，愿生生世世，结为夫妇。", 172, 1,"杨过");
	say("愿祖师爷保佑，让咱俩生生世世，结为夫妇。", 59, 1,"小龙女");
	say("当年王重阳和林朝英互有深情，全真五子尽皆知晓，虽均敬仰师父挥慧剑斩情丝，是一位了不起的英雄好汉，但想到林朝英以绝世之姿、妙龄之年，竟在古墓中自闭一生，自也无不感叹。", 928, 2);
	say("撤了剑阵，让他二人去罢！", 68, 1,"丘处机");
	dark()
	for i= 73,92 do
		null(19,i)
	end
	null(19,97)
	My_Enter_SubScene2(19, 28, 27, 0)
	light()
	say("大哥，此番恩情，无以为报，但龙儿重伤，我们要先回古墓去了。", 172, 1,"杨过");
	say("＜他二人新婚燕尔，我自是不好叨扰，不过龙姑娘这伤……还须想个法子。＞", 0, 1);
	say("好，你们先去吧。", 0, 1);
	dark()
	null(19,95)
	null(19,96)
	addevent(18,30,0,3561,3,0,44,30)
	addevent(18,31,0,3561,3,0,44,31)
	light()
end

OEVENTLUA[3561] = function() -- 重阳宫决战
	My_Enter_SubScene2(18,25,30,2)
	null(18,30)
	null(18,31)
	say("这古墓之中怎会空无一人？龙姑娘重伤在身……难道……", 0, 1);
	addevent(40,81,0,3562,3,0,28,41)
	addevent(40,82,0,3562,3,0,28,42)
end

OEVENTLUA[3562] = function() -- 神雕古墓线洛阳
	dark()
	null(40,81)
	null(40,82)
	addevent(40,83,0,0,3,4602*2,20,41)--郭襄
	light()
	say("请问老兄，那襄阳围城之中，是怎生光景？", 700, 1,"酒客一");
	say("那一年蒙古十多万大军猛攻襄阳，守军统制吕大人是个昏庸无能之徒，幸蒙郭大侠夫妇奋力抗敌……", 700, 1,"酒客二");
	say("这十多年来，倘若不是襄阳坚守不屈，大宋半壁江山只怕早已不在了。", 700, 1,"酒客二");
	say("其实守城的好官各地都有，只是朝廷忠奸不分，往往奸臣享尽荣华富贵，忠臣却含冤而死。", 700, 1,"酒客三");
	say("听老弟口音，是京都临安人氏了？然则王惟忠将军受刑是的情状，老弟可曾听人说起过？", 700, 1,"酒客二");
	say("小弟还是亲眼看见呢。王将军临死时脸色兀自不变，威风凛凛，骂丁大全和陈大方祸国殃民，而且还有一件异事。", 700, 1,"酒客三");
	say("什么异事？", 700, 1,"众人");
	say("王将军是陈大方谋害的。王将军被绑赴刑场之时，在长街上高声大叫，说死后决向玉皇大帝诉冤。王将军死后第三天，那陈大方果在家中暴毙。", 700, 1,"酒客三");
	say("这位老弟的话的确不错。只不过杀陈大方的，并不是天神天将，却是一位英雄豪杰。", 700, 1,"酒客二");
	say("那陈大方家将亲兵，防卫何等周密，常人怎杀得了他？再说，要把这奸臣的首级高高挑在钟楼的檐角之上，除非是生了翅膀，才有这等本领。", 700, 1,"酒客三");
	say("本领非凡的奇人侠士，世上毕竟还是有的。但小弟若不是北眼目睹，可也真的难以相信。", 700, 1,"酒客二");
	say("这位侠客是谁？怎生模样？", 700, 1,"酒客三");
	say("这位大侠行侠仗义，好打抱不平，可是从来不肯说自己姓名，江湖上朋友见他和一头怪鸟形影不离，便送了一个外号，叫作‘神雕大侠’。", 700, 1,"酒客二");
	say("……", 0, 1);
	say("＜神雕大侠……神雕……莫非是杨兄弟？这一别不知不觉已有十六年了。＞", 0, 1);
	say("这时，旁边一位少女听得悠然神往，随手端起酒碗，喝了一大口。", 928, 2);	
	say("你们许多人都见过神雕侠，我却没福见过。若能见他一面，能听他说几句话，我……我可比什么都欢喜了。", 154, 1, "郭襄");	
	dark()
	addevent(40,84,0,0,3,4108*2,21,41)--金轮
	light()
	say("郭小姐，正好我也要找那神雕侠，我便随我来吧！", 62, 1,"金轮法王");
	dark()
	null(40,83)
	null(40,84)
	light()
	say("那人不是金轮法王么？他称那姑娘为郭小姐，莫非与郭大侠有关？看来我要去襄阳一趟了。", 0, 1);
	addevent(107,30,1,3563,1,3619*2,18,45)--郭靖
	addevent(107,31,1,3563,1,3620*2,18,46)--黄蓉
end

OEVENTLUA[3563] = function() --神雕古墓线最终战
	say("郭大侠，黄女侠。", 0, 1);
	say(JY.Person[zj()]["姓名"].."将所见之事与二人说了。", 928, 2);
	say("鞑子猛攻襄阳，我夫妇二人无法脱身，襄儿的安危，只得暂且不去理会了。", 56, 1,"黄蓉");
	say("侠之大者，为国为民。我虽算不上大侠，此事也定当尽力。", 0, 1);
	say("多谢少侠义助。", 55, 1,"郭靖");
	dark()
	My_Enter_SubScene2(107,30,51,3)
	null(107,30)
	null(107,31)
	addevent(107,32,1,0,1,4001*2,29,50)--郭靖
	addevent(107,33,1,0,1,4002*2,31,50)--黄蓉
	addevent(107,34,1,0,1,3047*2,29,48)--小兵
	addevent(107,35,1,0,1,3047*2,30,48)--
	addevent(107,36,1,0,1,3047*2,31,48)--
	addevent(107,37,1,0,1,3047*2,29,47)--
	addevent(107,38,1,0,1,3047*2,30,47)--
	addevent(107,39,1,0,1,3047*2,31,47)--	
	light()
	say("报！城外四万蒙古军队已经围住北门，筑起了一座十余丈高的高台，",700, 1,"小校");
	say("是襄儿，是襄儿。", 56, 1,"黄蓉");
	say("什么！", 55, 1,"郭靖");
	JY.Scene[38]["名称"] = "襄阳城外"
	addevent(38,20,1,0,1,3406*2,28,25)--金轮
	addevent(38,21,1,0,1,3407*2,29,25)--金轮
	addevent(38,22,1,0,1,3408*2,30,25)--金轮
	addevent(38,23,1,0,1,4602*2,32,24)--郭襄
	addevent(38,24,1,0,1,3996*2,28,37)--黄药师
	addevent(38,25,1,0,1,4120*2,29,37)--
	addevent(38,26,1,0,1,4112*2,30,37)--
	addevent(38,27,1,0,1,2703*2,27,23)--小兵
	addevent(38,28,1,0,1,2703*2,28,23)--
	addevent(38,29,1,0,1,2703*2,29,23)--
	addevent(38,30,1,0,1,2703*2,30,23)--
	addevent(38,31,1,0,1,2703*2,31,23)--
	transferme(38,29,35,0)
	for i = 32,39 do
		null(107,i)
	end
	instruct_25(29,35,29,30); --镜头移动
	say("襄儿，你别急，爹爹妈妈都来救你了！", 55, 1,"郭靖");
	say("郭大侠，令爱聪明伶俐，老衲本有意收之为徒，传以衣钵。但大汗有旨，你若不归降，便将她火焚于高台之上。此事还请三思。", 62, 1,"金轮法王");
	say("郭靖只见四个万人队将这高台守得如此严密，血肉之躯如何冲得过去？何况即使冲近了，台下军士点火烧台，又怎能救得出女儿下来？", 928, 2);
	say("襄儿听着，你是大宋的好女儿，慷慨就义，不可害怕。爹娘今日救你不得，日后定当杀了这万恶奸僧，为你报仇。懂得了么！", 55, 1,"郭靖");
	say("爹爹妈妈，女儿不怕！", 154, 1, "郭襄");
	say("金轮法王，你料敌不明，是为不智；欺侮弱女，是为不仁；不敢与我们真刀真枪决战，是为不勇。如此不智慧不仁不勇之人，还充甚么英雄好汉？你在绝情谷给我擒住，向小姑娘郭襄连磕了十八个响头求饶，她才放你。你这忘恩负义、贪生怕死之徒，还有脸面身居蒙古第一国师之位？", 57, 1, "黄药师");
	say("向郭襄磕头求饶，其实并无此事，但黄药师深谋远虑，早在发兵之前便要黄蓉将这一番斥责法王的言辞译成了蒙古话，暗暗记熟。", 928, 2);
	say("这时以丹田之气朗声说了出来，虽在千万人大呼酣战之际，仍是人人听得明白，却教法王辩也不是，不辩也不是。蒙古人自来最尊敬的是勇士，最贱视的是懦夫，众军听了黄药师这几句话，不由得仰视高台，脸有鄙色。", 928, 2);
	say("郭靖，你听着，我从一数到十，‘十’字出口，你的爱女便成焦炭。一……二……三……四……", 62, 1,"金轮法王");
	say("……", 0, 1);	
	say("八……九……十！好，举火！", 62, 1,"金轮法王");
	say("忽听得远处一声清嘶鼓风而至，霎时间似乎将那千军万马的厮杀一齐淹没。郭襄心头一凛，这啸声动人心魄，当即转头往啸声处望去，只见西北方的蒙古兵翻翻滚滚，不住向两旁散开，两个人在刀山枪林中急驱而前，犹如大船破浪冲波而行。", 928, 2);
	say("但见左首一人青冠黄衫，正是杨过；右首那人白衣飘飘，却是个美貌女子。两人各执长剑，舞起一团白光，随在神雕身后，冲向高台。", 928, 2);
	dark()
	addevent(38,32,1,0,1,3093*2,26,30)--杨过
	addevent(38,33,1,0,1,3621*2,26,31)--龙女
	addevent(38,34,1,0,1,3096*2,26,32)--神雕
	light()
	JY.Person[58]["武功10"] = 25  --杨过洗黯然
	JY.Person[58]["武功等级10"] = 999
	QZXS("杨过学会黯然销魂掌！")
	say("小妹子莫慌，我来救你。", 58, 1,"杨过");	
	say("……", 62, 1,"金轮法王");
	SetS(106, 63, 1, 0, 58)
 	SetS(106, 63, 2, 0, 62)
	if WarMain(288) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	null(38,20)
	null(38,21)
	null(38,22)
	addevent(38,30,1,0,1,3983*2,29,25)--金轮挂
	say("巨奸虽毙，敌军未败，咱们再战。你累不累？", 58, 1,"杨过");
	say("这四句话前三句慷慨激昂，最后一句却转成了温柔体贴的调子。小龙女听罢淡淡一笑。", 928, 2);
	say("你说上，便上罢！", 59, 1,"小龙女");
	say("回救襄阳，去杀了那鞑子大汗！", 55, 1,"郭靖");
	for i = 20,34 do
		null(38,i)
	end
	addevent(107,30,1,3563,1,3619*2,18,45)--郭靖
	addevent(107,31,1,3563,1,3620*2,18,46)--黄蓉
	addevent(107,40,1,3563,1,3093*2,18,44)--杨过
	addevent(107,41,1,3563,1,3621*2,18,43)--龙女
	transferme(107,19,45,2)
	say("杨过飞石击毙蒙古大汗蒙哥，一国之主丧于城下，令得军心大沮。蒙古军兵败如山倒，无力再南攻，襄阳城得保太平。", 928, 2);
	say("过儿，你今日立此大功，天下扬名固不待言，合城军民，无不重感恩德。", 55, 1,"郭靖");
	say("少侠，听说你在找天书，这本《神雕侠侣》，你拿去吧。", 55, 1,"郭靖");
	addthing(153)
	say("多谢郭大侠。", 0, 1);	
	say("大哥，小弟这一生受你恩惠太多，若非大哥，杨过焉能得有今日？我夫妇二人今后愿跟随大哥。", 58, 1,"杨过");
	dark()
	null(107,30)
	null(107,31)
	null(107,40)
	null(107,41)
	light()	
	teammate(58)
	teammate(59)
end